{
  "1-1": {
    "verse": "\"Behold, I am doing a new thing; now it springs forth, do you not perceive it?\" (Isaiah 43:19)",
    "text": "Today marks a new beginning—a fresh start filled with possibilities. God eagerly desires to lead you into something new, transforming your life and renewing your hope. Recovery is not simply leaving behind the past; it's stepping confidently into God's future for you. Open your eyes today and see the new paths He is carving before you. Let go of what was, and embrace what can be, fully trusting that God's new beginnings will surpass your expectations.\n\n2 Corinthians 5:17 * Ezekiel 36:26 * Philippians 3:13-14"
  },
  "1-2": {
    "verse": "\"Seek the LORD and his strength; seek his presence continually!\" (1 Chronicles 16:11)",
    "text": "Recovery is not a one-time event but a daily choice—a continual pursuit of God's strength and presence. Your own strength might falter, but His never will. Today, intentionally seek God in every moment. Invite Him into each decision, thought, and action. As you consistently seek Him, you'll experience strength beyond your own abilities, empowering you to face whatever the day brings. Choose today to rely fully on His constant presence.\n\nPsalm 105:4 * Matthew 7:7 * Isaiah 55:6"
  },
  "1-3": {
    "verse": "\"For nothing will be impossible with God.\" (Luke 1:37)",
    "text": "Your journey of recovery might feel overwhelming, perhaps even impossible at times. Yet God specializes in turning impossible situations into powerful testimonies of His faithfulness. Today, surrender your fears, doubts, and impossibilities into His capable hands. Trust Him to transform every challenge into a stepping-stone toward victory. Remind yourself often that with God, no obstacle is too great and no struggle is beyond His power to heal.\n\nMatthew 19:26 * Jeremiah 32:27 * Mark 10:27"
  },
  "1-4": {
    "verse": "\"Draw near to God, and he will draw near to you.\" (James 4:8)",
    "text": "Recovery deepens when your relationship with God grows stronger. The closer you draw to Him, the more profoundly you will feel His presence, guidance, and comfort. Today, take intentional steps toward God: through prayer, reflection, and quiet time. Experience firsthand the loving way He meets you exactly where you are, responding generously and lovingly to your smallest effort. Enjoy the peace and intimacy found only in His nearness.\n\nPsalm 73:28 * Jeremiah 29:13 * Hebrews 7:25"
  },
  "1-5": {
    "verse": "\"Therefore do not be anxious about tomorrow, for tomorrow will be anxious for itself.\" (Matthew 6:34)",
    "text": "Recovery often feels overwhelming when you focus on all the steps still ahead. God encourages you today to live fully present in this moment. Release the anxieties about tomorrow into His hands, trusting Him to carry what you cannot. Each day holds enough grace for itself. Today, choose peace by resting in God's promises for this very moment, knowing He will be just as faithful tomorrow as He is today.\n\nPhilippians 4:6-7 * Proverbs 27:1 * Lamentations 3:22-23"
  },
  "1-6": {
    "verse": "\"But this I call to mind, and therefore I have hope: The steadfast love of the LORD never ceases.\" (Lamentations 3:21-22)",
    "text": "When past mistakes and setbacks overwhelm you, hope can seem distant. Yet God invites you today to remember His steadfast love, a love that never wavers despite your struggles. His compassion renews daily, providing a foundation of hope even in difficult moments. Today, choose to fix your thoughts on His unwavering faithfulness, letting this truth fill your heart with renewed hope and confidence to face whatever challenges lie ahead.\n\nHebrews 6:19 * Romans 15:13 * Psalm 33:22"
  },
  "1-7": {
    "verse": "\"God is our refuge and strength, a very present help in trouble.\" (Psalm 46:1)",
    "text": "Recovery often includes facing difficult circumstances that seem beyond your control. God promises that in those very moments, He is your safe haven and dependable source of strength. Today, instead of trying to face struggles alone, actively seek His presence and shelter. Trust His unwavering strength, leaning confidently into Him during every storm. Experience the reassurance that comes from knowing He is always near, ready to provide help exactly when you need it most.\n\nPsalm 91:2 * Nahum 1:7 * Isaiah 25:4"
  },
  "1-8": {
    "verse": "\"You are my hiding place; you will protect me from trouble and surround me with songs of deliverance.\" (Psalm 32:7)",
    "text": "The journey of recovery can sometimes make you feel vulnerable and exposed, overwhelmed by life's challenges. Today, God reassures you that He is your safe refuge, offering shelter and protection in every trial. Let Him be your hiding place, the secure haven you turn to whenever fear or temptation threaten your progress. Feel His protective presence surrounding you like a shield, filling your heart with confidence and joy, knowing you are safe within His care.\n\nPsalm 119:114 * Proverbs 18:10 * Zephaniah 3:17"
  },
  "1-9": {
    "verse": "\"And after you have suffered a little while, the God of all grace...will himself restore, confirm, strengthen, and establish you.\" (1 Peter 5:10)",
    "text": "Trials in recovery can feel endless, yet God's promise is that your suffering is temporary and purposeful. Every difficulty you face today is leading you toward greater strength, deeper wisdom, and a more solid foundation in Him. Trust that He personally oversees your healing and restoration, carefully working to strengthen and establish your life. Allow this promise to comfort your heart, trusting that the One who walks with you will faithfully bring you through every hardship.\n\nJames 1:2-4 * Romans 5:3-5 * 2 Corinthians 4:17"
  },
  "1-10": {
    "verse": "\"Fear not, for I have redeemed you; I have called you by name, you are mine.\" (Isaiah 43:1)",
    "text": "Recovery can sometimes cause feelings of worthlessness or shame. Yet God speaks directly to you, reminding you today that you are deeply valued, personally chosen, and fully redeemed. Your identity is not defined by past mistakes but by the love and grace of the One who calls you by name. Today, reject feelings of shame or unworthiness, embracing instead the truth that you belong wholly and securely to God, whose love never fails.\n\n1 John 3:1 * Romans 8:1 * Ephesians 1:7"
  },
  "1-11": {
    "verse": "\"The LORD your God goes with you; he will never leave you nor forsake you.\" (Deuteronomy 31:6)",
    "text": "Recovery can sometimes be a lonely journey, leaving you feeling isolated or abandoned. Today, remember God's unwavering promise: He will never leave you or turn His back on you. In every moment, both good and bad, His presence remains constant and comforting. Take heart in knowing you're never truly alone. Walk confidently today, fully assured that the One who stands beside you offers endless strength, guidance, and encouragement along your path.\n\nMatthew 28:20 * Joshua 1:5 * Hebrews 13:5-6"
  },
  "1-12": {
    "verse": "\"Seek the LORD and his strength; seek his presence continually!\" (1 Chronicles 16:11)",
    "text": "Recovery requires sustained strength, often more than you feel you possess. Today, God invites you to continually seek His presence and strength, knowing that your own efforts will inevitably run short. Make it a priority to connect with Him frequently through prayer, reflection, and quiet moments. Allow His strength to continually renew your energy and perspective, giving you endurance, hope, and clarity as you move forward.\n\nPsalm 105:4 * Isaiah 40:29-31 * Psalm 27:8"
  },
  "1-13": {
    "verse": "\"My flesh and my heart may fail, but God is the strength of my heart and my portion forever.\" (Psalm 73:26)",
    "text": "In recovery, moments of discouragement and weariness are inevitable. Yet even in your weakest moments, God remains steadfastly strong. Today, rather than relying solely on your own strength, lean fully into God, who promises to sustain and uphold you through every challenge. Trust that He is enough—not just today, but every day—providing exactly what you need when you need it most.\n\nIsaiah 40:28-31 * Philippians 4:13 * 2 Corinthians 12:9-10"
  },
  "1-14": {
    "verse": "\"Draw near to God, and he will draw near to you.\" (James 4:8)",
    "text": "At times, recovery may feel distant or disconnected from God's presence. But God promises to meet you exactly where you are, longing to draw close whenever you seek Him. Today, intentionally pursue a deeper connection with God through honest prayer, quiet reflection, and openness of heart. Experience His closeness, allowing His peace and comfort to reassure you of His constant, loving presence on your journey.\n\nHebrews 10:22 * Psalm 145:18 * Jeremiah 29:13"
  },
  "1-15": {
    "verse": "\"He gives power to the faint, and to him who has no might he increases strength.\" (Isaiah 40:29)",
    "text": "There are days when recovery feels exhausting, and your strength seems completely depleted. Remember today that God specializes in empowering those who feel faint, weary, or unable to continue. You don't have to rely solely on your own strength; instead, draw upon His limitless power. Trust Him to renew your energy, uplift your spirit, and sustain you even when you feel you have nothing left to give. Rest assured, His strength will carry you forward.\n\nPsalm 29:11 * Philippians 4:13 * Isaiah 41:10"
  },
  "1-16": {
    "verse": "\"Let the peace of Christ rule in your hearts, since as members of one body you were called to peace.\" (Colossians 3:15)",
    "text": "Recovery brings moments when inner peace feels elusive. Today, God gently reminds you to allow Christ's peace—not anxiety, fear, or uncertainty—to rule your heart and guide your thoughts. As you choose daily to surrender control to God, His peace becomes the dominant force within you, calming storms and providing clarity in confusion. Embrace this peace today, allowing it to restore your spirit and guide you forward with confidence and tranquility.\n\nJohn 14:27 * Philippians 4:6-7 * Romans 14:19"
  },
  "1-17": {
    "verse": "\"I will not leave you as orphans; I will come to you.\" (John 14:18)",
    "text": "In moments when you feel abandoned or forgotten in your recovery, remember this powerful promise from God: you are never alone. He personally reaches out, committed to comforting and guiding you at every turn. His presence transforms loneliness into companionship and sorrow into comfort. Today, trust His promise fully, finding reassurance that the One who loves you deeply remains by your side every step of your journey.\n\nPsalm 27:10 * Hebrews 13:5 * Isaiah 49:15-16"
  },
  "1-18": {
    "verse": "\"Be strong and courageous. Do not be frightened, and do not be dismayed, for the LORD your God is with you wherever you go.\" (Joshua 1:9)",
    "text": "Courage is essential in recovery, especially when facing the unknown or confronting difficult truths. God encourages you today not to fear, reminding you that He walks closely beside you in every situation. With His strength bolstering your heart, you can confidently step forward into healing and growth. Today, choose courage over fear, anchored by the certainty that you never walk this journey alone.\n\nDeuteronomy 31:6 * Psalm 31:24 * 1 Corinthians 16:13"
  },
  "1-19": {
    "verse": "\"The LORD is close to all who call on him, to all who call on him in truth.\" (Psalm 145:18)",
    "text": "Feeling disconnected or distant from God can intensify feelings of isolation in recovery. Yet God is always near, patiently awaiting your honest call. Today, openly share your heart, struggles, and needs with Him, trusting He hears every sincere word. His closeness offers comfort, strength, and reassurance. Lean into His attentive presence, knowing that your honesty and openness will always draw Him close to you.\n\nJeremiah 29:12-13 * Psalm 34:17-18 * James 4:8"
  },
  "1-20": {
    "verse": "\"For nothing will be impossible with God.\" (Luke 1:37)",
    "text": "Recovery sometimes involves facing challenges that feel overwhelming or impossible. But God reassures you today that nothing lies beyond His ability. Whatever difficulty you face, no matter how daunting, God is greater. Hold onto this promise as you confront obstacles, trusting that His strength and wisdom will help you overcome every barrier. Today, move forward confidently, knowing that with God, even the impossible becomes achievable.\n\nMark 10:27 * Jeremiah 32:27 * Matthew 19:26"
  },
  "1-21": {
    "verse": "\"Therefore, if anyone is in Christ, he is a new creation.\" (2 Corinthians 5:17)",
    "text": "Past mistakes or regrets can trap you in an identity you no longer claim. Today, remember that your true identity is found in Christ. You are not defined by your past but by the new creation God has declared you to be. Embrace this transformative truth today, allowing God to continually renew your mind, heart, and life. Let the old fall away, stepping confidently into the vibrant, hopeful future He has prepared for you.\n\nEzekiel 36:26 * Romans 6:4 * Ephesians 4:22-24"
  },
  "1-22": {
    "verse": "\"My presence will go with you, and I will give you rest.\" (Exodus 33:14)",
    "text": "Recovery can feel exhausting, but today God promises restful reassurance through His constant presence. You do not journey alone; He walks closely beside you, bringing peace, comfort, and restorative rest. Whenever you feel overwhelmed, pause and intentionally become aware of His presence. Allow His restful embrace to renew your strength, refresh your spirit, and give you the peace needed to continue your journey forward.\n\nPsalm 23:1-3 * Matthew 11:28-29 * Hebrews 4:9-10"
  },
  "1-23": {
    "verse": "\"When anxiety was great within me, your consolation brought me joy.\" (Psalm 94:19)",
    "text": "Anxiety can steal your joy, cloud your vision, and make recovery feel harder than necessary. But today, God promises joyful comfort even in moments of deep anxiety. Turn to Him in prayer, laying each worry at His feet, allowing His consolation to restore your joy and refresh your spirit. Let this divine comfort assure you that you're deeply understood, greatly cared for, and always supported in every struggle.\n\nPhilippians 4:6-7 * Matthew 6:25-34 * Isaiah 41:13"
  },
  "1-24": {
    "verse": "\"Taste and see that the LORD is good; blessed is the one who takes refuge in him.\" (Psalm 34:8)",
    "text": "Recovery is not merely about enduring struggles but experiencing God's goodness firsthand. Today, God invites you into a deeper experience of His kindness, grace, and provision. Seek opportunities to notice His presence in your life, savoring His blessings, however small or great. Trusting Him fully as your refuge and strength will transform challenges into moments of profound gratitude and genuine joy.\n\nPsalm 31:19 * Nahum 1:7 * 1 Peter 2:2-3"
  },
  "1-25": {
    "verse": "\"Blessed are those who hunger and thirst for righteousness, for they shall be satisfied.\" (Matthew 5:6)",
    "text": "Recovery is a hunger of the soul—a longing not just for relief from pain, but for something deeper, purer, and lasting. Today, God honors that hunger. He sees your desire to live differently, to walk in righteousness, and to pursue truth. And He promises that your hunger will not go unmet. As you seek Him with sincerity, He will fill the empty spaces, quench the thirst in your spirit, and nourish you with what the world could never offer. Let your desire for God today be your compass, leading you toward satisfaction that only He can provide.\n\nPsalm 42:1-2 * Isaiah 55:1-3 * John 6:35"
  },
  "1-26": {
    "verse": "\"Even though I walk through the valley of the shadow of death, I will fear no evil, for you are with me.\" (Psalm 23:4)",
    "text": "There are valleys in this journey—moments that feel dark, uncertain, or frightening. But God never promises to keep us from every valley. Instead, He promises to walk through them with us. His presence is constant, even when fear whispers lies and shadows loom. Today, remember you are never alone in your struggle. The Shepherd walks beside you, guiding your steps, comforting your heart, and bringing light to the darkest places. Take courage, knowing the One who walks with you has already overcome.\n\nIsaiah 43:2 * John 16:33 * Romans 8:38-39"
  },
  "1-27": {
    "verse": "\"Create in me a clean heart, O God, and renew a right spirit within me.\" (Psalm 51:10)",
    "text": "There's beauty in asking God to begin again within you. In recovery, it's easy to carry the weight of guilt or to feel like your heart is too stained to be cleansed. But God doesn't just forgive—He renews. He purifies. He restores your spirit. Today, ask Him boldly to make your heart new. Trust that He delights in restoration, not punishment. Let Him wash away the residue of the past and breathe new life into your spirit, one surrendered moment at a time.\n\nEzekiel 36:25-27 * Titus 3:5 * 1 John 1:9"
  },
  "1-28": {
    "verse": "\"Those who sow in tears shall reap with shouts of joy.\" (Psalm 126:5)",
    "text": "Some days in recovery feel like sowing seeds with trembling hands and tear-streaked cheeks. Progress is hard-won, and hope can feel distant. But God sees your quiet perseverance. Every tear you've cried, every small step you've taken, is planting a harvest of joy. The pain you feel today is not the end of your story—it's part of the process of renewal. Keep sowing, Brother. Keep trusting. The joy that is coming will be beyond what you can imagine.\n\nGalatians 6:9 * Isaiah 61:3 * John 16:20"
  },
  "1-29": {
    "verse": "\"Trust in him at all times, O people; pour out your heart before him; God is a refuge for us.\" (Psalm 62:8)",
    "text": "You don't have to have all the answers. You don't have to pretend to be strong. God invites you to come honestly, as you are, and pour out your heart before Him. There is no fear in His presence, only refuge. Today, make time to lay everything down—your doubts, fears, hopes, and needs. He already knows, and He deeply cares. His refuge is not earned; it's given freely. Rest in the safety of His arms and let Him carry the burdens you've been holding alone.\n\nLamentations 2:19 * Philippians 4:6 * 1 Peter 5:7"
  },
  "1-30": {
    "verse": "\"You will keep in perfect peace those whose minds are steadfast, because they trust in you.\" (Isaiah 26:3)",
    "text": "Peace is not found in the absence of problems but in the presence of God. In recovery, your mind may be filled with noise—regrets from the past, fears for the future, and the temptation to give up. But peace begins where trust begins. Today, fix your thoughts on the One who never fails. Anchor your mind in His truth and His promises. The storms may not stop, but His peace can reign within you in spite of them. That is the gift of perfect peace.\n\nJohn 14:27 * Colossians 3:15 * Psalm 119:165"
  },
  "1-31": {
    "verse": "\"For the Spirit God gave us does not make us timid, but gives us power, love and self-discipline.\" (2 Timothy 1:7)",
    "text": "God did not create you to shrink back. He formed you with purpose and placed within you the Spirit of power. In recovery, there will be days when fear tries to silence you or shame tries to steal your identity. But today, rise up in truth. You are not who you once were. God is giving you strength for the battle, love to overcome bitterness, and discipline to stay the course. Don't be afraid to walk boldly—He is with you, and His Spirit is alive within you.\n\nRomans 8:15 * Ephesians 3:16 * Joshua 1:7"
  },
  "2-1": {
    "verse": "\"For the LORD is good; his steadfast love endures forever, and his faithfulness to all generations.\" (Psalm 100:5)",
    "text": "As you continue your recovery journey, you may question whether good things can truly last. Life has taught you that people fail, promises break, and hope fades. But God is not like anyone you've known—His love doesn't weaken with time, and His faithfulness doesn't depend on your performance. Today, remember that His goodness is constant. No matter how far you've fallen or how long you've wandered, His enduring love is already waiting to meet you. Rest in the truth that He is faithful—not just to you, but to every generation who calls on His name.\n\nDeuteronomy 7:9 * Lamentations 3:22-23 * Hebrews 13:8"
  },
  "2-2": {
    "verse": "\"The name of the LORD is a strong tower; the righteous man runs into it and is safe.\" (Proverbs 18:10)",
    "text": "When you feel overwhelmed or vulnerable in recovery, you need a place to run—a shelter that cannot be shaken. The world offers false refuges, but only God offers true safety. His name is power, His presence a fortress. Today, run to Him—not to distraction, not to old habits, but to the God who stands ready to protect and comfort you. You don't have to fight alone. Let His strength become your security, and His faithfulness your shield.\n\nPsalm 91:2 * Isaiah 25:4 * Nahum 1:7"
  },
  "2-3": {
    "verse": "\"He must increase, but I must decrease.\" (John 3:30)",
    "text": "Recovery is not just about removing what's harmful—it's about making space for what heals. Today, consider the places in your heart where God is inviting you to surrender control. As His presence grows in you, pride, ego, and self-reliance must shrink. That's not weakness—it's freedom. You were never meant to carry this burden alone. Let Christ become greater in your life. In that letting go, you'll find new strength and clarity you never thought possible.\n\nGalatians 2:20 * Romans 12:1-2 * James 4:10"
  },
  "2-4": {
    "verse": "\"I waited patiently for the LORD; he inclined to me and heard my cry.\" (Psalm 40:1)",
    "text": "Waiting in recovery can feel like standing still while the world moves on without you. But waiting on God is never wasted time. He hears your cries, even the ones too quiet to voice. He bends down to listen—not as a distant king, but as a loving Father. Today, trust in His timing, even if your prayers seem unanswered. His silence is not absence. He is working in ways you cannot see, shaping a future far better than you imagined. Stay patient. Stay faithful. He hears you.\n\nIsaiah 30:18 * Romans 8:25 * Micah 7:7"
  },
  "2-5": {
    "verse": "\"Better is a little with the fear of the LORD than great treasure and trouble with it.\" (Proverbs 15:16)",
    "text": "In recovery, the world may tempt you with shortcuts, status, or success—but none of those things can give lasting peace. God teaches that true richness is found in reverence, simplicity, and trust. You don't need more “stuff” to be whole—you need more of Him. Today, find contentment in what He's already given you. When God fills your heart, the desire for fleeting pleasures fades. Real treasure is peace, integrity, and a life aligned with His will.\n\nEcclesiastes 4:6 * Matthew 6:19-21 * 1 Timothy 6:6"
  },
  "2-6": {
    "verse": "\"Restore to me the joy of your salvation, and uphold me with a willing spirit.\" (Psalm 51:12)",
    "text": "Recovery is not only about surviving—it's about rediscovering joy. The kind of joy that once felt impossible. The joy of knowing you've been saved, redeemed, and deeply loved. If that joy feels distant today, ask God to rekindle it. He is not looking for perfection—He's looking for willingness. A willing spirit can move mountains, heal hearts, and light a fire where there was only smoke. Ask Him today to restore your joy and renew your strength.\n\nNehemiah 8:10 * Isaiah 61:10 * Romans 15:13"
  },
  "2-7": {
    "verse": "\"Do not be overcome by evil, but overcome evil with good.\" (Romans 12:21)",
    "text": "There will be moments in recovery when anger, resentment, or bitterness try to creep back in. The enemy would love for you to retaliate or relapse—but God has a better way. Overcome darkness by living in the light. Speak kindness where you were once silent. Show love where you were once hardened. You have been given the strength to rise above the past and walk a new way—a better way. Choose good today. It's how victory begins.\n\nLuke 6:27-28 * Ephesians 4:31-32 * 1 Peter 3:9"
  },
  "2-8": {
    "verse": "\"The LORD is near to the brokenhearted and saves the crushed in spirit.\" (Psalm 34:18)",
    "text": "There's a kind of pain in recovery that words can't always express—a heaviness in the soul, a crushing in the spirit. But it's in those exact moments that God draws nearest. He doesn't wait for you to get it all together before showing up. He comes close in your brokenness, sits with you in the silence, and gently begins to heal what was shattered. Today, let Him near. You don't have to be whole to be held.\n\nIsaiah 57:15 * Matthew 5:4 * 2 Corinthians 1:3-4"
  },
  "2-9": {
    "verse": "\"Let your eyes look directly forward, and your gaze be straight before you.\" (Proverbs 4:25)",
    "text": "There are things behind you that try to call your name—mistakes, regrets, old habits. But you are no longer defined by what’s behind you. Today, God calls you to fix your gaze forward—to the healing, purpose, and life He is unfolding right now. Don’t waste energy replaying what He’s already forgiven. Lift your head. Set your eyes on the road ahead. It’s narrow, but it’s full of grace.\n\nPhilippians 3:13-14 * Isaiah 43:18-19 * Luke 9:62"
  },
  "2-10": {
    "verse": "\"He will cover you with his feathers, and under his wings you will find refuge.\" (Psalm 91:4)",
    "text": "There’s a kind of safety that only God can provide—a shelter not made of walls, but of presence. In the storms of recovery, when the winds howl and the temptations whisper, He gathers you beneath His wings. You are not exposed. You are not forgotten. You are protected by a love that shields and strengthens. Today, run to Him. Let His peace be your refuge and His closeness your covering.\n\nRuth 2:12 * Isaiah 32:2 * Psalm 17:8"
  },
  "2-11": {
    "verse": "\"And let us not grow weary of doing good, for in due season we will reap, if we do not give up.\" (Galatians 6:9)",
    "text": "Some days feel long and unrewarding—especially when you’re doing the hard work of rebuilding. It’s tempting to wonder if any of it really matters. But God promises that the seeds you plant today will bear fruit in time. Every act of honesty, every refusal to give in, every surrendered prayer—it all matters. Don’t give up. Don’t grow weary. The harvest is coming, and it’s going to be beautiful.\n\n1 Corinthians 15:58 * Hebrews 12:3 * James 1:12"
  },
  "2-12": {
    "verse": "\"You will seek me and find me, when you seek me with all your heart.\" (Jeremiah 29:13)",
    "text": "Sometimes it feels like God is far off, especially when the journey gets heavy. But He’s not hiding—He’s inviting. He promises that when you seek Him earnestly, you will find Him. Not just His help, but His presence. His peace. His love. Today, don’t settle for surface-level faith. Seek Him with your whole heart—your honest, trembling, hopeful heart—and discover just how close He really is.\n\nPsalm 63:1 * Matthew 7:7-8 * Deuteronomy 4:29"
  },
  "2-13": {
    "verse": "\"The LORD is my shepherd; I shall not want.\" (Psalm 23:1)",
    "text": "In recovery, you may feel like something’s always missing—like peace, purpose, or provision is always just out of reach. But with God as your Shepherd, you lack nothing that truly matters. He knows exactly what you need, when you need it, and how to lead you there. Let today be a day of trust—not in your plans, but in His care. He is enough. And in Him, so are you.\n\nJohn 10:11 * Philippians 4:19 * Isaiah 40:11"
  },
  "2-14": {
    "verse": "\"We love because he first loved us.\" (1 John 4:19)",
    "text": "Valentine’s Day often brings a mix of emotions—joy, loneliness, or longing. But today, remember the truest, deepest love you will ever know: God’s love. It came first. It comes still. It isn’t based on performance or perfection. It’s steady, sacrificial, and eternal. Let His love be the foundation of your healing. When you receive that love fully, you’re empowered to love others—genuinely, patiently, and freely.\n\nRomans 5:8 * Ephesians 3:17-19 * John 15:12"
  },
  "2-15": {
    "verse": "\"Be still before the LORD and wait patiently for him.\" (Psalm 37:7)",
    "text": "Recovery can stir restlessness in your spirit—the desire for quick fixes, immediate peace, or rapid change. But healing takes time. God’s rhythm isn’t rushed, and His work in you is deep, not shallow. Today, resist the urge to sprint. Instead, be still. Trust that while you wait, He’s moving. While you rest, He’s restoring. And while you’re still, He’s shaping your soul in ways that will last far beyond the moment.\n\nIsaiah 40:31 * Exodus 14:14 * Lamentations 3:25-26"
  },
  "2-16": {
    "verse": "\"The LORD is my light and my salvation—whom shall I fear?\" (Psalm 27:1)",
    "text": "Fear is a frequent visitor on the road to recovery—fear of failure, fear of rejection, fear of the unknown. But fear loses its grip when you remember who walks beside you. God is not just beside you; He is your light in the dark and your defender when you feel exposed. Let His presence today silence every fear that tries to creep in. You have nothing to prove, because you are already held.\n\nIsaiah 41:10 * John 8:12 * Romans 8:31"
  },
  "2-17": {
    "verse": "\"Teach me to do your will, for you are my God! Let your good Spirit lead me on level ground!\" (Psalm 143:10)",
    "text": "Recovery isn’t just about turning away from something—it’s about learning a new way to live. That requires guidance, humility, and a willingness to be taught. Today, invite God to lead you—not just to rescue you, but to reshape you. Ask Him to teach you His will, to place your feet on steady ground, and to lead you by His Spirit into the kind of life you were always meant to live.\n\nPsalm 25:4-5 * Proverbs 3:5-6 * John 14:26"
  },
  "2-18": {
    "verse": "\"Let everything that has breath praise the LORD!\" (Psalm 150:6)",
    "text": "Even in recovery—maybe especially in recovery—there’s reason to praise. Not because everything is perfect, but because God is present. Every breath you take is a gift. Every step forward is grace. Today, don’t wait for your life to be “together” before lifting your voice in thanks. Praise God in the middle of the mess, the climb, the healing. Worship isn’t reserved for mountaintops—it’s born in valleys.\n\nHebrews 13:15 * Psalm 34:1 * Habakkuk 3:17-19"
  },
  "2-19": {
    "verse": "\"For you formed my inward parts; you knitted me together in my mother’s womb.\" (Psalm 139:13)",
    "text": "You are not an accident. You are not beyond repair. Long before addiction, before trauma, before shame—God saw you, loved you, and began weaving a beautiful purpose into your life. Today, remember that your value is not based on what you’ve done or what you’ve been through, but on who made you. Let this truth uproot every lie you've believed about your worth. You are wonderfully made—and you are still being formed.\n\nJeremiah 1:5 * Ephesians 2:10 * Isaiah 64:8"
  },
  "2-20": {
    "verse": "\"Do not grieve, for the joy of the LORD is your strength.\" (Nehemiah 8:10)",
    "text": "Some days in recovery are heavy—marked by sorrow, regret, or emotional exhaustion. But even in grief, joy can live. Not a fake smile or empty optimism, but a joy that flows from the deep well of knowing God is with you and for you. Today, don’t wait for perfect circumstances to rejoice. Draw strength from the joy that comes from His presence. That joy will carry you farther than you ever imagined.\n\nPsalm 30:5 * John 16:22 * Romans 15:13"
  },
  "2-21": {
    "verse": "\"But the Lord stood by me and strengthened me.\" (2 Timothy 4:17)",
    "text": "Sometimes the hardest battles in recovery are fought when no one’s watching. You may feel forgotten, but you are never forsaken. Paul wrote this verse from prison—abandoned by people, but not by God. And the same is true for you. Even if others walk away, the Lord stands by you. He strengthens you—not just for survival, but for victory. Today, lean on the One who has never once left your side.\n\nDeuteronomy 31:8 * Psalm 18:32 * Hebrews 13:5-6"
  },
  "2-22": {
    "verse": "\"He will not let your foot be moved; he who keeps you will not slumber.\" (Psalm 121:3)",
    "text": "You might not always feel stable on this path—some days are shaky, and old habits try to creep in. But today, remember this: God never loses sight of you. He doesn't rest, doesn’t forget, and doesn’t stop guarding your steps. When you feel like you're about to slip, call out to Him. He is alert, active, and present—always. You are not walking this road alone, and He won’t let you fall unnoticed.\n\nPsalm 37:23-24 * Isaiah 41:10 * Jude 1:24"
  },
  "2-23": {
    "verse": "\"Out of my distress I called on the LORD; the LORD answered me and set me free.\" (Psalm 118:5)",
    "text": "True freedom doesn’t begin the day your external circumstances change—it begins the moment you call on the Lord. In recovery, that cry often comes from a place of desperation. And that's okay. God hears the honest cries of His children. He responds—not always by changing what’s around you, but by freeing what’s within you. Today, call on Him boldly. Freedom is not a myth—it’s a promise.\n\n2 Corinthians 3:17 * John 8:36 * Romans 6:22"
  },
  "2-24": {
    "verse": "\"So teach us to number our days that we may get a heart of wisdom.\" (Psalm 90:12)",
    "text": "Time is a gift, and in recovery, every day counts. Not because you need to rush, but because every moment offers an opportunity to grow, to choose differently, to love deeply. Ask God today to help you see your time the way He sees it—not with regret, but with purpose. You are not running out of time—you are learning to live wisely within it.\n\nEphesians 5:15-17 * James 4:14 * Ecclesiastes 3:1"
  },
  "2-25": {
    "verse": "\"The LORD is good, a stronghold in the day of trouble; he knows those who take refuge in him.\" (Nahum 1:7)",
    "text": "When trouble comes—and it will—you need more than just willpower. You need a stronghold. God isn’t just a hiding place; He is your fortress. And He doesn’t just “tolerate” you there—He knows you. Intimately. Lovingly. When you turn to Him, He doesn't turn away. He leans in. Today, whatever tries to shake you, run to the One who already knows you and calls you His own.\n\nPsalm 46:1 * Proverbs 18:10 * Isaiah 26:3-4"
  },
  "2-26": {
    "verse": "\"A bruised reed he will not break, and a faintly burning wick he will not quench.\" (Isaiah 42:3)",
    "text": "You may feel fragile—like your light is barely flickering. But God doesn’t discard the bruised or snuff out the struggling. He restores. He breathes on the embers until the flame returns. Today, if you feel weak, remember: your weakness doesn’t repel Him—it draws Him near. He’s not here to condemn your condition. He’s here to lift you gently, heal you slowly, and love you completely.\n\nMatthew 12:20 * Psalm 147:3 * 2 Corinthians 12:9"
  },
  "2-27": {
    "verse": "\"Whoever walks in integrity walks securely.\" (Proverbs 10:9)",
    "text": "In recovery, there’s a deep peace that comes from doing the next right thing—even when no one’s watching. Integrity might not always be easy, but it builds a foundation that can’t be shaken. Today, walk with honesty. Speak with truth. Do what honors God, even in small choices. Security isn’t about what you own or control—it’s about who you are when your heart is aligned with His.\n\nPsalm 15:1-2 * Micah 6:8 * Colossians 3:23-24"
  },
  "2-28": {
    "verse": "\"He brought me out into a broad place; he rescued me, because he delighted in me.\" (Psalm 18:19)",
    "text": "God didn’t just rescue you out of obligation—He did it because He delights in you. He doesn’t just tolerate your recovery—He celebrates it. He wants to bring you into wide-open places of freedom, peace, and purpose. Today, believe this: you are deeply loved. Not for what you do, but for who you are. And His rescue is not just about survival—it’s about joy.\n\nZephaniah 3:17 * Isaiah 61:10 * John 10:10"
  },
  "3-1": {
    "verse": "\"Call to me and I will answer you and tell you great and unsearchable things you do not know.\" (Jeremiah 33:3",
    "text": "Recovery often brings questions—about purpose, about identity, about tomorrow. God promises that when you reach out to Him in honesty and need, He responds with wisdom and insight beyond your current understanding. Today, don’t hold back your doubts or fears. Call out, and expect Him to answer. His perspective will illuminate paths you couldn’t see before, turning uncertainty into confident hope.\n\nProverbs 2:6 * James 1:5 * Psalm 25:4-5"
  },
  "3-2": {
    "verse": "\"Your word is a lamp to my feet and a light to my path.\" (Psalm 119:105)",
    "text": "In recovery, it’s easy to stumble in the dark—temptations, regrets, and old habits waiting in the shadows. God’s Word doesn’t promise to banish every obstacle instantly, but it does shine brightly on the next right step. Today, lean into Scripture: read a verse, meditate on it, and let it guide you past uncertainties. Even a small flicker of truth can keep you from tripping over what lies ahead.\n\nPsalm 19:8 * Proverbs 6:23 * 2 Timothy 3:16"
  },
  "3-3": {
    "verse": "\"If any of you lacks wisdom, you should ask God, who gives generously to all without finding fault.\" (James 1:5)",
    "text": "Recovery decisions—big and small—can be overwhelming. God isn’t looking for perfect answers; He wants you to turn to Him for insight. When you ask, ask believing that He delights in equipping you, not judging you. Today, pray for wisdom before every choice: meals, relationships, routines. Expect His generous help to shape each decision, one step at a time.\n\nProverbs 3:5-6 * Colossians 1:9 * Jeremiah 29:11"
  },
  "3-4": {
    "verse": "\"In all your ways acknowledge him, and he will make straight your paths.\" (Proverbs 3:6)",
    "text": "It’s tempting to carve out recovery on your own terms—your schedule, your comfort zone. But God invites you to include Him in every plan: morning routines, daily commitments, long-term goals. Today, pause before action and acknowledge Him: “God, I need You in this.” Watch how He straightens what feels crooked, opening doors of peace, clarity, and momentum you hadn’t expected.\n\nPsalm 37:23 * Isaiah 30:21 * Philippians 4:6-7"
  },
  "3-5": {
    "verse": "\"When you pass through the waters, I will be with you; and through the rivers, they shall not overwhelm you.\" (Isaiah 43:2)",
    "text": "There are seasons in recovery that feel like drowning—waves of emotion, guilt, or fear. Yet God’s promise stands: He doesn’t rescue you by keeping you dry; He walks with you through the flood. Today, if pressures rise around you, remind yourself: He is right beside you, shoulder to shoulder, guiding you step by step. No current can sweep you away when He holds you close.\n\nPsalm 46:1-2 * 2 Timothy 4:18 * Romans 8:38-39"
  },
  "3-6": {
    "verse": "\"I can do all things through him who strengthens me.\" (Philippians 4:13)",
    "text": "Some days, recovery feels like running a race with no finish line. But the strength you need isn’t yours—it’s His. When you feel depleted, repeat this promise: you can persevere because He empowers you. Today, face your challenges—work, relationships, temptations—knowing that His stamina flows into your weakness, turning overcoming into your daily rhythm.\n\nIsaiah 40:29 * 2 Corinthians 12:9-10 * Ephesians 6:10"
  },
  "3-7": {
    "verse": "\"Cast all your anxiety on him because he cares for you.\" (1 Peter 5:7)",
    "text": "Anxiety often tells us we must carry our worries alone. But God invites you to trade the weight of fear for His attentive care. Picture handing each concern—finances, relationships, health—into His outstretched hands. Today, practice that exchange: whenever anxiety strikes, pause, pray, and consciously release it to Him. Feel His peace settle in its place, because He truly cares about every detail of your life.\n\nMatthew 11:28-30 * Philippians 4:6-7 * Psalm 55:22"
  },
  "3-8": {
    "verse": "",
    "text": ""
  },
  "3-9": {
    "verse": "",
    "text": ""
  },
  "3-10": {
    "verse": "",
    "text": ""
  },
  "3-11": {
    "verse": "",
    "text": ""
  },
  "3-12": {
    "verse": "",
    "text": ""
  },
  "3-13": {
    "verse": "",
    "text": ""
  },
  "3-14": {
    "verse": "",
    "text": ""
  },
  "3-15": {
    "verse": "",
    "text": ""
  },
  "3-16": {
    "verse": "",
    "text": ""
  },
  "3-17": {
    "verse": "",
    "text": ""
  },
  "3-18": {
    "verse": "",
    "text": ""
  },
  "3-19": {
    "verse": "",
    "text": ""
  },
  "3-20": {
    "verse": "",
    "text": ""
  },
  "3-21": {
    "verse": "",
    "text": ""
  },
  "3-22": {
    "verse": "",
    "text": ""
  },
  "3-23": {
    "verse": "",
    "text": ""
  },
  "3-24": {
    "verse": "",
    "text": ""
  },
  "3-25": {
    "verse": "",
    "text": ""
  },
  "3-26": {
    "verse": "",
    "text": ""
  },
  "3-27": {
    "verse": "",
    "text": ""
  },
  "3-28": {
    "verse": "",
    "text": ""
  },
  "3-29": {
    "verse": "",
    "text": ""
  },
  "3-30": {
    "verse": "",
    "text": ""
  },
  "3-31": {
    "verse": "",
    "text": ""
  },
  "4-1": {
    "verse": "",
    "text": ""
  },
  "4-2": {
    "verse": "",
    "text": ""
  },
  "4-3": {
    "verse": "",
    "text": ""
  },
  "4-4": {
    "verse": "",
    "text": ""
  },
  "4-5": {
    "verse": "",
    "text": ""
  },
  "4-6": {
    "verse": "",
    "text": ""
  },
  "4-7": {
    "verse": "",
    "text": ""
  },
  "4-8": {
    "verse": "",
    "text": ""
  },
  "4-9": {
    "verse": "",
    "text": ""
  },
  "4-10": {
    "verse": "",
    "text": ""
  },
  "4-11": {
    "verse": "",
    "text": ""
  },
  "4-12": {
    "verse": "",
    "text": ""
  },
  "4-13": {
    "verse": "",
    "text": ""
  },
  "4-14": {
    "verse": "",
    "text": ""
  },
  "4-15": {
    "verse": "",
    "text": ""
  },
  "4-16": {
    "verse": "",
    "text": ""
  },
  "4-17": {
    "verse": "",
    "text": ""
  },
  "4-18": {
    "verse": "",
    "text": ""
  },
  "4-19": {
    "verse": "",
    "text": ""
  },
  "4-20": {
    "verse": "",
    "text": ""
  },
  "4-21": {
    "verse": "",
    "text": ""
  },
  "4-22": {
    "verse": "",
    "text": ""
  },
  "4-23": {
    "verse": "",
    "text": ""
  },
  "4-24": {
    "verse": "",
    "text": ""
  },
  "4-25": {
    "verse": "",
    "text": ""
  },
  "4-26": {
    "verse": "",
    "text": ""
  },
  "4-27": {
    "verse": "",
    "text": ""
  },
  "4-28": {
    "verse": "",
    "text": ""
  },
  "4-29": {
    "verse": "",
    "text": ""
  },
  "4-30": {
    "verse": "",
    "text": ""
  },
  "5-1": {
		"verse": "\"Be still, and know that I am God.\" (Psalm 46:10)",
		"text": "In recovery, there is often pressure to constantly move forward, to keep pace with expectations, and to prove progress. But healing does not always come through relentless action; sometimes, it arises most powerfully in stillness. God invites you today into a quiet place with Him—a place free from the noise and demands of the world around you. In these sacred moments, as you pause and listen for His voice, you'll discover that your greatest breakthroughs often occur when you cease striving and simply rest in His presence. Embrace this opportunity to slow down, acknowledging God's sovereignty over your situation. Trust that He is actively at work in your life, even when you cannot yet see the evidence. Your strength, peace, and clarity come directly from the quiet assurance that He is in control. \n\nExodus 14:14 * Isaiah 30:15 * Mark 4:39"
	},
	"5-2": {
		"verse": "\"Come to me, all who labor and are heavy laden, and I will give you rest.\" (Matthew 11:28)",
		"text": "Recovery can often feel overwhelming, but remember, you do not face this journey alone. Living in dependence on God provides strength and relief beyond your own abilities. In moments of exhaustion or despair, draw close to Him, and let His presence comfort you. Each step, no matter how small or hesitant, becomes lighter when you allow God to carry your burdens. Trust His promise of rest and restoration, and find peace in knowing you are held securely in His care. Let today be a reminder to lean fully into His loving support. \n\nPsalm 62:1-2 * Isaiah 40:31 * Matthew 11:29-30"
	},
	"5-3": {
		"verse": "\"I can do all things through him who strengthens me.\" (Philippians 4:13)",
		"text": "In the face of life's challenges, it's easy to feel inadequate or powerless. Yet God assures us that His strength is always available, ready to empower us to overcome our struggles. Instead of viewing hardships as insurmountable, consider them opportunities to experience God's power working through you. As you lean into His strength, difficult tasks become moments of deep spiritual growth. Today, consciously choose to rely on God's strength, confident in His promise that you can handle all things through Him. \n\n2 Corinthians 12:10 * Isaiah 41:13 * Ephesians 6:10"
	},
	"5-4": {
		"verse": "\"He heals the brokenhearted and binds up their wounds.\" (Psalm 147:3)",
		"text": "Your past experiences and pain do not have to dictate your future. God specializes in healing the wounds that seem impossible to mend. As you face your recovery journey, let God gently tend to your broken heart. Trust Him to restore what seems lost, binding up emotional and spiritual wounds with His tender care. Your willingness to open up to His healing touch marks the beginning of true restoration. Today, invite God into your most vulnerable places, knowing His healing is thorough and lasting.\n\nJeremiah 30:17 * Isaiah 61:1 * Psalm 34:18"
	},
	"5-5": {
		"verse": "\"Fear not, for I am with you; be not dismayed, for I am your God.\" (Isaiah 41:10)",
		"text": "Fear can paralyze you, especially during difficult seasons of recovery. But God calls you to courage, promising His unwavering presence. Whenever you feel overwhelmed by uncertainty or doubt, pause and remember that God is always near. By shifting your focus to His steadfastness, fear loses its grip. Today, choose faith over fear, confident that God walks with you, guiding each step towards healing and hope. Trust His promise to never leave you nor forsake you.\n\nDeuteronomy 31:6 * Joshua 1:9 * Psalm 56:3"
	},
	"5-6": {
		"verse": "\"Therefore, if anyone is in Christ, he is a new creation. The old has passed away; behold, the new has come.\" (2 Corinthians 5:17)",
		"text": "Your recovery journey is not merely about leaving behind the old, but embracing the profound transformation available in Christ. Each day brings fresh mercy and new opportunities to grow spiritually, emotionally, and mentally. God invites you to shed your past, stepping boldly into the new identity He has crafted specifically for you. As you move forward, remind yourself that you are a cherished creation, constantly renewed by His grace. Today, walk confidently in this newness, fully aware that the old has no hold over your future.\n\nRomans 6:4 * Ezekiel 36:26 * Revelation 21:5"
	},
	"5-7": {
		"verse": "\"Cast all your anxiety on him because he cares for you.\" (1 Peter 5:7)",
		"text": "Anxiety can consume your thoughts, draining you of peace and joy. Yet, God offers Himself as the bearer of your burdens, lovingly inviting you to cast your anxieties upon Him. When you feel worry begin to rise, take a moment to consciously surrender those feelings to God. This small act of trust strengthens your reliance on Him, replacing anxiety with His peace. Today, remind yourself of His unwavering care, confident that every concern is seen and held by Him.\n\nPhilippians 4:6-7 * Matthew 6:34 * Psalm 55:22"
	},
	"5-8": {
		"verse": "\"My grace is sufficient for you, for my power is made perfect in weakness.\" (2 Corinthians 12:9)",
		"text": "Your weaknesses and limitations are not barriers to God's grace—they are the very reasons His grace is necessary. In your moments of vulnerability, remember that God's grace meets you precisely there, providing strength and resilience you never imagined possible. His grace transforms your shortcomings into testimonies of His power. Today, embrace your weaknesses as opportunities for God to manifest His strength, trusting that His grace is always sufficient for every need.\n\nHebrews 4:16 * Ephesians 2:8-9 * Isaiah 40:29"
	},
  "5-9": {
    "verse": "\"The steadfast love of the LORD never ceases; his mercies never come to an end; they are new every morning.\" (Lamentations 3:22-23)",
    "text": "Recovery often feels like a daily battle, with yesterday's struggles sometimes lingering into today. Yet, God offers fresh mercy each morning, washing away yesterday's burdens with abundant grace. His love isn't limited by your past mistakes or struggles; it's renewed daily, unwavering in its depth and sincerity. As you wake today, remind yourself that God meets you right where you are, offering the exact measure of grace needed for the day ahead. Let His steadfast love energize your spirit and renew your hope, trusting that each day carries the promise of new beginnings through Him.\n\nPsalm 30:5 * Isaiah 33:2 * James 4:6"
  },
  "5-10": {
    "verse": "\"Do not be conformed to this world, but be transformed by the renewal of your mind.\" (Romans 12:2)",
    "text": "Transformation in recovery starts from within, beginning with the renewal of your mind. The world may remind you of past failures or define you by mistakes, but God sees you differently. He sees a redeemed, restored, and purposeful life ahead of you. Today, make a conscious effort to replace negative self-talk with the powerful truths of God's Word. Allow your thinking to be reshaped by His perspective, creating new patterns of hope, resilience, and confidence rooted firmly in Christ. As your mind is transformed, you'll experience profound freedom and a life that increasingly reflects His love.\n\nColossians 3:2 * Philippians 4:8 * 2 Corinthians 10:5"
  },
  "5-11": {
    "verse": "\"The LORD your God is in your midst, a mighty one who will save; he will rejoice over you with gladness.\" (Zephaniah 3:17)",
    "text": "Sometimes the weight of our mistakes and regrets can feel overwhelming, convincing us that we're undeserving of joy or celebration. But God doesn't look upon you with disappointment or frustration—instead, He rejoices over your courage, your perseverance, and your journey toward healing. Today, remind yourself that God is actively celebrating your progress, no matter how small or unseen by others. Feel His loving presence rejoicing with you, knowing that your victories, even the quiet ones, matter deeply to Him. You are seen, loved, and celebrated by the One who holds all things together.\n\nIsaiah 62:5 * Luke 15:7 * Psalm 149:4"
  },
  "5-12": {
    "verse": "\"I waited patiently for the LORD; he inclined to me and heard my cry.\" (Psalm 40:1)",
    "text": "Patience is among the hardest virtues in recovery. Waiting for healing, clarity, or breakthrough can test your faith and resilience. Yet, God promises that your waiting is never wasted. He hears every whispered prayer, sees every silent tear, and deeply understands your heart's longing. In the waiting, He shapes you, strengthens your faith, and prepares you for blessings beyond your understanding. Today, trust that your prayers and patience will yield fruit in God's perfect timing. Embrace the assurance that God is attentively listening, faithfully preparing answers far greater than your expectations.\n\nIsaiah 40:31 * Psalm 27:14 * Romans 8:25"
  },
  "5-13": {
    "verse": "\"But they who wait for the LORD shall renew their strength; they shall mount up with wings like eagles.\" (Isaiah 40:31)",
    "text": "There are days when recovery feels draining, and your strength seems insufficient. Yet God promises renewal—not through striving, but through trusting and waiting on Him. Just as an eagle effortlessly soars by relying on currents rather than its own strength, you too can rise above challenges by resting in God's grace. Today, resist the urge to rely solely on your abilities; instead, intentionally rest in His presence, allowing His strength to lift you above weariness and worry. Experience the freedom that comes when you let God carry you, enabling you to soar beyond your struggles.\n\nPsalm 103:5 * Exodus 19:4 * 2 Corinthians 4:16"
  },
  "5-14": {
    "verse": "\"Peace I leave with you; my peace I give to you. Not as the world gives do I give to you.\" (John 14:27)",
    "text": "In a world full of uncertainties, recovery requires a peace that transcends circumstances—a peace only God can provide. Human efforts might offer temporary calm, but Christ gives enduring peace that anchors your soul amidst life's storms. This divine peace doesn't remove challenges, but it assures you of God's unchanging presence and steadfast love in the midst of difficulty. Today, surrender your anxieties and worries, receiving the gift of Christ's perfect peace. Let it guard your heart, guide your decisions, and reassure you that, with Him, you can confidently face whatever lies ahead.\n\nPhilippians 4:7 * Colossians 3:15 * Isaiah 26:3"
  },
  "5-15": {
    "verse": "\"He restores my soul. He leads me in paths of righteousness for his name's sake.\" (Psalm 23:3)",
    "text": "Recovery is not merely an outward change—it's a deep restoration of your soul by God Himself. Just as a skilled artist gently restores a precious masterpiece, God carefully renews your heart, bringing healing to the weary places within you. Today, embrace this truth: your soul is precious and valuable in His eyes. Allow Him to lead you along the path He's prepared, a path filled with purpose, hope, and renewal. Trust His guidance, confident that His restoration is always complete, perfect, and driven by His steadfast love for you.\n\nPsalm 51:12 * Isaiah 58:11 * 1 Peter 5:10"
  },
  "5-16": {
    "verse": "\"For we are his workmanship, created in Christ Jesus for good works, which God prepared beforehand.\" (Ephesians 2:10)",
    "text": "There are times in recovery when you might doubt your worth or question your purpose. Yet God lovingly reminds you today that you are intentionally crafted by His own hands, designed uniquely and purposefully for good things. Your past does not disqualify you; it becomes part of your testimony and equips you to help others who walk a similar road. Today, embrace your identity as God's workmanship, fully aware that He delights in transforming your experiences into opportunities for blessing, healing, and restoration—both for you and those around you.\n\nPhilippians 2:13 * Jeremiah 29:11 * Psalm 139:14"
  },
  "5-17": {
    "verse": "\"I have loved you with an everlasting love; therefore I have continued my faithfulness to you.\" (Jeremiah 31:3)",
    "text": "In recovery, feeling unloved or forgotten can be especially painful. But God reassures you today that His love for you is eternal, unwavering, and unchanging. Even when circumstances seem overwhelming or mistakes seem too great, His faithful love remains steadfast. You can never wander beyond the reach of His affection. Today, let yourself rest in this truth: God's love is everlasting, deeply personal, and stronger than any trial or failure you face. Let His faithful presence comfort your heart and strengthen your resolve.\n\nRomans 8:38-39 * Isaiah 54:10 * Psalm 136:26"
  },
  "5-18": {
    "verse": "\"The righteous cry out, and the LORD hears them; he delivers them from all their troubles.\" (Psalm 34:17)",
    "text": "During recovery, the feeling of isolation can be profound. It's easy to believe that no one truly understands your struggles or hears your cries. Yet today, God assures you that He listens intently, ready and willing to help. Your voice matters to Him; your pain does not go unnoticed. Cry out freely to God, knowing with confidence that He hears every word and sees every tear. Trust Him to deliver you, comfort you, and guide you through your troubles, bringing peace and clarity even in the midst of turmoil.\n\nPsalm 145:18 * Isaiah 65:24 * 2 Samuel 22:7"
  },
  "5-19": {
    "verse": "\"And behold, I am with you always, to the end of the age.\" (Matthew 28:20)",
    "text": "Recovery can often feel lonely, especially when past relationships have strained or changed. Yet God gives an unbreakable promise: He will never leave you alone. Whether you're experiencing joy or navigating pain, His presence remains constant. Today, remind yourself of this comforting truth: God walks with you, step by step, through every part of your journey. You are never abandoned, never forgotten. Allow His constant companionship to strengthen your heart, reassure your spirit, and provide deep, lasting comfort.\n\nDeuteronomy 31:8 * Hebrews 13:5 * Psalm 139:7-10"
  },
  "5-20": {
    "verse": "\"You keep him in perfect peace whose mind is stayed on you, because he trusts in you.\" (Isaiah 26:3)",
    "text": "True peace in recovery does not depend on external circumstances, but on where you place your trust. When your thoughts are fixed on God and His promises rather than on worries or fears, you'll find a peace that surpasses understanding. Today, intentionally set your mind on God's character—His goodness, faithfulness, and unwavering love. As your focus shifts from anxiety to trust, experience a profound sense of calm, clarity, and security. Allow His perfect peace to settle deeply within you, anchoring your heart amid life's challenges.\n\nJohn 16:33 * Romans 8:6 * Philippians 4:9"
  },
  "5-21": {
    "verse": "\"Let us then with confidence draw near to the throne of grace, that we may receive mercy.\" (Hebrews 4:16)",
    "text": "Sometimes recovery can make you feel unworthy to approach God—yet the opposite is true. God invites you to confidently approach Him precisely when you feel weakest, most broken, or most unworthy. His throne is a place of grace, acceptance, and unconditional love. Today, boldly enter His presence, knowing you'll find mercy, not judgment; acceptance, not rejection. Let this assurance remove your hesitations and doubts, allowing you to experience the fullness of His loving embrace, healing, and restoration.\n\nEphesians 3:12 * Romans 5:2 * James 4:8"
  },
  "5-22": {
    "verse": "\"For I know the plans I have for you, declares the LORD, plans for welfare and not for evil, to give you a future and a hope.\" (Jeremiah 29:11)",
    "text": "When recovery feels uncertain, you may wonder if there's truly a hopeful future waiting for you. God reassures you today that your future is secure in His hands. Though the path may sometimes seem unclear or difficult, each step is thoughtfully planned by a loving Father who wants only the best for you. Trust that even your struggles have purpose, shaping you into the person He has destined you to become. Today, lean into His promise and find comfort knowing that your story is still being written, and God Himself is the Author who lovingly crafts each page.\n\nProverbs 19:21 * Romans 8:28 * Isaiah 55:8-9"
  },
  "5-23": {
    "verse": "\"If the Son sets you free, you will be free indeed.\" (John 8:36)",
    "text": "Recovery is a journey toward true freedom—not just from addiction, guilt, or shame, but into a new life filled with purpose, joy, and hope. Christ offers you complete and lasting freedom, breaking the chains of your past and empowering you to walk boldly forward. You no longer need to carry the burden of old labels or past mistakes. Today, embrace the freedom Christ provides. Let it redefine you, restore you, and inspire you to live fully and abundantly as the beloved child of God you truly are.\n\nGalatians 5:1 * Romans 6:14 * 2 Corinthians 3:17"
  },
  "5-24": {
    "verse": "\"The LORD is my strength and my shield; in him my heart trusts, and I am helped.\" (Psalm 28:7)",
    "text": "When facing battles in your recovery, it's natural to feel vulnerable and exposed. Yet God promises to stand between you and every obstacle, becoming your shield and strength. Trust is the key to experiencing this divine protection fully. As you trust Him with your deepest fears and struggles, His power becomes tangible in your life, helping you overcome what once seemed insurmountable. Today, actively place your trust in Him, knowing He is your unshakable defense and unwavering support in every challenge you face.\n\nPsalm 18:2 * Ephesians 6:16 * Isaiah 12:2"
  },
  "5-25": {
    "verse": "\"I am making a way in the wilderness and streams in the wasteland.\" (Isaiah 43:19)",
    "text": "There are moments in recovery when the path ahead feels impossible—like a wilderness with no clear direction. In these times, God's promise is especially powerful: He creates paths where none exist, refreshing your soul in the driest places. Today, trust Him to open doors, provide clarity, and lead you forward, even when you can't see the way clearly. Hold onto hope, knowing He specializes in making a way out of impossible situations, bringing life and renewal into every area of your journey.\n\nPsalm 77:19 * Isaiah 35:6-7 * Revelation 21:6"
  },
  "5-26": {
    "verse": "\"Though the righteous fall seven times, they rise again.\" (Proverbs 24:16)",
    "text": "Recovery does not require perfection, only perseverance. God understands that stumbling is part of the human experience, and His grace is sufficient to lift you each time you fall. Every setback you face provides an opportunity to experience God's mercy anew, drawing you closer to His heart. Today, refuse to define yourself by the times you've fallen. Instead, focus on His strength that empowers you to rise again, stronger and wiser with each step. Your journey is measured by resilience, not perfection, and God is with you every step of the way.\n\nMicah 7:8 * Psalm 37:23-24 * Romans 8:37"
  },
  "5-27": {
    "verse": "\"Come near to God and he will come near to you.\" (James 4:8)",
    "text": "Feelings of isolation or distance from God can make recovery harder than it needs to be. Yet God invites you into an intimate relationship, promising closeness whenever you draw near to Him. Today, choose to actively approach God through prayer, meditation, and moments of quiet reflection. Let your heart be honest before Him, confident that He meets every effort you make with open arms. Experience His gentle, healing presence that comforts, guides, and strengthens you as you continue your journey.\n\nJeremiah 29:12-13 * Psalm 145:18-19 * Hebrews 10:22"
  },
  "5-28": {
    "verse": "\"I will instruct you and teach you in the way you should go; I will counsel you with my loving eye on you.\" (Psalm 32:8)",
    "text": "Recovery often involves difficult decisions, leaving you unsure of which direction to take. But you're never left to navigate these crossroads alone. God lovingly promises clear instruction, gentle guidance, and unwavering support. Today, pause and actively seek His wisdom for every choice you face, no matter how small it seems. Trust that He sees your entire journey, understands your deepest needs, and will faithfully guide you toward healing, growth, and lasting peace. Allow yourself to be led confidently by the One who lovingly watches over you.\n\nIsaiah 48:17 * Proverbs 3:6 * John 16:13"
  },
  "5-29": {
    "verse": "\"Cast your burden on the LORD, and he will sustain you; he will never permit the righteous to be moved.\" (Psalm 55:22)",
    "text": "Carrying your burdens alone can make recovery exhausting, yet God invites you to release the weight of your worries onto Him. Each anxiety surrendered to God is met with divine strength, providing the stability and peace your heart deeply craves. Today, release your burdens one by one into God's hands, trusting Him completely to uphold and sustain you. Allow His steadfastness to steady you amid life's uncertainties, knowing He promises security to those who lean fully upon Him.\n\nMatthew 11:28-30 * 1 Peter 5:7 * Isaiah 46:4"
  },
  "5-30": {
    "verse": "\"The LORD is good, a stronghold in the day of trouble; he knows those who take refuge in him.\" (Nahum 1:7)",
    "text": "Trouble often feels overwhelming, leaving you uncertain about where to find comfort and safety. Today, God reminds you that He is your secure refuge—a place of peace, protection, and unconditional acceptance. He intimately knows your struggles, your needs, and the desires of your heart. Trust in His goodness; find rest and renewal in His loving presence. Choose today to actively seek refuge in Him, knowing He will never fail to shelter, strengthen, and support you in your time of need.\n\nPsalm 46:1 * Psalm 91:2 * Proverbs 18:10"
  },
  "5-31": {
    "verse": "\"And we know that for those who love God all things work together for good.\" (Romans 8:28)",
    "text": "Even the most difficult parts of your recovery hold hidden purpose and promise when viewed through God's perspective. Though circumstances may seem painful or confusing right now, He is actively orchestrating them for your ultimate good. Today, choose to trust that nothing in your story is wasted—every trial, every setback, every step forward is carefully woven by God into a tapestry of restoration and hope. Let this assurance fill you with courage and patience, confident that God is working powerfully behind the scenes on your behalf.\n\nGenesis 50:20 * Jeremiah 29:11-13 * Ephesians 1:11"
  },
  "6-1": {
    "verse": "",
    "text": ""
  },
  "6-2": {
    "verse": "",
    "text": ""
  },
  "6-3": {
    "verse": "",
    "text": ""
  },
  "6-4": {
    "verse": "",
    "text": ""
  },
  "6-5": {
    "verse": "",
    "text": ""
  },
  "6-6": {
    "verse": "",
    "text": ""
  },
  "6-7": {
    "verse": "",
    "text": ""
  },
  "6-8": {
    "verse": "",
    "text": ""
  },
  "6-9": {
    "verse": "",
    "text": ""
  },
  "6-10": {
    "verse": "",
    "text": ""
  },
  "6-11": {
    "verse": "",
    "text": ""
  },
  "6-12": {
    "verse": "",
    "text": ""
  },
  "6-13": {
    "verse": "",
    "text": ""
  },
  "6-14": {
    "verse": "",
    "text": ""
  },
  "6-15": {
    "verse": "",
    "text": ""
  },
  "6-16": {
    "verse": "",
    "text": ""
  },
  "6-17": {
    "verse": "",
    "text": ""
  },
  "6-18": {
    "verse": "",
    "text": ""
  },
  "6-19": {
    "verse": "",
    "text": ""
  },
  "6-20": {
    "verse": "",
    "text": ""
  },
  "6-21": {
    "verse": "",
    "text": ""
  },
  "6-22": {
    "verse": "",
    "text": ""
  },
  "6-23": {
    "verse": "",
    "text": ""
  },
  "6-24": {
    "verse": "",
    "text": ""
  },
  "6-25": {
    "verse": "",
    "text": ""
  },
  "6-26": {
    "verse": "",
    "text": ""
  },
  "6-27": {
    "verse": "",
    "text": ""
  },
  "6-28": {
    "verse": "",
    "text": ""
  },
  "6-29": {
    "verse": "",
    "text": ""
  },
  "6-30": {
    "verse": "",
    "text": ""
  },
  "7-1": {
    "verse": "",
    "text": ""
  },
  "7-2": {
    "verse": "",
    "text": ""
  },
  "7-3": {
    "verse": "",
    "text": ""
  },
  "7-4": {
    "verse": "",
    "text": ""
  },
  "7-5": {
    "verse": "",
    "text": ""
  },
  "7-6": {
    "verse": "",
    "text": ""
  },
  "7-7": {
    "verse": "",
    "text": ""
  },
  "7-8": {
    "verse": "",
    "text": ""
  },
  "7-9": {
    "verse": "",
    "text": ""
  },
  "7-10": {
    "verse": "",
    "text": ""
  },
  "7-11": {
    "verse": "",
    "text": ""
  },
  "7-12": {
    "verse": "",
    "text": ""
  },
  "7-13": {
    "verse": "",
    "text": ""
  },
  "7-14": {
    "verse": "",
    "text": ""
  },
  "7-15": {
    "verse": "",
    "text": ""
  },
  "7-16": {
    "verse": "",
    "text": ""
  },
  "7-17": {
    "verse": "",
    "text": ""
  },
  "7-18": {
    "verse": "",
    "text": ""
  },
  "7-19": {
    "verse": "",
    "text": ""
  },
  "7-20": {
    "verse": "",
    "text": ""
  },
  "7-21": {
    "verse": "",
    "text": ""
  },
  "7-22": {
    "verse": "",
    "text": ""
  },
  "7-23": {
    "verse": "",
    "text": ""
  },
  "7-24": {
    "verse": "",
    "text": ""
  },
  "7-25": {
    "verse": "",
    "text": ""
  },
  "7-26": {
    "verse": "",
    "text": ""
  },
  "7-27": {
    "verse": "",
    "text": ""
  },
  "7-28": {
    "verse": "",
    "text": ""
  },
  "7-29": {
    "verse": "",
    "text": ""
  },
  "7-30": {
    "verse": "",
    "text": ""
  },
  "7-31": {
    "verse": "",
    "text": ""
  },
  "8-1": {
    "verse": "",
    "text": ""
  },
  "8-2": {
    "verse": "",
    "text": ""
  },
  "8-3": {
    "verse": "",
    "text": ""
  },
  "8-4": {
    "verse": "",
    "text": ""
  },
  "8-5": {
    "verse": "",
    "text": ""
  },
  "8-6": {
    "verse": "",
    "text": ""
  },
  "8-7": {
    "verse": "",
    "text": ""
  },
  "8-8": {
    "verse": "",
    "text": ""
  },
  "8-9": {
    "verse": "",
    "text": ""
  },
  "8-10": {
    "verse": "",
    "text": ""
  },
  "8-11": {
    "verse": "",
    "text": ""
  },
  "8-12": {
    "verse": "",
    "text": ""
  },
  "8-13": {
    "verse": "",
    "text": ""
  },
  "8-14": {
    "verse": "",
    "text": ""
  },
  "8-15": {
    "verse": "",
    "text": ""
  },
  "8-16": {
    "verse": "",
    "text": ""
  },
  "8-17": {
    "verse": "",
    "text": ""
  },
  "8-18": {
    "verse": "",
    "text": ""
  },
  "8-19": {
    "verse": "",
    "text": ""
  },
  "8-20": {
    "verse": "",
    "text": ""
  },
  "8-21": {
    "verse": "",
    "text": ""
  },
  "8-22": {
    "verse": "",
    "text": ""
  },
  "8-23": {
    "verse": "",
    "text": ""
  },
  "8-24": {
    "verse": "",
    "text": ""
  },
  "8-25": {
    "verse": "",
    "text": ""
  },
  "8-26": {
    "verse": "",
    "text": ""
  },
  "8-27": {
    "verse": "",
    "text": ""
  },
  "8-28": {
    "verse": "",
    "text": ""
  },
  "8-29": {
    "verse": "",
    "text": ""
  },
  "8-30": {
    "verse": "",
    "text": ""
  },
  "8-31": {
    "verse": "",
    "text": ""
  },
  "9-1": {
    "verse": "",
    "text": ""
  },
  "9-2": {
    "verse": "",
    "text": ""
  },
  "9-3": {
    "verse": "",
    "text": ""
  },
  "9-4": {
    "verse": "",
    "text": ""
  },
  "9-5": {
    "verse": "",
    "text": ""
  },
  "9-6": {
    "verse": "",
    "text": ""
  },
  "9-7": {
    "verse": "",
    "text": ""
  },
  "9-8": {
    "verse": "",
    "text": ""
  },
  "9-9": {
    "verse": "",
    "text": ""
  },
  "9-10": {
    "verse": "",
    "text": ""
  },
  "9-11": {
    "verse": "",
    "text": ""
  },
  "9-12": {
    "verse": "",
    "text": ""
  },
  "9-13": {
    "verse": "",
    "text": ""
  },
  "9-14": {
    "verse": "",
    "text": ""
  },
  "9-15": {
    "verse": "",
    "text": ""
  },
  "9-16": {
    "verse": "",
    "text": ""
  },
  "9-17": {
    "verse": "",
    "text": ""
  },
  "9-18": {
    "verse": "",
    "text": ""
  },
  "9-19": {
    "verse": "",
    "text": ""
  },
  "9-20": {
    "verse": "",
    "text": ""
  },
  "9-21": {
    "verse": "",
    "text": ""
  },
  "9-22": {
    "verse": "",
    "text": ""
  },
  "9-23": {
    "verse": "",
    "text": ""
  },
  "9-24": {
    "verse": "",
    "text": ""
  },
  "9-25": {
    "verse": "",
    "text": ""
  },
  "9-26": {
    "verse": "",
    "text": ""
  },
  "9-27": {
    "verse": "",
    "text": ""
  },
  "9-28": {
    "verse": "",
    "text": ""
  },
  "9-29": {
    "verse": "",
    "text": ""
  },
  "9-30": {
    "verse": "",
    "text": ""
  },
  "10-1": {
    "verse": "",
    "text": ""
  },
  "10-2": {
    "verse": "",
    "text": ""
  },
  "10-3": {
    "verse": "",
    "text": ""
  },
  "10-4": {
    "verse": "",
    "text": ""
  },
  "10-5": {
    "verse": "",
    "text": ""
  },
  "10-6": {
    "verse": "",
    "text": ""
  },
  "10-7": {
    "verse": "",
    "text": ""
  },
  "10-8": {
    "verse": "",
    "text": ""
  },
  "10-9": {
    "verse": "",
    "text": ""
  },
  "10-10": {
    "verse": "",
    "text": ""
  },
  "10-11": {
    "verse": "",
    "text": ""
  },
  "10-12": {
    "verse": "",
    "text": ""
  },
  "10-13": {
    "verse": "",
    "text": ""
  },
  "10-14": {
    "verse": "",
    "text": ""
  },
  "10-15": {
    "verse": "",
    "text": ""
  },
  "10-16": {
    "verse": "",
    "text": ""
  },
  "10-17": {
    "verse": "",
    "text": ""
  },
  "10-18": {
    "verse": "",
    "text": ""
  },
  "10-19": {
    "verse": "",
    "text": ""
  },
  "10-20": {
    "verse": "",
    "text": ""
  },
  "10-21": {
    "verse": "",
    "text": ""
  },
  "10-22": {
    "verse": "",
    "text": ""
  },
  "10-23": {
    "verse": "",
    "text": ""
  },
  "10-24": {
    "verse": "",
    "text": ""
  },
  "10-25": {
    "verse": "",
    "text": ""
  },
  "10-26": {
    "verse": "",
    "text": ""
  },
  "10-27": {
    "verse": "",
    "text": ""
  },
  "10-28": {
    "verse": "",
    "text": ""
  },
  "10-29": {
    "verse": "",
    "text": ""
  },
  "10-30": {
    "verse": "",
    "text": ""
  },
  "10-31": {
    "verse": "",
    "text": ""
  },
  "11-1": {
    "verse": "",
    "text": ""
  },
  "11-2": {
    "verse": "",
    "text": ""
  },
  "11-3": {
    "verse": "",
    "text": ""
  },
  "11-4": {
    "verse": "",
    "text": ""
  },
  "11-5": {
    "verse": "",
    "text": ""
  },
  "11-6": {
    "verse": "",
    "text": ""
  },
  "11-7": {
    "verse": "",
    "text": ""
  },
  "11-8": {
    "verse": "",
    "text": ""
  },
  "11-9": {
    "verse": "",
    "text": ""
  },
  "11-10": {
    "verse": "",
    "text": ""
  },
  "11-11": {
    "verse": "",
    "text": ""
  },
  "11-12": {
    "verse": "",
    "text": ""
  },
  "11-13": {
    "verse": "",
    "text": ""
  },
  "11-14": {
    "verse": "",
    "text": ""
  },
  "11-15": {
    "verse": "",
    "text": ""
  },
  "11-16": {
    "verse": "",
    "text": ""
  },
  "11-17": {
    "verse": "",
    "text": ""
  },
  "11-18": {
    "verse": "",
    "text": ""
  },
  "11-19": {
    "verse": "",
    "text": ""
  },
  "11-20": {
    "verse": "",
    "text": ""
  },
  "11-21": {
    "verse": "",
    "text": ""
  },
  "11-22": {
    "verse": "",
    "text": ""
  },
  "11-23": {
    "verse": "",
    "text": ""
  },
  "11-24": {
    "verse": "",
    "text": ""
  },
  "11-25": {
    "verse": "",
    "text": ""
  },
  "11-26": {
    "verse": "",
    "text": ""
  },
  "11-27": {
    "verse": "",
    "text": ""
  },
  "11-28": {
    "verse": "",
    "text": ""
  },
  "11-29": {
    "verse": "",
    "text": ""
  },
  "11-30": {
    "verse": "",
    "text": ""
  },
  "12-1": {
    "verse": "",
    "text": ""
  },
  "12-2": {
    "verse": "",
    "text": ""
  },
  "12-3": {
    "verse": "",
    "text": ""
  },
  "12-4": {
    "verse": "",
    "text": ""
  },
  "12-5": {
    "verse": "",
    "text": ""
  },
  "12-6": {
    "verse": "",
    "text": ""
  },
  "12-7": {
    "verse": "",
    "text": ""
  },
  "12-8": {
    "verse": "",
    "text": ""
  },
  "12-9": {
    "verse": "",
    "text": ""
  },
  "12-10": {
    "verse": "",
    "text": ""
  },
  "12-11": {
    "verse": "",
    "text": ""
  },
  "12-12": {
    "verse": "",
    "text": ""
  },
  "12-13": {
    "verse": "",
    "text": ""
  },
  "12-14": {
    "verse": "",
    "text": ""
  },
  "12-15": {
    "verse": "",
    "text": ""
  },
  "12-16": {
    "verse": "",
    "text": ""
  },
  "12-17": {
    "verse": "",
    "text": ""
  },
  "12-18": {
    "verse": "",
    "text": ""
  },
  "12-19": {
    "verse": "",
    "text": ""
  },
  "12-20": {
    "verse": "",
    "text": ""
  },
  "12-21": {
    "verse": "",
    "text": ""
  },
  "12-22": {
    "verse": "",
    "text": ""
  },
  "12-23": {
    "verse": "",
    "text": ""
  },
  "12-24": {
    "verse": "",
    "text": ""
  },
  "12-25": {
    "verse": "",
    "text": ""
  },
  "12-26": {
    "verse": "",
    "text": ""
  },
  "12-27": {
    "verse": "",
    "text": ""
  },
  "12-28": {
    "verse": "",
    "text": ""
  },
  "12-29": {
    "verse": "",
    "text": ""
  },
  "12-30": {
    "verse": "",
    "text": ""
  },
  "12-31": {
    "verse": "",
    "text": ""
  }
}