{
  "1-1": {
    "verse": "\"Behold, I am doing a new thing; now it springs forth, do you not perceive it?\" (Isaiah 43:19)",
    "text": "The beginning of a new year symbolizes fresh starts, yet often we carry the weight of old struggles into new seasons. Today, God promises you that He is actively at work, creating new possibilities and fresh beginnings in your life. Leave behind past regrets and embrace this day as an opportunity to step into the fullness of what He is doing within and around you. Trust in His ability to bring renewal, healing, and hope into your journey of recovery.\\n\\nLamentations 3:22-23 * Ezekiel 36:26 * Revelation 21:5"
  },
  "1-2": {
    "verse": "\"Cast your burden on the LORD, and he will sustain you.\" (Psalm 55:22)",
    "text": "Carrying the heavy burdens of past mistakes, fears, and uncertainties can exhaust you, hindering your progress in recovery. Today, God gently invites you to lay these burdens down, trusting Him to sustain and strengthen you. Your worries are not meant for you alone to bear—release them into God's capable hands. Allow Him to carry the weight so you can move forward, lighter, freer, and confident in His faithful care for you.\\n\\n1 Peter 5:7 * Matthew 11:28-30 * Psalm 68:19"
  },
  "1-3": {
    "verse": "\"For God gave us a spirit not of fear but of power and love and self-control.\" (2 Timothy 1:7)",
    "text": "Fear often attempts to hold you back from fully embracing recovery and the abundant life God desires for you. But today, remember this powerful truth: God has equipped you with courage, strength, love, and self-control. You are not defined by fear or uncertainty; rather, you are empowered by His Spirit to walk boldly into healing. Claim this identity today, letting God's love and strength overpower fear, guiding each courageous step forward.\\n\\nRomans 8:15 * Joshua 1:9 * Isaiah 41:10"
  },
  "1-4": {
    "verse": "\"He who began a good work in you will bring it to completion.\" (Philippians 1:6)",
    "text": "At times in recovery, progress feels slow, uneven, or frustratingly incomplete. God reminds you today that He always finishes what He starts. He sees your entire journey—from struggle to triumph—and His commitment to your healing and restoration is unwavering. Trust that even when you can't see immediate results, He is faithfully at work, bringing about transformation in His perfect timing. Today, rest confidently in His promise to complete the good work He's begun within you.\\n\\nHebrews 10:23 * 1 Thessalonians 5:24 * Psalm 138:8"
  },
  "1-5": {
    "verse": "\"I sought the LORD, and he answered me and delivered me from all my fears.\" (Psalm 34:4)",
    "text": "When anxiety threatens your peace in recovery, it's easy to feel alone and overwhelmed. Today, God assures you that every prayer whispered, every plea uttered, is heard and valued by Him. Turn to Him openly, share your deepest fears and worries, and trust that He will respond with peace, assurance, and deliverance. Allow His comforting presence to ease your fears, reassuring you that He is always near and responsive to your needs.\\n\\nJeremiah 29:13 * Psalm 91:15 * Psalm 145:18"
  },
  "1-6": {
    "verse": "\"But this I call to mind, and therefore I have hope: The steadfast love of the LORD never ceases.\" (Lamentations 3:21-22)",
    "text": "When past mistakes and setbacks overwhelm you, hope can seem distant. Yet God invites you today to remember His steadfast love, a love that never wavers despite your struggles. His compassion renews daily, providing a foundation of hope even in difficult moments. Today, choose to fix your thoughts on His unwavering faithfulness, letting this truth fill your heart with renewed hope and confidence to face whatever challenges lie ahead.\\n\\nHebrews 6:19 * Romans 15:13 * Psalm 33:22"
  },
  "1-7": {
    "verse": "\"God is our refuge and strength, a very present help in trouble.\" (Psalm 46:1)",
    "text": "Recovery often includes facing difficult circumstances that seem beyond your control. God promises that in those very moments, He is your safe haven and dependable source of strength. Today, instead of trying to face struggles alone, actively seek His presence and shelter. Trust His unwavering strength, leaning confidently into Him during every storm. Experience the reassurance that comes from knowing He is always near, ready to provide help exactly when you need it most.\\n\\nPsalm 91:2 * Nahum 1:7 * Isaiah 25:4"
  },
  "1-8": {
    "verse": "\"You are my hiding place; you will protect me from trouble and surround me with songs of deliverance.\" (Psalm 32:7)",
    "text": "The journey of recovery can sometimes make you feel vulnerable and exposed, overwhelmed by life's challenges. Today, God reassures you that He is your safe refuge, offering shelter and protection in every trial. Let Him be your hiding place, the secure haven you turn to whenever fear or temptation threaten your progress. Feel His protective presence surrounding you like a shield, filling your heart with confidence and joy, knowing you are safe within His care.\\n\\nPsalm 119:114 * Proverbs 18:10 * Zephaniah 3:17"
  },
  "1-9": {
    "verse": "\"And after you have suffered a little while, the God of all grace...will himself restore, confirm, strengthen, and establish you.\" (1 Peter 5:10)",
    "text": "Trials in recovery can feel endless, yet God's promise is that your suffering is temporary and purposeful. Every difficulty you face today is leading you toward greater strength, deeper wisdom, and a more solid foundation in Him. Trust that He personally oversees your healing and restoration, carefully working to strengthen and establish your life. Allow this promise to comfort your heart, trusting that the One who walks with you will faithfully bring you through every hardship.\\n\\nJames 1:2-4 * Romans 5:3-5 * 2 Corinthians 4:17"
  },
  "1-10": {
    "verse": "\"Fear not, for I have redeemed you; I have called you by name, you are mine.\" (Isaiah 43:1)",
    "text": "Recovery can sometimes cause feelings of worthlessness or shame. Yet God speaks directly to you, reminding you today that you are deeply valued, personally chosen, and fully redeemed. Your identity is not defined by past mistakes but by the love and grace of the One who calls you by name. Today, reject feelings of shame or unworthiness, embracing instead the truth that you belong wholly and securely to God, whose love never fails.\\n\\n1 John 3:1 * Romans 8:1 * Ephesians 1:7"
  },
  "1-11": {
    "verse": "\"The LORD your God goes with you; he will never leave you nor forsake you.\" (Deuteronomy 31:6)",
    "text": "Recovery can sometimes be a lonely journey, leaving you feeling isolated or abandoned. Today, remember God's unwavering promise: He will never leave you or turn His back on you. In every moment, both good and bad, His presence remains constant and comforting. Take heart in knowing you're never truly alone. Walk confidently today, fully assured that the One who stands beside you offers endless strength, guidance, and encouragement along your path.\\n\\nMatthew 28:20 * Joshua 1:5 * Hebrews 13:5-6"
  },
  "1-12": {
    "verse": "\"Seek the LORD and his strength; seek his presence continually!\" (1 Chronicles 16:11)",
    "text": "Recovery requires sustained strength, often more than you feel you possess. Today, God invites you to continually seek His presence and strength, knowing that your own efforts will inevitably run short. Make it a priority to connect with Him frequently through prayer, reflection, and quiet moments. Allow His strength to continually renew your energy and perspective, giving you endurance, hope, and clarity as you move forward.\\n\\nPsalm 105:4 * Isaiah 40:29-31 * Psalm 27:8"
  },
  "1-13": {
    "verse": "\"My flesh and my heart may fail, but God is the strength of my heart and my portion forever.\" (Psalm 73:26)",
    "text": "In recovery, moments of discouragement and weariness are inevitable. Yet even in your weakest moments, God remains steadfastly strong. Today, rather than relying solely on your own strength, lean fully into God, who promises to sustain and uphold you through every challenge. Trust that He is enough—not just today, but every day—providing exactly what you need when you need it most.\\n\\nIsaiah 40:28-31 * Philippians 4:13 * 2 Corinthians 12:9-10"
  },
  "1-14": {
    "verse": "\"Draw near to God, and he will draw near to you.\" (James 4:8)",
    "text": "At times, recovery may feel distant or disconnected from God's presence. But God promises to meet you exactly where you are, longing to draw close whenever you seek Him. Today, intentionally pursue a deeper connection with God through honest prayer, quiet reflection, and openness of heart. Experience His closeness, allowing His peace and comfort to reassure you of His constant, loving presence on your journey.\\n\\nHebrews 10:22 * Psalm 145:18 * Jeremiah 29:13"
  },
  "1-15": {
    "verse": "\"He gives power to the faint, and to him who has no might he increases strength.\" (Isaiah 40:29)",
    "text": "There are days when recovery feels exhausting, and your strength seems completely depleted. Remember today that God specializes in empowering those who feel faint, weary, or unable to continue. You don't have to rely solely on your own strength; instead, draw upon His limitless power. Trust Him to renew your energy, uplift your spirit, and sustain you even when you feel you have nothing left to give. Rest assured, His strength will carry you forward.\\n\\nPsalm 29:11 * Philippians 4:13 * Isaiah 41:10"
  },
  "1-16": {
    "verse": "\"Let the peace of Christ rule in your hearts, since as members of one body you were called to peace.\" (Colossians 3:15)",
    "text": "Recovery brings moments when inner peace feels elusive. Today, God gently reminds you to allow Christ's peace—not anxiety, fear, or uncertainty—to rule your heart and guide your thoughts. As you choose daily to surrender control to God, His peace becomes the dominant force within you, calming storms and providing clarity in confusion. Embrace this peace today, allowing it to restore your spirit and guide you forward with confidence and tranquility.\\n\\nJohn 14:27 * Philippians 4:6-7 * Romans 14:19"
  },
  "1-17": {
    "verse": "\"I will not leave you as orphans; I will come to you.\" (John 14:18)",
    "text": "In moments when you feel abandoned or forgotten in your recovery, remember this powerful promise from God: you are never alone. He personally reaches out, committed to comforting and guiding you at every turn. His presence transforms loneliness into companionship and sorrow into comfort. Today, trust His promise fully, finding reassurance that the One who loves you deeply remains by your side every step of your journey.\\n\\nPsalm 27:10 * Hebrews 13:5 * Isaiah 49:15-16"
  },
  "1-18": {
    "verse": "\"Be strong and courageous. Do not be frightened, and do not be dismayed, for the LORD your God is with you wherever you go.\" (Joshua 1:9)",
    "text": "Courage is essential in recovery, especially when facing the unknown or confronting difficult truths. God encourages you today not to fear, reminding you that He walks closely beside you in every situation. With His strength bolstering your heart, you can confidently step forward into healing and growth. Today, choose courage over fear, anchored by the certainty that you never walk this journey alone.\\n\\nDeuteronomy 31:6 * Psalm 31:24 * 1 Corinthians 16:13"
  },
  "1-19": {
    "verse": "\"The LORD is close to all who call on him, to all who call on him in truth.\" (Psalm 145:18)",
    "text": "Feeling disconnected or distant from God can intensify feelings of isolation in recovery. Yet God is always near, patiently awaiting your honest call. Today, openly share your heart, struggles, and needs with Him, trusting He hears every sincere word. His closeness offers comfort, strength, and reassurance. Lean into His attentive presence, knowing that your honesty and openness will always draw Him close to you.\\n\\nJeremiah 29:12-13 * Psalm 34:17-18 * James 4:8"
  },
  "1-20": {
    "verse": "\"For nothing will be impossible with God.\" (Luke 1:37)",
    "text": "Recovery sometimes involves facing challenges that feel overwhelming or impossible. But God reassures you today that nothing lies beyond His ability. Whatever difficulty you face, no matter how daunting, God is greater. Hold onto this promise as you confront obstacles, trusting that His strength and wisdom will help you overcome every barrier. Today, move forward confidently, knowing that with God, even the impossible becomes achievable.\\n\\nMark 10:27 * Jeremiah 32:27 * Matthew 19:26"
  },
  "1-21": {
    "verse": "\"Therefore, if anyone is in Christ, he is a new creation.\" (2 Corinthians 5:17)",
    "text": "Past mistakes or regrets can trap you in an identity you no longer claim. Today, remember that your true identity is found in Christ. You are not defined by your past but by the new creation God has declared you to be. Embrace this transformative truth today, allowing God to continually renew your mind, heart, and life. Let the old fall away, stepping confidently into the vibrant, hopeful future He has prepared for you.\\n\\nEzekiel 36:26 * Romans 6:4 * Ephesians 4:22-24"
  },
  "1-22": {
    "verse": "\"My presence will go with you, and I will give you rest.\" (Exodus 33:14)",
    "text": "Recovery can feel exhausting, but today God promises restful reassurance through His constant presence. You do not journey alone; He walks closely beside you, bringing peace, comfort, and restorative rest. Whenever you feel overwhelmed, pause and intentionally become aware of His presence. Allow His restful embrace to renew your strength, refresh your spirit, and give you the peace needed to continue your journey forward.\\n\\nPsalm 23:1-3 * Matthew 11:28-29 * Hebrews 4:9-10"
  },
  "1-23": {
    "verse": "\"When anxiety was great within me, your consolation brought me joy.\" (Psalm 94:19)",
    "text": "Anxiety can steal your joy, cloud your vision, and make recovery feel harder than necessary. But today, God promises joyful comfort even in moments of deep anxiety. Turn to Him in prayer, laying each worry at His feet, allowing His consolation to restore your joy and refresh your spirit. Let this divine comfort assure you that you're deeply understood, greatly cared for, and always supported in every struggle.\\n\\nPhilippians 4:6-7 * Matthew 6:25-34 * Isaiah 41:13"
  },
  "1-24": {
    "verse": "\"Taste and see that the LORD is good; blessed is the one who takes refuge in him.\" (Psalm 34:8)",
    "text": "Recovery is not merely about enduring struggles but experiencing God's goodness firsthand. Today, God invites you into a deeper experience of His kindness, grace, and provision. Seek opportunities to notice His presence in your life, savoring His blessings, however small or great. Trusting Him fully as your refuge and strength will transform challenges into moments of profound gratitude and genuine joy.\\n\\nPsalm 31:19 * Nahum 1:7 * 1 Peter 2:2-3"
  },
  "1-25": {
    "verse": "\"Blessed are those who hunger and thirst for righteousness, for they shall be satisfied.\" (Matthew 5:6)",
    "text": "Recovery is a hunger of the soul—a longing not just for relief from pain, but for something deeper, purer, and lasting. Today, God honors that hunger. He sees your desire to live differently, to walk in righteousness, and to pursue truth. And He promises that your hunger will not go unmet. As you seek Him with sincerity, He will fill the empty spaces, quench the thirst in your spirit, and nourish you with what the world could never offer. Let your desire for God today be your compass, leading you toward satisfaction that only He can provide.\\n\\nPsalm 42:1-2 * Isaiah 55:1-3 * John 6:35"
  },
  "1-26": {
    "verse": "\"Even though I walk through the valley of the shadow of death, I will fear no evil, for you are with me.\" (Psalm 23:4)",
    "text": "There are valleys in this journey—moments that feel dark, uncertain, or frightening. But God never promises to keep us from every valley. Instead, He promises to walk through them with us. His presence is constant, even when fear whispers lies and shadows loom. Today, remember you are never alone in your struggle. The Shepherd walks beside you, guiding your steps, comforting your heart, and bringing light to the darkest places. Take courage, knowing the One who walks with you has already overcome.\\n\\nIsaiah 43:2 * John 16:33 * Romans 8:38-39"
  },
  "1-27": {
    "verse": "\"Create in me a clean heart, O God, and renew a right spirit within me.\" (Psalm 51:10)",
    "text": "There's beauty in asking God to begin again within you. In recovery, it's easy to carry the weight of guilt or to feel like your heart is too stained to be cleansed. But God doesn't just forgive—He renews. He purifies. He restores your spirit. Today, ask Him boldly to make your heart new. Trust that He delights in restoration, not punishment. Let Him wash away the residue of the past and breathe new life into your spirit, one surrendered moment at a time.\\n\\nEzekiel 36:25-27 * Titus 3:5 * 1 John 1:9"
  },
  "1-28": {
    "verse": "\"Those who sow in tears shall reap with shouts of joy.\" (Psalm 126:5)",
    "text": "Some days in recovery feel like sowing seeds with trembling hands and tear-streaked cheeks. Progress is hard-won, and hope can feel distant. But God sees your quiet perseverance. Every tear you've cried, every small step you've taken, is planting a harvest of joy. The pain you feel today is not the end of your story—it's part of the process of renewal. Keep sowing, Brother. Keep trusting. The joy that is coming will be beyond what you can imagine.\\n\\nGalatians 6:9 * Isaiah 61:3 * John 16:20"
  },
  "1-29": {
    "verse": "\"Trust in him at all times, O people; pour out your heart before him; God is a refuge for us.\" (Psalm 62:8)",
    "text": "You don't have to have all the answers. You don't have to pretend to be strong. God invites you to come honestly, as you are, and pour out your heart before Him. There is no fear in His presence, only refuge. Today, make time to lay everything down—your doubts, fears, hopes, and needs. He already knows, and He deeply cares. His refuge is not earned; it's given freely. Rest in the safety of His arms and let Him carry the burdens you've been holding alone.\\n\\nLamentations 2:19 * Philippians 4:6 * 1 Peter 5:7"
  },
  "1-30": {
    "verse": "\"You will keep in perfect peace those whose minds are steadfast, because they trust in you.\" (Isaiah 26:3)",
    "text": "Peace is not found in the absence of problems but in the presence of God. In recovery, your mind may be filled with noise—regrets from the past, fears for the future, and the temptation to give up. But peace begins where trust begins. Today, fix your thoughts on the One who never fails. Anchor your mind in His truth and His promises. The storms may not stop, but His peace can reign within you in spite of them. That is the gift of perfect peace.\\n\\nJohn 14:27 * Colossians 3:15 * Psalm 119:165"
  },
  "1-31": {
    "verse": "\"For the Spirit God gave us does not make us timid, but gives us power, love and self-discipline.\" (2 Timothy 1:7)",
    "text": "God did not create you to shrink back. He formed you with purpose and placed within you the Spirit of power. In recovery, there will be days when fear tries to silence you or shame tries to steal your identity. But today, rise up in truth. You are not who you once were. God is giving you strength for the battle, love to overcome bitterness, and discipline to stay the course. Don't be afraid to walk boldly—He is with you, and His Spirit is alive within you.\\n\\nRomans 8:15 * Ephesians 3:16 * Joshua 1:7"
  },
  "2-1": {
    "verse": "“Trust in the Lord with all your heart, and do not lean on your own understanding.” (Proverbs 3:5)",
    "text": "Recovery often feels like stepping into uncertainty, and you may be tempted to rely on your own logic or past experiences. Yet God calls you to entrust Him fully—He sees beyond what you understand. Today, practice releasing your anxieties to Him, believing His perspective and timing surpass yours. As you lean into His wisdom, you'll discover clarity and peace in decisions that once felt impossible.\\n\\nIsaiah 26:3 * Jeremiah 17:7 * Psalm 37:5"
  },
  "2-2": {
    "verse": "“Come to me, all who labor and are heavy laden, and I will give you rest.” (Matthew 11:28)",
    "text": "Recovery can leave you exhausted in body and spirit, weighed down by shame or pressure. Jesus doesn't demand you carry that burden alone—He offers genuine rest for your soul. Today, pause long enough to lay your cares at His feet, inviting His gentle peace to renew you. In His rest, you'll find the strength to face each challenge with fresh hope.\\n\\nPsalm 55:22 * Hebrews 4:16 * Isaiah 40:29–31"
  },
  "2-3": {
    "verse": "“I can do all things through him who strengthens me.” (Philippians 4:13)",
    "text": "Some days in recovery feel like insurmountable mountains when your own strength runs dry. Yet this promise isn't about your willpower—it's about Christ's power in you. Today, face a specific challenge—anxiety, temptation, or a difficult conversation—and declare this verse aloud. Let His empowering presence carry you through, turning obstacles into opportunities for spiritual growth.\\n\\nIsaiah 40:29 * 2 Corinthians 12:9–10 * Ephesians 6:10"
  },
  "2-4": {
    "verse": "“He heals the brokenhearted and binds up their wounds.” (Psalm 147:3)",
    "text": "Past hurts and regrets don't have to define your future. God specializes in healing wounds that seem impossible to mend. As you face your recovery journey, let Him tend to your broken heart. Trust His promise to restore what seems lost—His care is thorough and lasting.\\n\\nJeremiah 30:17 * Isaiah 61:1 * Psalm 34:18"
  },
  "2-5": {
    "verse": "“Fear not, for I am with you; be not dismayed, for I am your God.” (Isaiah 41:10)",
    "text": "Fear can paralyze you in difficult seasons of recovery. But God calls you to courage, promising His unwavering presence. Whenever you feel overwhelmed, pause and remember that God is always near. By focusing on His steadfastness, fear loses its grip.\\n\\nDeuteronomy 31:6 * Joshua 1:9 * Psalm 56:3"
  },
  "2-6": {
    "verse": "“Therefore, if anyone is in Christ, he is a new creation. The old has passed away; behold, the new has come.” (2 Corinthians 5:17)",
    "text": "Recovery isn't just about leaving the past behind—it's about embracing the new identity God offers. Each day brings fresh mercy and new opportunities to grow spiritually, emotionally, and mentally. As you move forward, remind yourself that you are a cherished creation, constantly renewed by His grace.\\n\\nRomans 6:4 * Ezekiel 36:26 * Revelation 21:5"
  },
  "2-7": {
    "verse": "“Cast all your anxiety on him because he cares for you.” (1 Peter 5:7)",
    "text": "Anxiety can consume your thoughts, draining you of peace. Yet God offers Himself as the bearer of your burdens, lovingly inviting you to cast your worries upon Him. When you feel anxiety rising, take a moment to surrender those feelings to God. This small act of trust replaces anxiety with His peace.\\n\\nPhilippians 4:6–7 * Matthew 6:34 * Psalm 55:22"
  },
  "2-8": {
    "verse": "“The LORD is near to the brokenhearted and saves the crushed in spirit.” (Psalm 34:18)",
    "text": "There's a kind of pain in recovery that words can't always express—a heaviness in the soul, a crushing in the spirit. But it's in those exact moments that God draws nearest. He doesn't wait for you to get it all together before showing up. Today, let Him near. You don't have to be whole to be held.\\n\\nIsaiah 57:15 * Matthew 5:4 * 2 Corinthians 1:3–4"
  },
  "2-9": {
    "verse": "“Let your eyes look directly forward, and your gaze be straight before you.” (Proverbs 4:25)",
    "text": "There are things behind you that try to call your name—mistakes, regrets, old habits. But you are no longer defined by what's behind you. Today, God calls you to fix your gaze forward—to the healing, purpose, and life He is unfolding right now. Lift your head and step into the grace He's prepared.\\n\\nPhilippians 3:13–14 * Isaiah 43:18–19 * Luke 9:62"
  },
  "2-10": {
    "verse": "“He will cover you with his feathers, and under his wings you will find refuge.” (Psalm 91:4)",
    "text": "There's a safety that only God can provide—a shelter not made of walls, but of presence. In the storms of recovery, when the winds howl and temptations whisper, He gathers you beneath His wings. You are protected by a love that shields and strengthens. Today, run to Him and let His peace be your refuge.\\n\\nRuth 2:12 * Isaiah 32:2 * Psalm 17:8"
  },
  "2-11": {
    "verse": "“And let us not grow weary of doing good, for in due season we will reap, if we do not give up.” (Galatians 6:9)",
    "text": "Some days feel long and unrewarding—especially when you're doing the hard work of rebuilding. It's tempting to wonder if any of it really matters. But God promises that the seeds you plant today will bear fruit in time. Don't give up. The harvest is coming, and it's going to be beautiful.\\n\\n1 Corinthians 15:58 * Hebrews 12:3 * James 1:12"
  },
  "2-12": {
    "verse": "“You will seek me and find me, when you seek me with all your heart.” (Jeremiah 29:13)",
    "text": "Sometimes it feels like God is far off, especially when the journey gets heavy. But He's not hiding—He's inviting. He promises that when you seek Him earnestly, you will find Him. Not just His help, but His presence. Today, seek Him with your whole heart and discover just how close He really is.\\n\\nPsalm 63:1 * Matthew 7:7–8 * Deuteronomy 4:29"
  },
  "2-13": {
    "verse": "“The LORD is my shepherd; I shall not want.” (Psalm 23:1)",
    "text": "In recovery, you may feel like something's always missing—peace, purpose, provision. But with God as your Shepherd, you lack nothing that truly matters. He knows exactly what you need and leads you there. Today, trust His care over your life, and rest in His provision.\\n\\nJohn 10:11 * Philippians 4:19 * Isaiah 40:11"
  },
  "2-14": {
    "verse": "“We love because he first loved us.” (1 John 4:19)",
    "text": "Valentine's Day often brings mixed emotions—joy, loneliness, longing. But today, remember the truest, deepest love you will ever know: God's love. It came first. It comes still. Let His love be the foundation of your healing and the model for every relationship you have.\\n\\nRomans 5:8 * Ephesians 3:17–19 * John 15:12"
  },
  "2-15": {
    "verse": "“Be still before the LORD and wait patiently for him.” (Psalm 37:7)",
    "text": "Recovery can stir restlessness—the desire for quick fixes and rapid change. But healing takes time. God's rhythm isn't rushed, and His work in you is deep, not shallow. Today, resist the urge to sprint. Instead, pause, be still, and trust that while you wait, He is moving.\\n\\nIsaiah 40:31 * Exodus 14:14 * Lamentations 3:25–26"
  },
  "2-16": {
    "verse": "“The LORD is my light and my salvation—whom shall I fear?” (Psalm 27:1)",
    "text": "Fear creeps in easily—fear of failure, rejection, the unknown. But when God is your light, He dispels every darkness, and as your salvation, He delivers you from every threat. Today, speak this promise aloud and let it silence every fear. You have nothing to prove, because you are already held by Him.\\n\\nIsaiah 41:10 * John 8:12 * Romans 8:31"
  },
  "2-17": {
    "verse": "“Teach me to do your will, for you are my God! Let your good Spirit lead me on level ground!” (Psalm 143:10)",
    "text": "Recovery isn't just about turning away from something—it's about learning a new way to live. That requires guidance, humility, and a willingness to be taught. Invite God today to lead you—not only to rescue you but to reshape you. Ask Him to place your feet on steady ground and to guide you by His Spirit.\\n\\nPsalm 25:4–5 * Proverbs 3:5–6 * John 14:26"
  },
  "2-18": {
    "verse": "“Let everything that has breath praise the LORD!” (Psalm 150:6)",
    "text": "Even in recovery—perhaps especially in recovery—there's reason to praise. Not because everything is perfect, but because God is present. Every breath you take is a gift. Today, lift your voice in worship—sing, journal, or simply speak thanksgiving. Worship isn't reserved for mountaintops; it's born in valleys.\\n\\nHebrews 13:15 * Psalm 34:1 * Habakkuk 3:17–19"
  },
  "2-19": {
    "verse": "“For you formed my inward parts; you knitted me together in my mother's womb.” (Psalm 139:13)",
    "text": "You are not an accident. You are not beyond repair. Long before addiction or trauma, God saw you and wove a purpose into your life. Today, remember that your value is not defined by your past but by who made you. Let that truth uproot lies about your worth.\\n\\nJeremiah 1:5 * Ephesians 2:10 * Isaiah 64:8"
  },
  "2-20": {
    "verse": "“Do not grieve, for the joy of the LORD is your strength.” (Nehemiah 8:10)",
    "text": "Some days in recovery are heavy—marked by sorrow or exhaustion. But even in grief, joy can live. Not a fake optimism, but a deep wellspring from knowing God is with you and for you. Today, draw strength from the joy of the Lord, and let it carry you farther than you ever imagined.\\n\\nPsalm 30:5 * John 16:22 * Romans 15:13"
  },
  "2-21": {
    "verse": "“But the Lord stood by me and strengthened me.” (2 Timothy 4:17)",
    "text": "Sometimes the hardest battles are fought when no one's watching. You may feel forsaken, but God never leaves your side. Even if others walk away, He stands by you. Today, lean on the One who has never once abandoned you.\\n\\nDeuteronomy 31:8 * Psalm 18:32 * Hebrews 13:5–6"
  },
  "2-22": {
    "verse": "“He will not let your foot be moved; he who keeps you will not slumber.” (Psalm 121:3)",
    "text": "Some days are shaky, and old habits try to creep in. But God never loses sight of you—He doesn't rest or forget. When you feel like you're about to slip, call out to Him. He is alert, active, and present—always guarding your steps.\\n\\nPsalm 37:23–24 * Isaiah 41:10 * Jude 1:24"
  },
  "2-23": {
    "verse": "“Out of my distress I called on the LORD; the LORD answered me and set me free.” (Psalm 118:5)",
    "text": "True freedom begins the moment you call on the Lord, even if circumstances don't instantly change. God hears the honest cries of His children and responds—often by freeing what's within you first. Today, call on Him boldly. Freedom is not a myth; it's His promise.\\n\\n2 Corinthians 3:17 * John 8:36 * Romans 6:22"
  },
  "2-24": {
    "verse": "“So teach us to number our days that we may get a heart of wisdom.” (Psalm 90:12)",
    "text": "Time is a gift, and each day in recovery counts. Ask God to help you see your days as He sees them—not with regret but with purpose. Today, use your moments wisely, choosing growth over regret. You're learning to live with eternal perspective.\\n\\nEphesians 5:15–17 * James 4:14 * Ecclesiastes 3:1"
  },
  "2-25": {
    "verse": "“The LORD is good, a stronghold in the day of trouble; he knows those who take refuge in him.” (Nahum 1:7)",
    "text": "When trouble comes—and it will—you need more than willpower. You need a fortress. God isn't just a hiding place; He is your stronghold who intimately knows you. Today, run to Him. He welcomes you and shields you with steadfast love.\\n\\nPsalm 46:1 * Proverbs 18:10 * Isaiah 26:3–4"
  },
  "2-26": {
    "verse": "“A bruised reed he will not break, and a faintly burning wick he will not quench.” (Isaiah 42:3)",
    "text": "You may feel fragile—your light barely flickering. But God doesn't discard the weak or snuff out the struggling. He restores and gently fans your ember back to flame. Today, let His tender care draw near. He's here to heal, not condemn.\\n\\nMatthew 12:20 * Psalm 147:3 * 2 Corinthians 12:9"
  },
  "2-27": {
    "verse": "“Whoever walks in integrity walks securely.” (Proverbs 10:9)",
    "text": "Integrity means doing the next right thing—even when no one's watching. It builds a foundation that can't be shaken. Today, choose honesty and truth in small decisions. Security isn't about control; it's about a heart aligned with God.\\n\\nPsalm 15:1–2 * Micah 6:8 * Colossians 3:23–24"
  },
  "2-28": {
    "verse": "“He brought me out into a broad place; he rescued me, because he delighted in me.” (Psalm 18:19)",
    "text": "God didn't rescue you out of obligation—He did it because He delights in you. His rescue isn't just about survival; it's about joy and freedom. Today, believe you are deeply loved, not for what you do but for who you are. Rejoice in His delight over your life.\\n\\nZephaniah 3:17 * Isaiah 61:10 * John 10:10"
  },
  "3-1": {
    "verse": "“Call to me and I will answer you and tell you great and unsearchable things you do not know.” (Jeremiah 33:3)",
    "text": "Recovery often brings questions—about purpose, identity, and tomorrow. God promises that when you reach out in honesty and need, He responds with wisdom beyond your understanding. Today, don't hold back your doubts or fears. Call out, expect His answer, and watch how His perspective illuminates paths you couldn't see.\\n\\nProverbs 2:6 * James 1:5 * Psalm 25:4–5"
  },
  "3-2": {
    "verse": "“Your word is a lamp to my feet and a light to my path.” (Psalm 119:105)",
    "text": "In recovery, it's easy to stumble in the dark—temptations, regrets, old habits waiting in the shadows. God's Word doesn't banish every obstacle instantly, but it does shine on the next right step. Today, lean into Scripture: read a verse, meditate on it, and let it guide you past uncertainties. Even a small flicker of truth keeps you from tripping over what lies ahead.\\n\\nPsalm 19:8 * Proverbs 6:23 * 2 Timothy 3:16"
  },
  "3-3": {
    "verse": "“If any of you lacks wisdom, you should ask God, who gives generously to all without finding fault.” (James 1:5)",
    "text": "Recovery decisions—big and small—can feel overwhelming. God wants you to turn to Him for insight, not to muster answers alone. When you ask, ask believing He delights to equip you. Today, pray for wisdom before every choice—meals, relationships, routines. Expect His generous help to shape each step.\\n\\nProverbs 3:5–6 * Colossians 1:9 * Jeremiah 29:11"
  },
  "3-4": {
    "verse": "“In all your ways acknowledge him, and he will make straight your paths.” (Proverbs 3:6)",
    "text": "It's tempting to carve out recovery on your own terms—your schedule, your comfort zone. But God invites you to include Him in every plan: morning routines, daily commitments, long-term goals. Today, pause before action and acknowledge Him: “God, I need You.” Watch how He straightens what feels crooked, opening doors of peace, clarity, and momentum you hadn't expected.\\n\\nPsalm 37:23 * Isaiah 30:21 * Philippians 4:6–7"
  },
  "3-5": {
    "verse": "\"When you pass through the waters, I will be with you; and through the rivers, they shall not overwhelm you.\" (Isaiah 43:2)",
    "text": "There are seasons in recovery that feel like drowning—waves of emotion, guilt, or fear. Yet God's promise stands: He doesn't rescue you by keeping you dry; He walks with you through the flood. Today, if pressures rise around you, remind yourself: He is right beside you, shoulder to shoulder, guiding you step by step. No current can sweep you away when He holds you close. Psalm 46:1–2 * 2 Timothy 4:18 * Romans 8:38–39"
  },
  "3-6": {
    "verse": "\"I can do all things through him who strengthens me.\" (Philippians 4:13)",
    "text": "Some days, recovery feels like running a race with no finish line. But the strength you need isn't yours—it's His. When you feel depleted, repeat this promise: you can persevere because He empowers you. Today, face your challenges—work, relationships, temptations—knowing that His stamina flows into your weakness, turning overcoming into your daily rhythm. Isaiah 40:29 * 2 Corinthians 12:9–10 * Ephesians 6:10"
  },
  "3-7": {
    "verse": "\"Cast all your anxiety on him because he cares for you.\" (1 Peter 5:7)",
    "text": "Anxiety often tells us we must carry our worries alone. But God invites you to trade the weight of fear for His attentive care. Picture handing each concern—finances, relationships, health—into His outstretched hands. Today, practice that exchange: whenever anxiety strikes, pause, pray, and consciously release it to Him. Feel His peace settle in its place, because He truly cares about every detail of your life. Matthew 11:28–30 * Philippians 4:6–7 * Psalm 55:22"
  },
  "3-8": {
    "verse": "“For I know the plans I have for you, declares the LORD, plans to prosper you and not to harm you, plans to give you hope and a future.” (Jeremiah 29:11)",
    "text": "Recovery can feel uncertain—each step forward sometimes seems tentative, each decision weighed with fear of failure. Yet God's promise is sure: He has already mapped out a future for you, a storyline of hope, not harm. Even when circumstances seem to derail you, His plans remain steady and steadfast. Today, rest in the assurance that He is working all things, including your struggles, for your good and His glory. Trust His timing, lean into His guidance, and walk confidently into the hope He's prepared. Isaiah 55:8-9 * Romans 8:28 * Proverbs 3:5-6"
  },
  "3-9": {
    "verse": "“My grace is sufficient for you, for my power is made perfect in weakness.” (2 Corinthians 12:9)",
    "text": "It's natural to feel inadequate in recovery—to worry you don't have what it takes to change. But God's strength shines brightest in our weakness. When you draw near to Him, admit your limits, and lean into His grace, His power fills the gaps. Today, instead of striving in your own strength, soak in His unearned favor. Let His grace uphold you, empower you, and transform your weakness into a gentle demonstration of His might. 2 Corinthians 4:16-18 * Psalm 73:26 * Zephaniah 3:17"
  },
  "3-10": {
    "verse": "“The steadfast love of the LORD never ceases; his mercies never come to an end; they are new every morning.” (Lamentations 3:22–23)",
    "text": "Some mornings in recovery feel heavy with guilt or regret. Yet each sunrise brings fresh mercy—God's compassion reset and renewed for you. No mistake is so great that His love runs dry, no failure so deep that His mercy cannot reach you. Today, receive His new mercies. Let them wash over your spirit, reminding you that every day is a gift and every morning a fresh opportunity to walk in His grace. Psalm 30:5 * Lamentations 3:24 * James 1:17"
  },
  "3-11": {
    "verse": "“Peace I leave with you; my peace I give you. I do not give to you as the world gives.” (John 14:27)",
    "text": "True peace in recovery isn't absence of chaos but presence of Christ. While the world's calm is conditional and fleeting, Jesus offers a deep, unshakable peace that anchors your soul even amid storms. Today, pause and invite His peace into your anxious thoughts. Exchange your worries for His rest, and let His quiet confidence guard your heart and mind as you navigate each challenge. Philippians 4:6-7 * Isaiah 26:3 * Colossians 3:15"
  },
  "3-12": {
    "verse": "“The LORD is my strength and my song; he has become my salvation.” (Exodus 15:2)",
    "text": "Recovery is both battle and triumph, sorrow and song. God isn't just the One who carries you through each struggle—He's the source of your joy and praise. When you feel weary, remember that He is your strength renewed, and your heart can burst into song because He is your salvation. Today, lift your voice in gratitude. Let praise be both your weapon and your celebration as you walk forward in His power. Psalm 118:14 * Isaiah 12:2 * Habakkuk 3:18"
  },
  "3-13": {
    "verse": "“The LORD will fight for you; you need only to be still.” (Exodus 14:14)",
    "text": "When the pressures of recovery mount—temptations rising, doubts encroaching—it's tempting to react in panic or self-reliance. Yet God calls you to stillness: to trust Him as your defender. He sees every battle and stands ready to fight on your behalf. Today, step back from striving and simply be still in His presence. Allow Him to move in your defense, secure in the knowledge that victory belongs to the Lord. Psalm 46:10 * Deuteronomy 1:30 * 2 Chronicles 20:17"
  },
  "3-14": {
    "verse": "“You are the light of the world. A city set on a hill cannot be hidden.” (Matthew 5:14)",
    "text": "Recovery transforms your story from one of darkness into a beacon of hope. As God's light shines through your healed life, it illuminates the path for others still stumbling in shadows. Today, embrace your role as a light-bearer: let your honesty, compassion, and newfound freedom reflect Christ's love to those around you. Wherever you go, trust that His light through you dispels fear and reveals the way forward. Philippians 2:15 * Ephesians 5:8 * Isaiah 58:10"
  },
  "3-15": {
    "verse": "“Come to me, all who labor and are heavy laden, and I will give you rest.” (Matthew 11:28)",
    "text": "Recovery can feel exhausting—physically, emotionally, and spiritually. Yet Jesus invites you not to muster more strength on your own, but to lay down your burdens at His feet and receive His rest. Today, resist the urge to push through on sheer willpower. Instead, draw near to Him in prayer, in stillness, or in worship, and let His gentle peace refresh your weary soul.\\n\\nPsalm 55:22 * Hebrews 4:16 * Isaiah 40:29–31"
  },
  "3-16": {
    "verse": "“Behold, I am doing a new thing; now it springs forth, do you not perceive it?” (Isaiah 43:19)",
    "text": "It's easy to feel stuck in old patterns, as if nothing will ever change. But God is always at work, birthing new life and fresh starts in unexpected places. Today, open your eyes to His “new thing” —whether it's a breakthrough in thought, a restored relationship, or a hidden blessing—and step into it with faith. He delights in redeeming the past and making all things new.\\n\\n2 Corinthians 5:17 * Revelation 21:5 * Lamentations 3:22–23"
  },
  "3-17": {
    "verse": "“And we know that for those who love God all things work together for good, for those who are called according to his purpose.” (Romans 8:28)",
    "text": "In recovery, you've walked through seasons of pain, regret, and loss. Yet God promises that every experience—good or bad—can be woven into His redemptive story for your life. Today, trust Him with the tangled threads of your past. Believe that He is crafting something beautiful from every broken piece, and allow that hope to fuel your perseverance.\\n\\nGenesis 50:20 * Jeremiah 29:11 * Philippians 1:6"
  },
  "3-18": {
    "verse": "“The Lord is not slow to fulfill his promise as some count slowness, but is patient toward you, not wishing that any should perish, but that all should reach repentance.” (2 Peter 3:9)",
    "text": "When change feels slow, impatience and doubt can creep in. Yet God measures time differently—He's patient, giving you space to grow, to learn, and to heal. Today, rest in His timing rather than your own. Know that He's more concerned with your lasting transformation than a hurried fix, and that His delays are often expressions of His grace.\\n\\nHabakkuk 2:3 * Psalm 27:14 * Lamentations 3:25"
  },
  "3-19": {
    "verse": "“Submit yourselves therefore to God. Resist the devil, and he will flee from you.” (James 4:7)",
    "text": "Recovery isn't just about resisting old habits—it's about daily surrender to God's authority. When you bow your heart to Him—through prayer, Scripture, or simple trust—you draw strength to stand firm against temptation. Today, consciously submit every area of your life to His control, and watch the power of resistance push away the lies and deceptions that once held you captive.\\n\\nEphesians 6:10–11 * 1 Peter 5:8–9 * Romans 12:1"
  },
  "3-20": {
    "verse": "“The sacrifices of God are a broken spirit; a broken and contrite heart, O God, you will not despise.” (Psalm 51:17)",
    "text": "Recovery often requires humility—admitting your failures, your need, and your dependence on God's mercy. A contrite heart, though painful, is precious to Him and the first step toward genuine healing. Today, offer God the sacrifice of honesty and brokenness. Ask Him to renew your spirit and to fashion in you a heart that trusts Him above all else.\\n\\nIsaiah 66:2 * Matthew 5:3 * Joel 2:12–13"
  },
  "3-21": {
    "verse": "“If we confess our sins, he is faithful and just to forgive us our sins and to cleanse us from all unrighteousness.” (1 John 1:9)",
    "text": "Guilt and shame can be heavy chains in recovery—keeping you trapped in past mistakes. Yet God's offer is clear: confess, and He forgives completely. Today, bring every hidden fault into the light of His presence. Speak it aloud if you can, and receive His cleansing forgiveness. He doesn't merely cover over sin; He washes it away, giving you a fresh start.\\n\\nPsalm 103:12 * Isaiah 1:18 * Hebrews 10:17"
  },
  "3-22": {
    "verse": "“My help comes from the LORD, who made heaven and earth.” (Psalm 121:2)",
    "text": "Recovery can feel overwhelming when challenges loom large—but your ultimate help isn't found in self-will or in human strength. It comes from the same God who spoke the universe into being. Today, look upward and remind yourself that the Creator of all is also the One who upholds you. Lean into His sustaining power, and trust that He who fashioned every star will carry you through every trial.\\n\\nPsalm 46:1 * Isaiah 41:13 * Hebrews 13:5"
  },
  "3-23": {
    "verse": "“As far as the east is from the west, so far does he remove our transgressions from us.” (Psalm 103:12)",
    "text": "Guilt and shame have a way of chasing us down in recovery, whispering that we're defined by our worst moments. But God's forgiveness isn't measured by our failures—it's as limitless as the horizon. Today, imagine your sins being carried away in the sunrise, never to return. Embrace the freedom of His complete pardon and walk forward unburdened by yesterday's mistakes.\\n\\nIsaiah 43:25 * Micah 7:19 * 1 John 1:9"
  },
  "3-24": {
    "verse": "“Commit your work to the LORD, and your plans will be established.” (Proverbs 16:3)",
    "text": "When rebuilding your life, it's tempting to launch into action on your own. But true success in recovery springs from surrender—handing your goals, routines, and hopes over to God. Today, before you make any plan or take any step, offer it to Him in prayer. Watch how He guides, refines, and blesses your efforts so that what you build endures far beyond your own strength.\\n\\nPsalm 37:5 * James 4:13–15 * Isaiah 58:11"
  },
  "3-25": {
    "verse": "“Be strong and let your heart take courage, all you who wait for the LORD!” (Psalm 31:24)",
    "text": "Waiting is often the hardest part of recovery—waiting for healing, waiting for breakthrough, waiting for peace. But God's Word calls you not to despair, but to rise up in strength and hope. Today, plant your heart firmly on His faithfulness. Even as you wait, allow courage to grow in your spirit, knowing that He who promised is faithful to act in due time.\\n\\nIsaiah 40:31 * Lamentations 3:25–26 * Hebrews 10:23"
  },
  "3-26": {
    "verse": "“The LORD will fulfill his purpose for me; your steadfast love, O LORD, endures forever.” (Psalm 138:8)",
    "text": "In recovery, it can feel like your story is off track—that you'll never become the person you hope to be. Yet God is weaving every chapter of your life into His greater purpose. Today, rest in the certainty that no detour is wasted. His steadfast love carries you forward, completing the work He began in you and shaping your future for His glory.\\n\\nPhilippians 1:6 * Romans 8:28 * Ephesians 3:20"
  },
  "3-27": {
    "verse": "“Delight yourself in the LORD, and he will give you the desires of your heart.” (Psalm 37:4)",
    "text": "Recovery isn't only about letting go—it's also about delighting in God so deeply that your desires align with His. As you spend time in His presence—through prayer, worship, or Scripture—He reshapes what you long for. Today, choose to feast on God's goodness. As your joy in Him grows, notice how your heart's deepest longings begin to reflect His will and His ways.\\n\\nPsalm 16:11 * Matthew 6:33 * John 15:7"
  },
  "3-28": {
    "verse": "“The LORD is my portion; I promise to keep your words.” (Psalm 119:57)",
    "text": "In recovery, you can feel like everything familiar is slipping away—relationships, routines, even personal identity. Yet God Himself is your unchanging portion. When every other support feels unreliable, His presence and His promises remain your inheritance. Today, affirm that He alone satisfies. Let His Word shape your commitment, knowing that as you hold fast to His truth, you are never left empty.\\n\\nLamentations 3:24 * Philippians 4:19 * Hebrews 13:5"
  },
  "3-29": {
    "verse": "“This is the day that the LORD has made; let us rejoice and be glad in it.” (Psalm 118:24)",
    "text": "Each new day in recovery is a divine gift—a fresh canvas for hope, growth, and gratitude. It's easy to rush past morning light into yesterday's regrets or tomorrow's worries. Today, pause and celebrate the gift of right-now life. Rejoice in small victories, in simple blessings, and in God's faithfulness to bring you safely through another sunrise.\\n\\nPsalm 59:16 * Lamentations 3:23 * Philippians 4:4"
  },
  "3-30": {
    "verse": "“For where two or three are gathered in my name, there am I among them.” (Matthew 18:20)",
    "text": "Recovery is never meant to be walked alone. God invites you into community—safe spaces where honesty, support, and prayer transform lives together. Today, reach out to another believer: share a victory, a struggle, or a simple hello. In those moments of genuine connection, Jesus promises to show up, reminding you that you are part of His body and never alone in the journey.\\n\\nHebrews 10:24–25 * James 5:16 * Galatians 6:2"
  },
  "3-31": {
    "verse": "“Jesus Christ is the same yesterday and today and forever.” (Hebrews 13:8)",
    "text": "As you close out another month of recovery, you may feel many things—progress, setbacks, hope, or uncertainty. But one constant remains: the unchanging character of Christ. His love, His mercy, and His power hold firm across every season. Today, anchor your heart in the truth that He neither changes nor falters. Because of Him, you can face the future with confident faith, knowing His steadfast grace carries you always.\\n\\nPsalm 102:27 * Isaiah 40:8 * Malachi 3:6"
  },
  "4-1": {
    "verse": "“Create in me a clean heart, O God, and renew a right spirit within me.” (Psalm 51:10)",
    "text": "In recovery, it's easy to carry shame and guilt like a burden on your heart. Yet God doesn't want you to live under that weight—He invites you into cleansing and renewal. Today, ask Him to wash away past mistakes and restore your spirit. As He makes your heart new, you'll find the freedom to walk boldly into each moment, confident in His mercy and grace.\\n\\nEzekiel 36:26 * 1 John 1:9 * Psalm 86:11"
  },
  "4-2": {
    "verse": "“Do not be conformed to this world, but be transformed by the renewal of your mind.” (Romans 12:2)",
    "text": "Old thought-patterns and self-criticisms can keep you trapped in the past. God calls you to a different way: a transformation that begins in your mind. Today, replace lies (“I'll never change”) with God's truth (“I am being renewed”). As you meditate on His promises, your perspective will shift—and your actions will follow, reflecting the new life He's shaping within you.\\n\\nColossians 3:2 * Philippians 4:8 * 2 Corinthians 10:5"
  },
  "4-3": {
    "verse": "“I will give you a new heart, and a new spirit I will put within you.” (Ezekiel 36:26)",
    "text": "Recovery isn't just about breaking old habits—it's about embracing the new identity God offers. He doesn't simply patch up your old self; He gives you a fresh heart and a spirit empowered by His presence. Today, welcome the new life He's planted within you. Let His Spirit guide your choices, giving you strength to live differently and joy to celebrate each victory.\\n\\nPsalm 103:5 * 2 Corinthians 5:17 * Philippians 1:6"
  },
  "4-4": {
    "verse": "“If any of you lacks wisdom, let him ask of God, who gives generously to all without reproach.” (James 1:5)",
    "text": "Recovery decisions—whether big or small—can feel overwhelming. God promises to supply the wisdom you need when you seek Him. Today, before you face a challenge or plan a new step, pause and ask. Trust that He will guide you generously and gently, helping you make choices that align with His will and bring lasting growth.\\n\\nProverbs 3:5–6 * Colossians 1:9 * Psalm 25:4–5"
  },
  "4-5": {
    "verse": "“Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God.” (Philippians 4:6)",
    "text": "Anxiety can steal your peace and focus, making recovery feel like an uphill battle. Yet God calls you into prayer instead of worry. Today, take every anxious thought to Him—lay out your fears and needs—and then give thanks for His care. As you exchange anxiety for prayer, you'll discover a peace that steadies your heart and mind, even amid uncertainty.\\n\\nMatthew 11:28–30 * 1 Peter 5:7 * Isaiah 26:3"
  },
  "4-6": {
    "verse": "“But they who wait for the LORD shall renew their strength; they shall mount up with wings like eagles.” (Isaiah 40:31)",
    "text": "Impatience and fatigue often accompany long journeys in recovery. God doesn't promise instant answers, but He does promise renewed strength for those who wait on Him. Today, if you feel weary or discouraged, pause and place your hope in the Lord. As you quietly trust Him, He will lift you above your circumstances, giving you the stamina to soar.\\n\\nPsalm 27:14 * Lamentations 3:25–26 * 2 Corinthians 4:16"
  },
  "4-7": {
    "verse": "“But seek first the kingdom of God and his righteousness, and all these things will be added to you.” (Matthew 6:33)",
    "text": "It's tempting to chase quick fixes or temporary comforts in recovery, but Jesus calls you to a higher priority: His kingdom. When you focus on knowing Him—through prayer, worship, and obedience—He promises to provide for your every need. Today, realign your heart with this truth. Seek Him above all else, and watch how He brings peace, provision, and purpose into every area of your life.\\n\\nPsalm 37:4 * Proverbs 16:3 * Philippians 4:19"
  },
  "4-8": {
    "verse": "“The LORD is near to the brokenhearted and saves the crushed in spirit.” (Psalm 34:18)",
    "text": "When life has left you feeling shattered, God isn't distant—He draws especially close to mend what's been broken. Bring your wounds and your pain to Him today. Let His compassion wrap around you, knowing He sees every tear and is actively at work restoring your heart.\\n\\nPsalm 147:3 * Isaiah 61:1 * Matthew 5:4"
  },
  "4-9": {
    "verse": "“Trust in the LORD with all your heart, and do not lean on your own understanding.” (Proverbs 3:5)",
    "text": "It's tempting to rely on logic or past experience in recovery, but true wisdom comes from surrendering your doubts to God. Today, release the urge to figure everything out on your own. Lean into His leading—even when the path seems unclear—and watch Him guide you in ways you couldn't have imagined.\\n\\nJeremiah 17:7 * Isaiah 26:4 * Psalm 37:5"
  },
  "4-10": {
    "verse": "“Cast all your anxieties on him, because he cares for you.” (1 Peter 5:7)",
    "text": "Anxiety tells you that you must carry your burdens alone. But God invites you to hand them over to Him—one by one—knowing He deeply cares for every detail of your life. Today, practice that exchange: identify one worry, voice it in prayer, then rest in His faithful care.\\n\\nPhilippians 4:6–7 * Matthew 6:25–27 * Psalm 55:22"
  },
  "4-11": {
    "verse": "“Your word is a lamp to my feet and a light to my path.” (Psalm 119:105)",
    "text": "Recovery often requires one small, wise step at a time. God's Word illuminates that next step, helping you avoid old pitfalls. Today, open Scripture and let a single verse guide you forward—trusting it to bring clarity and hope for the journey ahead.\\n\\nPsalm 19:8 * Proverbs 6:23 * 2 Timothy 3:16–17"
  },
  "4-12": {
    "verse": "“I have loved you with an everlasting love; therefore I have continued my faithfulness to you.” (Jeremiah 31:3)",
    "text": "Sometimes you might feel unlovable or beyond hope. Yet God's love for you never ends—it's a constant, unshakable truth. Today, rest in that steadfast affection. Let it reshape how you see yourself and how you move through every challenge, secure in His never-failing devotion.\\n\\nRomans 8:38–39 * Isaiah 54:10 * Lamentations 3:22–23"
  },
  "4-13": {
    "verse": "“Create in me a clean heart, O God, and renew a right spirit within me.” (Psalm 51:10)",
    "text": "Guilt and shame can cling tightly in recovery. But God invites you into a fresh start—He wants to cleanse and renew you from the inside out. Today, confess honestly, then receive His forgiveness and renewal, stepping into each moment with a spirit made new.\\n\\nEzekiel 36:25–27 * 1 John 1:9 * Psalm 86:11"
  },
  "4-14": {
    "verse": "“Be strong and courageous. Do not be frightened, and do not be dismayed, for the LORD your God is with you wherever you go.” (Joshua 1:9)",
    "text": "Recovery often pushes you into unknown territory. In those moments, God's command is clear: don't fear—He is with you. Today, face whatever's ahead with courage, knowing that the Creator of the universe walks beside you, empowering you step by step.\\n\\nDeuteronomy 31:6 * Isaiah 41:10 * Psalm 23:4"
  },
  "4-15": {
    "verse": "“I am the vine; you are the branches. Whoever abides in me and I in him, he it is that bears much fruit, for apart from me you can do nothing.” (John 15:5)",
    "text": "Recovery isn't just about removing what harms you—it's about staying deeply connected to the source of true life. When you abide in Christ—through prayer, Scripture, and dependence—He nourishes every part of your heart, giving you strength to overcome temptation and to grow in character. Today, remain attached to Him: let His love flow through you, producing patience, kindness, and perseverance in every situation.\\n\\nGalatians 2:20 * Philippians 2:13 * Colossians 2:6"
  },
  "4-16": {
    "verse": "“Submit yourselves therefore to God. Resist the devil, and he will flee from you.” (James 4:7)",
    "text": "Recovery can feel like a battlefield, with old patterns and pressures pulling you back. God's battle plan is simple: come under His authority first, then stand against every lie and temptation. As you yield your will to Him—through humble prayer, obedience, and worship—darkness must give way. Today, choose submission to God, and watch how the enemy's power dissolves under the authority of Christ.\\n\\n1 Peter 5:8-9 * Ephesians 6:11 * Psalm 46:10"
  },
  "4-17": {
    "verse": "“The LORD has done great things for us, and we are filled with joy.” (Psalm 126:3)",
    "text": "It's easy to focus on the uphill climbs of recovery, but God's past faithfulness is a wellspring of joy and hope. Remember the moments He carried you through pain, answered a prayer, or restored a relationship—and let those memories fuel your confidence today. As you recount His goodness, your spirit will be uplifted, and you'll find fresh courage to face whatever lies ahead.\\n\\nPsalm 30:5 * Psalm 118:24 * Lamentations 3:23"
  },
  "4-18": {
    "verse": "“I have stored up your word in my heart, that I might not sin against you.” (Psalm 119:11)",
    "text": "Battles in recovery are often won or lost in the mind. By hiding God's truth in your heart—meditating on it day and night—you build a fortified defense against every lie. Today, choose one verse to memorize or journal, then recall it whenever old habits knock. As His Word springs to mind, you'll find the wisdom and restraint you need to walk in victory.\\n\\nPsalm 19:14 * Colossians 3:16 * Joshua 1:8"
  },
  "4-19": {
    "verse": "“And my God will supply every need of yours according to his riches in glory in Christ Jesus.” (Philippians 4:19)",
    "text": "Worry about finances, relationships, or health can steal your focus from recovery. Yet God's promise is to meet every genuine need out of His limitless resources. Today, bring your concerns before Him in prayer—then trust Him to provide, even if the answer looks different than you expect. His abundance is more than enough to carry you through every season.\\n\\nMatthew 6:33 * Psalm 23:1 * 2 Corinthians 9:8"
  },
  "4-20": {
    "verse": "“Draw near to God, and he will draw near to you.” (James 4:8)",
    "text": "When you feel distant from God—overwhelmed, discouraged, or “too busy”—He is inviting you closer. Every step you take toward Him—through honest prayer, quiet reflection, or praise—He matches with a step toward you. Today, lean in: open your heart, confess your need, and listen for His gentle whisper. In that sweet proximity, you'll find the help, comfort, and strength you crave.\\n\\nHebrews 10:22 * Psalm 145:18-19 * Jeremiah 29:13"
  },
  "4-21": {
    "verse": "“Trust in the LORD forever, for the LORD GOD is an everlasting rock.” (Isaiah 26:4)",
    "text": "Stability in recovery comes not from your shifting circumstances, but from the unshakable character of God. He is your Everlasting Rock—steady, faithful, and unchangeable. Today, anchor your trust in Him alone. When doubts or fears rise, remind yourself: no trial is too great for the Rock who stands firm through every storm.\\n\\nPsalm 31:6 * Proverbs 3:5-6 * Deuteronomy 32:4"
  },
  "4-22": {
    "verse": "“Behold, God is my salvation; I will trust, and will not be afraid.” (Isaiah 12:2)",
    "text": "Recovery often stirs fear—fear of relapse, fear of failure, fear of the unknown. But God's salvation isn't conditional or fleeting; it is steadfast and sure. Today, choose to trust Him above your circumstances. When anxiety rises, remind yourself of His saving power and let His peace cast out every fear.\\n\\nPsalm 27:1 * Proverbs 29:25 * 2 Timothy 1:7"
  },
  "4-23": {
    "verse": "“Even to your old age and gray hairs I am he; I am he who will sustain you.” (Isaiah 46:4)",
    "text": "Your recovery journey isn't just for this season of life—it's for every chapter God has planned for you. He doesn't grow weary of carrying you, no matter how long the road or how many challenges you face. Today, rest in His promise to sustain you, not only now but for all the days He has given.\\n\\nPsalm 71:9 * Lamentations 3:22–23 * Hebrews 13:8"
  },
  "4-24": {
    "verse": "“Call upon me in the day of trouble; I will deliver you, and you shall glorify me.” (Psalm 50:15)",
    "text": "When pressures mount and old habits whisper, remember that help is only a prayer away. God invites you to call on Him in your darkest hours—and He promises rescue. Today, don't wait until you're overwhelmed. Reach out right now, and let His deliverance shine through your testimony.\\n\\nPsalm 34:4 * Nahum 1:7 * 2 Timothy 4:18"
  },
  "4-25": {
    "verse": "“A new commandment I give to you, that you love one another: just as I have loved you, you also are to love one another.” (John 13:34)",
    "text": "Recovery thrives in community—where grace is extended, accountability is real, and love reflects Jesus. You're called not only to receive that love but to pour it out. Today, look for a chance to encourage a brother or sister in their journey, mirroring the same unconditional love Christ has shown you.\\n\\n1 John 4:7–8 * Romans 12:10 * Galatians 6:2"
  },
  "4-26": {
    "verse": "“For I will restore health to you, and your wounds I will heal, declares the LORD.” (Jeremiah 30:17)",
    "text": "Addiction and trauma leave scars that seem permanent—but God specializes in restoration. His healing touch doesn't just cover the wound; it makes you whole again. Today, invite Him to tend to your deepest hurts. Trust that He will bring health to your body, mind, and spirit as you lean into His care.\\n\\nPsalm 147:3 * Isaiah 61:1 * James 5:16"
  },
  "4-27": {
    "verse": "“Not by might, nor by power, but by my Spirit, says the LORD of hosts.” (Zechariah 4:6)",
    "text": "Recovery is not won by sheer willpower or personal determination alone—it's accomplished through the power of God's Spirit working in you. Today, surrender any pride in your own strength. Ask Him to fill you afresh with His Spirit, empowering you to overcome what once seemed impossible.\\n\\n2 Corinthians 3:5 * Ephesians 6:10 * John 15:5"
  },
  "4-28": {
    "verse": "“Therefore encourage one another and build one another up, just as you are doing.” (1 Thessalonians 5:11)",
    "text": "A word of encouragement can be the spark that keeps someone pressing on. God uses your testimony, your presence, and your prayers to lift others out of despair. Today, reach out—send a text, make a call, offer a prayer. Your simple act of building someone up can reflect Christ's love and strengthen the whole body.\\n\\nHebrews 10:24 * Ephesians 4:29 * Colossians 3:16"
  },
  "4-29": {
    "verse": "“The LORD is gracious and merciful, slow to anger and abounding in steadfast love.” (Psalm 145:8)",
    "text": "God's character towards you isn't defined by your failures but by His gracious heart. His mercy meets you where you are, and His love pursues you without end. Today, when shame or self-condemnation whisper lies, counter them with the truth of His patience and abundant love. Rest knowing He delights in extending grace.\\n\\nLamentations 3:22–23 * Exodus 34:6 * Micah 7:18"
  },
  "4-30": {
    "verse": "“The eternal God is your refuge, and underneath are the everlasting arms.” (Deuteronomy 33:27)",
    "text": "As April ends, look back on how far you've come—and remember that your security is anchored not in your own effort but in the eternal God. His arms never grow tired, and His care never fails. Today, step forward into May with confidenc"
  },
  "5-1": {
    "verse": "\"Trust in the Lord with all your heart, and do not lean on your own understanding.\" (Proverbs 3:5)",
    "text": "Recovery often feels like walking into the unknown. It's tempting to rely on your own understanding and strength, but true healing begins when you surrender control to God. Trusting in Him fully means acknowledging that His ways and timing are perfect, even when circumstances seem uncertain or difficult. As you learn to let go of your need to control outcomes, you'll find a profound peace rooted in His unchanging character. Today, take a moment to release your fears and uncertainties to God, placing your full trust in His faithful guidance and abundant love.\\n\\nPsalm 37:3-5 * Isaiah 26:3-4 * Jeremiah 17:7-8"
  },
  "5-2": {
    "verse": "\"Come to me, all who labor and are heavy laden, and I will give you rest.\" (Matthew 11:28)",
    "text": "Recovery can often feel overwhelming, but remember, you do not face this journey alone. Living in dependence on God provides strength and relief beyond your own abilities. In moments of exhaustion or despair, draw close to Him, and let His presence comfort you. Each step, no matter how small or hesitant, becomes lighter when you allow God to carry your burdens. Trust His promise of rest and restoration, and find peace in knowing you are held securely in His care. Let today be a reminder to lean fully into His loving support.\\n\\nPsalm 62:1-2 * Isaiah 40:31 * Matthew 11:29-30"
  },
  "5-3": {
    "verse": "\"I can do all things through him who strengthens me.\" (Philippians 4:13)",
    "text": "In the face of life's challenges, it's easy to feel inadequate or powerless. Yet God assures us that His strength is always available, ready to empower us to overcome our struggles. Instead of viewing hardships as insurmountable, consider them opportunities to experience God's power working through you. As you lean into His strength, difficult tasks become moments of deep spiritual growth. Today, consciously choose to rely on God's strength, confident in His promise that you can handle all things through Him.\\n\\n2 Corinthians 12:10 * Isaiah 41:13 * Ephesians 6:10"
  },
  "5-4": {
    "verse": "\"He heals the brokenhearted and binds up their wounds.\" (Psalm 147:3)",
    "text": "Your past experiences and pain do not have to dictate your future. God specializes in healing the wounds that seem impossible to mend. As you face your recovery journey, let God gently tend to your broken heart. Trust Him to restore what seems lost, binding up emotional and spiritual wounds with His tender care. Your willingness to open up to His healing touch marks the beginning of true restoration. Today, invite God into your most vulnerable places, knowing His healing is thorough and lasting.\\n\\nJeremiah 30:17 * Isaiah 61:1 * Psalm 34:18"
  },
  "5-5": {
    "verse": "\"Fear not, for I am with you; be not dismayed, for I am your God.\" (Isaiah 41:10)",
    "text": "Fear can paralyze you, especially during difficult seasons of recovery. But God calls you to courage, promising His unwavering presence. Whenever you feel overwhelmed by uncertainty or doubt, pause and remember that God is always near. By shifting your focus to His steadfastness, fear loses its grip. Today, choose faith over fear, confident that God walks with you, guiding each step towards healing and hope. Trust His promise to never leave you nor forsake you.\\n\\nDeuteronomy 31:6 * Joshua 1:9 * Psalm 56:3"
  },
  "5-6": {
    "verse": "\"Therefore, if anyone is in Christ, he is a new creation. The old has passed away; behold, the new has come.\" (2 Corinthians 5:17)",
    "text": "Your recovery journey is not merely about leaving behind the old, but embracing the profound transformation available in Christ. Each day brings fresh mercy and new opportunities to grow spiritually, emotionally, and mentally. God invites you to shed your past, stepping boldly into the new identity He has crafted specifically for you. As you move forward, remind yourself that you are a cherished creation, constantly renewed by His grace. Today, walk confidently in this newness, fully aware that the old has no hold over your future.\\n\\nRomans 6:4 * Ezekiel 36:26 * Revelation 21:5"
  },
  "5-7": {
    "verse": "\"Cast all your anxiety on him because he cares for you.\" (1 Peter 5:7)",
    "text": "Anxiety can consume your thoughts, draining you of peace and joy. Yet, God offers Himself as the bearer of your burdens, lovingly inviting you to cast your anxieties upon Him. When you feel worry begin to rise, take a moment to consciously surrender those feelings to God. This small act of trust strengthens your reliance on Him, replacing anxiety with His peace. Today, remind yourself of His unwavering care, confident that every concern is seen and held by Him.\\n\\nPhilippians 4:6-7 * Matthew 6:34 * Psalm 55:22"
  },
  "5-8": {
    "verse": "\"My grace is sufficient for you, for my power is made perfect in weakness.\" (2 Corinthians 12:9)",
    "text": "Recovery teaches us humility, reminding us that our greatest strength often appears in moments of profound weakness. It is tempting to hide vulnerabilities or mask our struggles, believing strength lies in independence. Yet, God gently reminds you that His grace thrives exactly where your abilities falter. When you admit your limitations and trust in His unlimited strength, you allow God's power to flow freely through your life. Today, rather than hiding behind self-sufficiency, embrace your dependence on Him. In doing so, you'll find an unexpected strength and freedom that only comes through surrendering completely to God's sufficient grace.\\n\\nPsalm 73:26 * Isaiah 40:29 * Hebrews 4:16"
  },
  "5-9": {
    "verse": "\"The steadfast love of the LORD never ceases; his mercies never come to an end; they are new every morning.\" (Lamentations 3:22-23)",
    "text": "Recovery often feels like a daily battle, with yesterday's struggles sometimes lingering into today. Yet, God offers fresh mercy each morning, washing away yesterday's burdens with abundant grace. His love isn't limited by your past mistakes or struggles; it's renewed daily, unwavering in its depth and sincerity. As you wake today, remind yourself that God meets you right where you are, offering the exact measure of grace needed for the day ahead. Let His steadfast love energize your spirit and renew your hope, trusting that each day carries the promise of new beginnings through Him.\\n\\nPsalm 30:5 * Isaiah 33:2 * James 4:6"
  },
  "5-10": {
    "verse": "\"Do not be conformed to this world, but be transformed by the renewal of your mind.\" (Romans 12:2)",
    "text": "Transformation in recovery starts from within, beginning with the renewal of your mind. The world may remind you of past failures or define you by mistakes, but God sees you differently. He sees a redeemed, restored, and purposeful life ahead of you. Today, make a conscious effort to replace negative self-talk with the powerful truths of God's Word. Allow your thinking to be reshaped by His perspective, creating new patterns of hope, resilience, and confidence rooted firmly in Christ. As your mind is transformed, you'll experience profound freedom and a life that increasingly reflects His love.\\n\\nColossians 3:2 * Philippians 4:8 * 2 Corinthians 10:5"
  },
  "5-11": {
    "verse": "\"The LORD your God is in your midst, a mighty one who will save; he will rejoice over you with gladness.\" (Zephaniah 3:17)",
    "text": "Sometimes the weight of our mistakes and regrets can feel overwhelming, convincing us that we're undeserving of joy or celebration. But God doesn't look upon you with disappointment or frustration—instead, He rejoices over your courage, your perseverance, and your journey toward healing. Today, remind yourself that God is actively celebrating your progress, no matter how small or unseen by others. Feel His loving presence rejoicing with you, knowing that your victories, even the quiet ones, matter deeply to Him. You are seen, loved, and celebrated by the One who holds all things together.\\n\\nIsaiah 62:5 * Luke 15:7 * Psalm 149:4"
  },
  "5-12": {
    "verse": "\"I waited patiently for the LORD; he inclined to me and heard my cry.\" (Psalm 40:1)",
    "text": "Patience is among the hardest virtues in recovery. Waiting for healing, clarity, or breakthrough can test your faith and resilience. Yet, God promises that your waiting is never wasted. He hears every whispered prayer, sees every silent tear, and deeply understands your heart's longing. In the waiting, He shapes you, strengthens your faith, and prepares you for blessings beyond your understanding. Today, trust that your prayers and patience will yield fruit in God's perfect timing. Embrace the assurance that God is attentively listening, faithfully preparing answers far greater than your expectations.\\n\\nIsaiah 40:31 * Psalm 27:14 * Romans 8:25"
  },
  "5-13": {
    "verse": "\"But they who wait for the LORD shall renew their strength; they shall mount up with wings like eagles.\" (Isaiah 40:31)",
    "text": "There are days when recovery feels draining, and your strength seems insufficient. Yet God promises renewal—not through striving, but through trusting and waiting on Him. Just as an eagle effortlessly soars by relying on currents rather than its own strength, you too can rise above challenges by resting in God's grace. Today, resist the urge to rely solely on your abilities; instead, intentionally rest in His presence, allowing His strength to lift you above weariness and worry. Experience the freedom that comes when you let God carry you, enabling you to soar beyond your struggles.\\n\\nPsalm 103:5 * Exodus 19:4 * 2 Corinthians 4:16"
  },
  "5-14": {
    "verse": "\"Peace I leave with you; my peace I give to you. Not as the world gives do I give to you.\" (John 14:27)",
    "text": "In a world full of uncertainties, recovery requires a peace that transcends circumstances—a peace only God can provide. Human efforts might offer temporary calm, but Christ gives enduring peace that anchors your soul amidst life's storms. This divine peace doesn't remove challenges, but it assures you of God's unchanging presence and steadfast love in the midst of difficulty. Today, surrender your anxieties and worries, receiving the gift of Christ's perfect peace. Let it guard your heart, guide your decisions, and reassure you that, with Him, you can confidently face whatever lies ahead.\\n\\nPhilippians 4:7 * Colossians 3:15 * Isaiah 26:3"
  },
  "5-15": {
    "verse": "\"He restores my soul. He leads me in paths of righteousness for his name's sake.\" (Psalm 23:3)",
    "text": "Recovery is not merely an outward change—it's a deep restoration of your soul by God Himself. Just as a skilled artist gently restores a precious masterpiece, God carefully renews your heart, bringing healing to the weary places within you. Today, embrace this truth: your soul is precious and valuable in His eyes. Allow Him to lead you along the path He's prepared, a path filled with purpose, hope, and renewal. Trust His guidance, confident that His restoration is always complete, perfect, and driven by His steadfast love for you.\\n\\nPsalm 51:12 * Isaiah 58:11 * 1 Peter 5:10"
  },
  "5-16": {
    "verse": "\"For we are his workmanship, created in Christ Jesus for good works, which God prepared beforehand.\" (Ephesians 2:10)",
    "text": "There are times in recovery when you might doubt your worth or question your purpose. Yet God lovingly reminds you today that you are intentionally crafted by His own hands, designed uniquely and purposefully for good things. Your past does not disqualify you; it becomes part of your testimony and equips you to help others who walk a similar road. Today, embrace your identity as God's workmanship, fully aware that He delights in transforming your experiences into opportunities for blessing, healing, and restoration—both for you and those around you.\\n\\nPhilippians 2:13 * Jeremiah 29:11 * Psalm 139:14"
  },
  "5-17": {
    "verse": "\"I have loved you with an everlasting love; therefore I have continued my faithfulness to you.\" (Jeremiah 31:3)",
    "text": "In recovery, feeling unloved or forgotten can be especially painful. But God reassures you today that His love for you is eternal, unwavering, and unchanging. Even when circumstances seem overwhelming or mistakes seem too great, His faithful love remains steadfast. You can never wander beyond the reach of His affection. Today, let yourself rest in this truth: God's love is everlasting, deeply personal, and stronger than any trial or failure you face. Let His faithful presence comfort your heart and strengthen your resolve.\\n\\nRomans 8:38-39 * Isaiah 54:10 * Psalm 136:26"
  },
  "5-18": {
    "verse": "\"The righteous cry out, and the LORD hears them; he delivers them from all their troubles.\" (Psalm 34:17)",
    "text": "During recovery, the feeling of isolation can be profound. It's easy to believe that no one truly understands your struggles or hears your cries. Yet today, God assures you that He listens intently, ready and willing to help. Your voice matters to Him; your pain does not go unnoticed. Cry out freely to God, knowing with confidence that He hears every word and sees every tear. Trust Him to deliver you, comfort you, and guide you through your troubles, bringing peace and clarity even in the midst of turmoil.\\n\\nPsalm 145:18 * Isaiah 65:24 * 2 Samuel 22:7"
  },
  "5-19": {
    "verse": "\"And behold, I am with you always, to the end of the age.\" (Matthew 28:20)",
    "text": "Recovery can often feel lonely, especially when past relationships have strained or changed. Yet God gives an unbreakable promise: He will never leave you alone. Whether you're experiencing joy or navigating pain, His presence remains constant. Today, remind yourself of this comforting truth: God walks with you, step by step, through every part of your journey. You are never abandoned, never forgotten. Allow His constant companionship to strengthen your heart, reassure your spirit, and provide deep, lasting comfort.\\n\\nDeuteronomy 31:8 * Hebrews 13:5 * Psalm 139:7-10"
  },
  "5-20": {
    "verse": "\"You keep him in perfect peace whose mind is stayed on you, because he trusts in you.\" (Isaiah 26:3)",
    "text": "True peace in recovery does not depend on external circumstances, but on where you place your trust. When your thoughts are fixed on God and His promises rather than on worries or fears, you'll find a peace that surpasses understanding. Today, intentionally set your mind on God's character—His goodness, faithfulness, and unwavering love. As your focus shifts from anxiety to trust, experience a profound sense of calm, clarity, and security. Allow His perfect peace to settle deeply within you, anchoring your heart amid life's challenges.\\n\\nJohn 16:33 * Romans 8:6 * Philippians 4:9"
  },
  "5-21": {
    "verse": "\"Let us then with confidence draw near to the throne of grace, that we may receive mercy.\" (Hebrews 4:16)",
    "text": "Sometimes recovery can make you feel unworthy to approach God—yet the opposite is true. God invites you to confidently approach Him precisely when you feel weakest, most broken, or most unworthy. His throne is a place of grace, acceptance, and unconditional love. Today, boldly enter His presence, knowing you'll find mercy, not judgment; acceptance, not rejection. Let this assurance remove your hesitations and doubts, allowing you to experience the fullness of His loving embrace, healing, and restoration.\\n\\nEphesians 3:12 * Romans 5:2 * James 4:8"
  },
  "5-22": {
    "verse": "\"For I know the plans I have for you, declares the LORD, plans for welfare and not for evil, to give you a future and a hope.\" (Jeremiah 29:11)",
    "text": "When recovery feels uncertain, you may wonder if there's truly a hopeful future waiting for you. God reassures you today that your future is secure in His hands. Though the path may sometimes seem unclear or difficult, each step is thoughtfully planned by a loving Father who wants only the best for you. Trust that even your struggles have purpose, shaping you into the person He has destined you to become. Today, lean into His promise and find comfort knowing that your story is still being written, and God Himself is the Author who lovingly crafts each page.\\n\\nProverbs 19:21 * Romans 8:28 * Isaiah 55:8-9"
  },
  "5-23": {
    "verse": "\"If the Son sets you free, you will be free indeed.\" (John 8:36)",
    "text": "Recovery is a journey toward true freedom—not just from addiction, guilt, or shame, but into a new life filled with purpose, joy, and hope. Christ offers you complete and lasting freedom, breaking the chains of your past and empowering you to walk boldly forward. You no longer need to carry the burden of old labels or past mistakes. Today, embrace the freedom Christ provides. Let it redefine you, restore you, and inspire you to live fully and abundantly as the beloved child of God you truly are.\\n\\nGalatians 5:1 * Romans 6:14 * 2 Corinthians 3:17"
  },
  "5-24": {
    "verse": "\"The LORD is my strength and my shield; in him my heart trusts, and I am helped.\" (Psalm 28:7)",
    "text": "When facing battles in your recovery, it's natural to feel vulnerable and exposed. Yet God promises to stand between you and every obstacle, becoming your shield and strength. Trust is the key to experiencing this divine protection fully. As you trust Him with your deepest fears and struggles, His power becomes tangible in your life, helping you overcome what once seemed insurmountable. Today, actively place your trust in Him, knowing He is your unshakable defense and unwavering support in every challenge you face.\\n\\nPsalm 18:2 * Ephesians 6:16 * Isaiah 12:2"
  },
  "5-25": {
    "verse": "\"I am making a way in the wilderness and streams in the wasteland.\" (Isaiah 43:19)",
    "text": "There are moments in recovery when the path ahead feels impossible—like a wilderness with no clear direction. In these times, God's promise is especially powerful: He creates paths where none exist, refreshing your soul in the driest places. Today, trust Him to open doors, provide clarity, and lead you forward, even when you can't see the way clearly. Hold onto hope, knowing He specializes in making a way out of impossible situations, bringing life and renewal into every area of your journey.\\n\\nPsalm 77:19 * Isaiah 35:6-7 * Revelation 21:6"
  },
  "5-26": {
    "verse": "\"Though the righteous fall seven times, they rise again.\" (Proverbs 24:16)",
    "text": "Recovery does not require perfection, only perseverance. God understands that stumbling is part of the human experience, and His grace is sufficient to lift you each time you fall. Every setback you face provides an opportunity to experience God's mercy anew, drawing you closer to His heart. Today, refuse to define yourself by the times you've fallen. Instead, focus on His strength that empowers you to rise again, stronger and wiser with each step. Your journey is measured by resilience, not perfection, and God is with you every step of the way.\\n\\nMicah 7:8 * Psalm 37:23-24 * Romans 8:37"
  },
  "5-27": {
    "verse": "\"Come near to God and he will come near to you.\" (James 4:8)",
    "text": "Feelings of isolation or distance from God can make recovery harder than it needs to be. Yet God invites you into an intimate relationship, promising closeness whenever you draw near to Him. Today, choose to actively approach God through prayer, meditation, and moments of quiet reflection. Let your heart be honest before Him, confident that He meets every effort you make with open arms. Experience His gentle, healing presence that comforts, guides, and strengthens you as you continue your journey.\\n\\nJeremiah 29:12-13 * Psalm 145:18-19 * Hebrews 10:22"
  },
  "5-28": {
    "verse": "\"I will instruct you and teach you in the way you should go; I will counsel you with my loving eye on you.\" (Psalm 32:8)",
    "text": "Recovery often involves difficult decisions, leaving you unsure of which direction to take. But you're never left to navigate these crossroads alone. God lovingly promises clear instruction, gentle guidance, and unwavering support. Today, pause and actively seek His wisdom for every choice you face, no matter how small it seems. Trust that He sees your entire journey, understands your deepest needs, and will faithfully guide you toward healing, growth, and lasting peace. Allow yourself to be led confidently by the One who lovingly watches over you.\\n\\nIsaiah 48:17 * Proverbs 3:6 * John 16:13"
  },
  "5-29": {
    "verse": "\"The LORD will fight for you; you need only to be still.\" (Exodus 14:14)",
    "text": "The journey of recovery can feel exhausting, like a relentless battle you fight alone. Today, God lovingly reminds you that He stands ready to fight your battles on your behalf. Your role is not always to struggle, but often simply to trust and rest quietly in His strength. When anxiety tempts you to act impulsively, pause and lean into God's promise instead. Be still, knowing He sees the challenges you face clearly and will defend, protect, and advocate for you in ways far beyond your own capacity. Rest today in His powerful embrace.\\n\\nDeuteronomy 3:22 * 2 Chronicles 20:17 * Psalm 46:10-11"
  },
  "5-30": {
    "verse": "\"Therefore do not be anxious about tomorrow, for tomorrow will be anxious for itself.\" (Matthew 6:34)",
    "text": "One of the hardest aspects of recovery is releasing your anxieties about the future. Worry can drain your energy, stealing peace from the present moment. Today, God gently invites you to let go of your fears about tomorrow and trust His faithful care for your life. Instead of allowing worry to control you, choose to focus on God's constant presence and provision in the here and now. Embrace the peace that comes from trusting in His unfailing love, knowing He will guide you safely through every tomorrow.\\n\\nMatthew 6:25-27 * Philippians 4:19 * Isaiah 41:13"
  },
  "5-31": {
    "verse": "\"Give thanks in all circumstances; for this is the will of God in Christ Jesus for you.\" (1 Thessalonians 5:18)",
    "text": "Gratitude can feel difficult during the challenging seasons of recovery, yet thankfulness has a powerful way of shifting perspective. God calls you today to practice gratitude—not just in good times, but especially amid trials. Each moment you choose thankfulness, your heart is opened to God's presence and purpose, revealing hidden blessings even in difficulty. Today, actively look for moments of grace and goodness. Thank God genuinely, even in trials, knowing He is shaping each circumstance for your ultimate good and His glory.\\n\\nPsalm 107:1 * Colossians 3:15-17 * Philippians 4:6"
  },
  "6-1": {
    "verse": "“For this is the day that the LORD has made; let us rejoice and be glad in it.” (Psalm 118:24)",
    "text": "Recovery is a journey that can feel defined by yesterday's mistakes or tomorrow's worries. Yet God gives you today as a gift—a place to begin again. Choose to rejoice, even if it's hard, knowing that each sunrise brings fresh mercy and hope. Let gratitude break through discouragement and fuel your steps forward.\\n\\nLamentations 3:22-23 • Nehemiah 9:17 • 2 Corinthians 4:16"
  },
  "6-2": {
    "verse": "“Give thanks to the LORD, for he is good, for his steadfast love endures forever.” (Psalm 107:1)",
    "text": "Recovery can heighten awareness of all you've lost, but it also magnifies God's unchanging goodness. His love never wavers, no matter how far you've strayed. Today, look for three small blessings—big or small—and thank Him for each one. As you cultivate thankfulness, your heart will anchor in His faithful character rather than in your circumstances.\\n\\n1 Chronicles 16:34 • Psalm 136:1 • Philippians 4:6"
  },
  "6-3": {
    "verse": "“For I will satisfy the weary soul, and every languishing soul I will replenish.” (Jeremiah 31:25)",
    "text": "Weariness is common in recovery, and when your soul feels drained, God offers renewal. He doesn't merely soothe your exhaustion—He replenishes you with strength, joy, and purpose. Today, bring your fatigue before Him in prayer. Allow His Spirit to revive your inner man so you can keep moving forward with fresh hope.\\n\\nIsaiah 40:28-31 • Matthew 11:28-29 • Psalm 23:3"
  },
  "6-4": {
    "verse": "“But seek first the kingdom of God and his righteousness, and all these things will be added to you.” (Matthew 6:33)",
    "text": "It's easy to chase quick fixes or temporary comfort in recovery. Jesus calls you to a higher priority: pursuing Him and His ways above all else. When you make intimacy with God your first aim—through prayer, worship, and obedience—He promises to care for your needs. Today, reorder your heart's ambitions around His kingdom, trusting He will provide everything else.\\n\\nPsalm 37:4 • Proverbs 16:3 • Philippians 4:19"
  },
  "6-5": {
    "verse": "“He gives power to the faint, and to him who has no might he increases strength.” (Isaiah 40:29)",
    "text": "Some days you may feel utterly depleted, as if you have nothing left to give. God specializes in empowering those who feel powerless. When you acknowledge your weakness and lean into Him, His strength becomes your own. Today, confess your need, then receive His supernatural enablement for every challenge ahead.\\n\\n2 Corinthians 12:9-10 • Psalm 73:26 • Ephesians 6:10"
  },
  "6-6": {
    "verse": "“Let us love one another, for love comes from God.” (1 John 4:7)",
    "text": "Recovery often highlights the brokenness of relationships—hurts given and received. Yet God's love is a healing balm. As you abide in His love, you're empowered to extend grace to others. Today, look for one person you can encourage or serve in love, reflecting the same compassion you've received from Christ.\\n\\nJohn 13:34-35 • Romans 12:10 • Galatians 6:2"
  },
  "6-7": {
    "verse": "“The steadfast love of the LORD never ceases; his mercies never come to an end.” (Lamentations 3:22)",
    "text": "No setback is too great for God's mercy to cover, and no stumble can exhaust His compassion. His faithful kindness is fresh every morning. When guilt whispers that you've gone too far, silence it with the truth of His unending love. Today, rest in His loyal care and let mercy reshape your story.\\n\\nLamentations 3:23 • Psalm 136:26 • Hebrews 4:16"
  },
  "6-8": {
    "verse": "“Wait for the LORD; be strong, and let your heart take courage; wait for the LORD!” (Psalm 27:14)",
    "text": "Recovery often tests your patience—healing takes time, and answers don't always come on your schedule. Yet waiting on God is not wasted time. He uses the pause to grow courage and deepen trust. Today, choose to stand firm in hope, reminding your heart that God is at work behind the scenes.\\n\\nIsaiah 40:31 • Lamentations 3:25-26 • Romans 8:25"
  },
  "6-9": {
    "verse": "“The righteous cry out, and the LORD hears them and delivers them out of all their troubles.” (Psalm 34:17)",
    "text": "When you feel isolated by struggle, remember God listens to every honest prayer. You don't have to carry your burdens alone—He's attentive to your voice. Today, pour out your heart in prayer, believing He not only hears, but will deliver and guide you through each hardship.\\n\\nPsalm 50:15 • Isaiah 65:24 • 2 Samuel 22:7"
  },
  "6-10": {
    "verse": "“Cast your burden on the LORD, and he will sustain you.” (Psalm 55:22)",
    "text": "Worries and regrets can weigh heavily, pulling you back into old patterns. God invites you to hand over those burdens and trust His care. When you kneel in surrender and leave each concern with Him, He becomes your support. Today, literally name one stress in prayer and release it into His hands—then rest in His promise to sustain you.\\n\\n1 Peter 5:7 • Matthew 11:28-30 • Psalm 68:19"
  },
  "6-11": {
    "verse": "“My flesh and my heart may fail, but God is the strength of my heart and my portion forever.” (Psalm 73:26)",
    "text": "Physical or emotional exhaustion can make you feel like giving up. Yet God is your unshakeable source of strength and satisfaction. When you draw close to Him, He fills the gap left by your weakness. Today, pause and invite Him to renew your heart, knowing He alone can uphold you.\\n\\nIsaiah 40:28-31 • Philippians 4:13 • 2 Corinthians 12:9"
  },
  "6-12": {
    "verse": "“Commit your work to the LORD, and your plans will be established.” (Proverbs 16:3)",
    "text": "You may be rebuilding life habits, career goals, or personal routines in recovery. Don't navigate these steps alone—entrust every plan to God. When you seek His guidance from the start, He orders your path and blesses your efforts. Today, dedicate one goal or task to Him in prayer and watch Him guide your success.\\n\\nPsalm 37:5 • James 4:13-15 • Isaiah 58:11"
  },
  "6-13": {
    "verse": "“Draw near to God, and he will draw near to you.” (James 4:8)",
    "text": "Feeling distant from God often parallels feeling alone in recovery. Yet He promises to meet you halfway when you reach for Him in honest prayer and worship. Today, take three intentional minutes to quiet your mind and speak to Him. As you draw near, you'll find the closeness and comfort your soul craves.\\n\\nHebrews 10:22 • Psalm 145:18-19 • Jeremiah 29:13"
  },
  "6-14": {
    "verse": "“In all your ways acknowledge him, and he will make straight your paths.” (Proverbs 3:6)",
    "text": "Recovery decisions can feel overwhelming—each step matters. By inviting God into every choice (big or small), you align yourself with His wisdom. Today, before acting, simply ask, “God, am I following You?” Then trust Him to lead you on a direct and peaceful road.\\n\\nPsalm 32:8 • Isaiah 30:21 • Philippians 4:6-7"
  },
  "6-15": {
    "verse": "“For we walk by faith, not by sight.” (2 Corinthians 5:7)",
    "text": "Recovery often requires stepping into the unknown, trusting God without visible guarantees. Faith doesn't eliminate fear—it empowers you to move forward despite it. Today, identify one uncertain step you need to take and move forward in faith, confident that God's unseen hand is guiding you.\\n\\nHebrews 11:1 • Psalm 37:5 • 2 Peter 1:4"
  },
  "6-16": {
    "verse": "“Restore to me the joy of your salvation, and uphold me with a willing spirit.” (Psalm 51:12)",
    "text": "Healing isn't just relief from pain—it's rediscovering the joy of new life in Christ. If your spirit feels dull, ask God to rekindle that first delight you experienced in Him. Today, pause in worship or praise, and let His joy refill your soul so that you can stand strong in His strength.\\n\\nNehemiah 8:10 • Isaiah 61:10 • Romans 15:13"
  },
  "6-17": {
    "verse": "“Praise the LORD! Oh give thanks to the LORD, for he is good, for his steadfast love endures forever!” (Psalm 106:1)",
    "text": "Expressing praise—even in hard seasons—shifts your heart from despair to hope. God's goodness remains steady, regardless of your circumstances. Today, lift your voice in worship—sing, journal, or speak aloud one reason He's worthy of praise—and watch your perspective transform.\\n\\nPsalm 100:4-5 • Hebrews 13:15 • Psalm 34:1"
  },
  "6-18": {
    "verse": "“Peace I leave with you; my peace I give to you. Not as the world gives do I give to you.” (John 14:27)",
    "text": "Temporary calm from the world fades quickly, but Christ's peace anchors your soul in every storm. When anxiety tries to overtake you, consciously turn your thoughts to Him, asking for His peace. Today, practice a five-minute breathing prayer, focusing on His promise to guard your heart and mind.\\n\\nPhilippians 4:6-7 • Colossians 3:15 • Isaiah 26:3"
  },
  "6-19": {
    "verse": "“Be still, and know that I am God.” (Psalm 46:10)",
    "text": "Recovery can feel like a relentless sprint—always striving, always reaching. God calls you to pause, be still, and acknowledge His sovereignty. In that quiet moment, you discover that He is actively at work, even when nothing seems to change. Today, take two minutes of silence, simply resting in His presence.\\n\\nExodus 14:14 • Psalm 62:5-6 • Mark 6:31"
  },
  "6-20": {
    "verse": "“He heals the brokenhearted and binds up their wounds.” (Psalm 147:3)",
    "text": "Old hurts and regrets can fester if left unattended. Yet God doesn't just forgive—He heals the core of your pain. Today, bring one painful memory before Him in prayer. Invite His gentle healing touch into that wound, trusting He will restore you from the inside out.\\n\\nJeremiah 30:17 • Isaiah 61:1 • 2 Corinthians 1:3-4"
  },
  "6-21": {
    "verse": "“I can do all things through him who strengthens me.” (Philippians 4:13)",
    "text": "When recovery feels like an uphill climb, remember that the strength you need isn't your own—it's Christ's. His power empowers your every step. Today, as you face a challenge (big or small), declare this promise aloud and move forward in His enabling grace.\\n\\nIsaiah 40:29 • 2 Corinthians 12:9-10 • Ephesians 6:10"
  },
  "6-22": {
    "verse": "“The Lord will fight for you, and you shall hold your peace.” (Exodus 14:14)",
    "text": "Battles in recovery can feel overwhelming, tempting you to try to “fix” everything yourself. Yet God promises to stand in your defense—your part is to trust and rest. Today, in any moment of conflict or anxiety, remind yourself of this promise and choose peace over striving.\\n\\n2 Chronicles 20:17 • Psalm 46:10-11 • Romans 8:31"
  },
  "6-23": {
    "verse": "“God is our refuge and strength, a very present help in trouble.” (Psalm 46:1)",
    "text": "Unexpected crises or old temptations can strike without warning. In those moments, turn to your refuge—God Himself. He's not distant or indifferent; He's your ever-present help. Today, identify one source of pressure and consciously seek His shelter through prayer, knowing He's already there waiting.\\n\\nPsalm 59:16 • Nahum 1:7 • Hebrews 13:5"
  },
  "6-24": {
    "verse": "“The joy of the LORD is your strength.” (Nehemiah 8:10)",
    "text": "Sorrow and temptation can drain you of hope, but true strength springs from divine joy. When you rejoice in what God has done and will do, He fuels your perseverance. Today, choose a song, a Scripture, or a memory that brings joy, and let it lift your spirit to stand firm.\\n\\nPsalm 16:11 • John 15:11 • Romans 15:13"
  },
  "6-25": {
    "verse": "“Fear not, for I have redeemed you; I have called you by name, you are mine.” (Isaiah 43:1)",
    "text": "Fear whispers lies about your worth and future, but God's voice is one of personal love. He calls you by name and claims you as His own. Today, when fear creeps in, speak this promise back to Him and rest in your secure identity as His beloved child.\\n\\n1 John 3:1 • Romans 8:1 • Ephesians 1:7"
  },
  "6-26": {
    "verse": "“Trust in the LORD with all your heart, and do not lean on your own understanding.” (Proverbs 3:5)",
    "text": "Your mind will question, analyze, and sometimes doubt. God calls you to a higher wisdom—total trust in Him. Today, take one area where you feel confused or anxious and deliberately hand it over to Him in prayer, choosing to trust His perfect insight over your limited perspective.\\n\\nJeremiah 17:7 • Isaiah 26:4 • Psalm 37:5"
  },
  "6-27": {
    "verse": "“Blessed are the merciful, for they shall receive mercy.” (Matthew 5:7)",
    "text": "In recovery, you've tasted God's mercy most keenly in your own need. Now He calls you to extend that same grace to others. Look for one person you can forgive, encourage, or serve today. As you show compassion, you'll experience the deep blessing of God's mercy flowing back to your own heart.\\n\\nLuke 6:36 • James 2:13 • Micah 6:8"
  },
  "6-28": {
    "verse": "“More than conquerors through him who loved us.” (Romans 8:37)",
    "text": "Recovery can feel like a series of battles, but God has already declared you victorious in Christ. You're not simply fighting to survive—you're living as an overcomer. Today, stand in that identity: no temptation or setback can define you, for you are more than a conqueror in His love.\\n\\n1 John 5:4 • Revelation 12:11 • 2 Corinthians 2:14"
  },
  "6-29": {
    "verse": "“The Lord GOD has given me the tongue of those who are taught, that I may know how to speak a word in season to him who is weary.” (Isaiah 50:4)",
    "text": "Part of recovery is encouraging others on the same journey. God equips you with timely words of comfort, insight, or truth. Today, listen for an opportunity—to text, call, or speak—to someone who's weary. Your words, empowered by His Spirit, can bring fresh strength when it's needed most.\\n\\nProverbs 25:11 • Hebrews 10:24 • Ephesians 4:29"
  },
  "6-30": {
    "verse": "“Give thanks to the LORD; call upon his name; make known his deeds among the peoples!” (Psalm 105:1)",
    "text": "As June ends, celebrate how God has carried you through another month of recovery—his faithfulness, your small victories, and His daily provision. Share one testimony with someone else or journal it, declaring His goodness aloud. In making His deeds known, you strengthen your faith and inspire others to hope in Him.\\n\\nPsalm 106:1 • Jeremiah 30:17 • Colossians 3:16"
  },
  "7-1": {
    "verse": "“Guide me in your truth and teach me, for you are God my Savior.” (Psalm 25:5)",
    "text": "In recovery, confusion and doubt can cloud your next step, making even simple choices feel overwhelming. Yet God invites you into His truth as your clear guide, illuminating every decision with wisdom. When you feel lost, ask Him to teach you—His insight never fails, even when your own understanding does. Today, lean into Scripture and prayer as your school for life, trusting that the One who saved you is more than able to lead you forward. Allow His gentle instruction to shape your heart and mind in ways that bring lasting freedom.\\n\\nPsalm 119:105 • Proverbs 3:5–6 • John 16:13"
  },
  "7-2": {
    "verse": "“Do not be conformed to this world, but be transformed by the renewal of your mind.” (Romans 12:2)",
    "text": "Recovery often demands that you break free from patterns the world encourages—patterns that promise quick fixes but leave you empty. Transformation begins within, as God renews your thinking with His perspective rather than the world's. Each time negative self-talk or old lies arise, replace them with God's truth, allowing your mind to slowly take on His character. Today, commit to memorizing or meditating on one truth from Scripture, and watch how it reshapes your attitudes, choices, and emotions. As your mind aligns with God's Word, your life will increasingly reflect His righteousness.\\n\\nColossians 3:2 • Philippians 4:8 • Ephesians 4:23–24"
  },
  "7-3": {
    "verse": "“I can do all things through him who strengthens me.” (Philippians 4:13)",
    "text": "Some days in recovery feel like insurmountable mountains, and your own strength runs dry. Yet this promise is not about your own willpower—it's about Christ's power in you. When you feel inadequate, remember that His strength makes up for every weakness and empowers you to persevere. Today, face a specific challenge—anxiety, temptation, or a difficult conversation—and declare this verse aloud. Let His empowering presence carry you through, turning obstacles into opportunities for spiritual growth. Over time, you'll look back and see how He consistently sustained you.\\n\\nIsaiah 40:29 • 2 Corinthians 12:9–10 • Ephesians 6:10"
  },
  "7-4": {
    "verse": "“But they who wait for the LORD shall renew their strength; they shall mount up with wings like eagles.” (Isaiah 40:31)",
    "text": "In the hustle of rebuilding life, waiting can feel like wasted time—especially when progress seems slow. Yet waiting on God is active trust: it's choosing to hope in His timing rather than pushing ahead in your own effort. As you patiently lean into Him—through prayer, worship, or quiet meditation—He replenishes your energy and perspective. Today, if weariness or frustration creeps in, pause and remind your soul that God is at work, unseen. His renewal equips you to soar above challenges, not by your own might, but by His sustaining grace.\\n\\nPsalm 27:14 • Lamentations 3:25–26 • Hebrews 10:23"
  },
  "7-5": {
    "verse": "“If any of you lacks wisdom, let him ask God, who gives generously to all without reproach.” (James 1:5)",
    "text": "Recovery is full of decisions—about relationships, work, even daily rhythms—and each choice shapes your future. While you may fear making mistakes, God promises generous wisdom when you ask in faith. He doesn't criticize your questions but delights to answer them, guiding you toward paths of freedom and peace. Today, identify one area where you feel uncertainty and pray specifically for clarity. Then, listen in stillness and look for signs of His gentle direction throughout your day.\\n\\nProverbs 3:5–6 • Colossians 1:9 • Jeremiah 29:11"
  },
  "7-6": {
    "verse": "“Be still, and know that I am God.” (Psalm 46:10)",
    "text": "Our instinct in recovery is often to fix, to push, and to strive—but God calls you to the radical act of stillness, where true change often begins. In silence, you acknowledge His sovereignty and allow His presence to wash over your fears and to-do lists. Today, carve out five uninterrupted minutes—no phone, no task list—just you and Him. In that space, breathe His peace into your heart and let your soul rest in the certainty that He is at work, even when you cannot see it.\\n\\nExodus 14:14 • Psalm 62:5–6 • Mark 6:31"
  },
  "7-7": {
    "verse": "“Draw near to God, and he will draw near to you.” (James 4:8)",
    "text": "Sometimes recovery can feel isolating, as if you're walking a path no one understands. Yet God promises that the moment you reach for Him—honestly, vulnerably—He moves toward you. Your nearness to Him isn't based on perfect devotional routines but on the genuine desire of your heart. Today, speak to Him in simple words or silent longing, and expect His comforting presence to draw close, filling loneliness with divine companionship. The more you seek Him, the more you'll experience His faithful nearness.\\n\\nPsalm 145:18–19 • Hebrews 10:22 • Jeremiah 29:13"
  },
  "7-8": {
    "verse": "“Cast all your anxieties on him, because he cares for you.” (1 Peter 5:7)",
    "text": "Anxiety can hijack your mind, replaying worst-case scenarios and stealing your rest. But this invitation is an act of trust—offering every worry into God's capable hands and believing that He truly cares. Today, write down three specific anxieties, then one by one pray them to Him, imagining His gentle hand lifting each burden. As you release your fears, replace them with His promises, securing your heart in His faithfulness rather than in shifting circumstances. You're not alone in your struggles; He is watching over every detail.\\n\\nPhilippians 4:6–7 • Matthew 11:28–30 • Psalm 55:22"
  },
  "7-9": {
    "verse": "“The steadfast love of the LORD never ceases; his mercies never come to an end.” (Lamentations 3:22)",
    "text": "In moments when recovery feels like a repetitive cycle of setbacks, it's easy to wonder if God's compassion will run out. Yet His love is steadfast—unchanging and unending—even when you stumble. Each morning brings fresh mercy, ready to meet you exactly where you are. Today, begin with gratitude for at least one new mercy you experienced this week: a clear thought, an encouraging word, or a restful night's sleep. Let that remembrance fuel your hope and remind you that His kindness is greater than yesterday's failures.\\n\\nPsalm 136:1–3 • Ephesians 2:4–5 • 2 Corinthians 1:3"
  },
  "7-10": {
    "verse": "“My help comes from the LORD, who made heaven and earth.” (Psalm 121:2)",
    "text": "When problems loom large, it's comforting to remember that the same Lord who set the stars in place is also available to help you with your smallest struggles. He's not an absentee deity but an ever-present helper committed to your well-being. Today, in moments of uncertainty, look upward in faith—remind yourself of His creative power and loving care. As you do, let your confidence shift from your own resources to His infinite ability to provide and protect.\\n\\nPsalm 46:1 • Isaiah 41:10 • Hebrews 13:5"
  },
  "7-11": {
    "verse": "“The LORD is my light and my salvation; whom shall I fear?” (Psalm 27:1)",
    "text": "Recovery can stir fears—fear of relapse, fear of judgment, fear of the unknown. Yet when God is your light, He dispels darkness and shows the way. When He is your salvation, He delivers you from every threat. Today, whenever anxiety presses in, speak this truth aloud: He is your light and salvation. Let that confession push fear back into the shadows and fill your heart with unshakeable courage.\\n\\nIsaiah 12:2 • John 8:12 • Romans 8:31"
  },
  "7-12": {
    "verse": "“Commit your work to the LORD, and your plans will be established.” (Proverbs 16:3)",
    "text": "Recovery isn't just personal transformation; it's rebuilding a new life on healthy foundations. When you dedicate your work—your efforts, routines, and goals—to God, He blesses and secures what you build. Today, choose one practical step—diet, exercise, budgeting, study—and pray over it, asking for His guidance. As you align your plans with His will, you'll find His favor and wisdom establishing each new habit.\\n\\nJames 4:13–15 • Psalm 90:17 • Isaiah 58:11"
  },
  "7-13": {
    "verse": "“Therefore encourage one another and build one another up.” (1 Thessalonians 5:11)",
    "text": "Recovery takes place in community, where honest words and shared stories light the path ahead. You've been encouraged by others—now you're called to pass it on. Look for someone who's struggling or simply needs affirmation, and offer a kind word or a listening ear. Your simple act of encouragement can spark hope and resilience in another's heart, and in the process, you'll find your own faith strengthened.\\n\\nHebrews 10:24 • Ephesians 4:29 • Galatians 6:2"
  },
  "7-14": {
    "verse": "“The righteous cry out, and the LORD hears them; he delivers them from all their troubles.” (Psalm 34:17)",
    "text": "In moments of pain or temptation, you might wonder if God is paying attention to your silent tears. Yet He promises to listen to the righteous—those who turn to Him in honesty. When you cry out, He hears and moves toward deliverance. Today, don't hold back your honest prayers—speak your needs, fears, and hopes to Him. Trust that He not only listens but also acts on your behalf.\\n\\nPsalm 145:18 • Isaiah 65:24 • 2 Samuel 22:7"
  },
  "7-15": {
    "verse": "“Create in me a clean heart, O God, and renew a right spirit within me.” (Psalm 51:10)",
    "text": "Guilt from past mistakes can cling tightly, hindering your forward steps. Yet God's desire is to cleanse—He longs to wash your heart and renew your spirit. Today, bring one deep guilt or shame before Him, confess it, and ask for His purifying work. As you surrender that burden, feel His forgiveness wash over you, setting you free to walk in the light of a renewed identity.\\n\\nEzekiel 36:25–27 • 1 John 1:9 • Psalm 86:11"
  },
  "7-16": {
    "verse": "“Be strong and courageous. Do not be frightened, and do not be dismayed, for the LORD your God is with you wherever you go.” (Joshua 1:9)",
    "text": "Recovery often leads you into new, uncharted territory where doubt and fear can gain a foothold. Yet God's command is clear: be brave, for He is your constant companion. Today, identify one fear—big or small—and confront it with this promise. Walk into that challenge believing God goes before you, empowering every step with His presence. Courage isn't the absence of fear, but trusting that He is greater than every threat.\\n\\nDeuteronomy 31:6 • Isaiah 41:10 • Psalm 23:4"
  },
  "7-17": {
    "verse": "“We love because he first loved us.” (1 John 4:19)",
    "text": "Freedom from addiction includes freedom to love—both receiving God's unconditional love and extending it to others. You were once trapped by shame; now you're invited into a cycle of grace. Today, reflect on how deeply God has loved you, then look for someone who needs that same compassion. A text, a call, or a simple act of kindness can become a tangible expression of His love flowing through you.\\n\\nRomans 5:8 • Ephesians 3:17–19 • John 15:12"
  },
  "7-18": {
    "verse": "“But the Lord stood by me and strengthened me.” (2 Timothy 4:17)",
    "text": "Loneliness and isolation can haunt recovery, making you feel abandoned in your struggles. Yet God's presence isn't situational; He stands by you in every moment—seen and unseen. Today, remind yourself of a past time when His strength upheld you, then reach out in prayer or praise, declaring that same truth over your current situation. His faithful companionship transforms loneliness into confidence that you will never face your battles alone.\\n\\nDeuteronomy 31:8 • Psalm 18:32 • Hebrews 13:5"
  },
  "7-19": {
    "verse": "“Let the peace of Christ rule in your hearts, to which indeed you were called in one body.” (Colossians 3:15)",
    "text": "The ups and downs of recovery can stir inner turmoil—fear, regret, or anger—pulling you into unrest. Yet Christ's peace isn't fleeting; it's a ruling presence that calms your soul and unites you with fellow believers. Today, focus on what brings His peace: a verse, a worship song, or a silent surrender in prayer. Invite that peace to govern your emotions and decisions, creating harmony within you and around you.\\n\\nPhilippians 4:6–7 • Romans 14:17 • John 14:27"
  },
  "7-20": {
    "verse": "“For nothing will be impossible with God.” (Luke 1:37)",
    "text": "Recovery goals can sometimes feel unreachable—especially when you've tried and failed before. Yet with God, no barrier is too high and no past too dark. When He is in your “what-if,” the impossible becomes possible. Today, set one bold goal—learning a new skill, rebuilding a relationship, or breaking an old habit—and take one practical step, trusting that His power can accomplish what your human effort cannot.\\n\\nMark 10:27 • Jeremiah 32:17 • Ephesians 3:20"
  },
  "7-21": {
    "verse": "“Cast all your anxieties on him, because he cares for you.” (1 Peter 5:7)",
    "text": "Anxieties may swirl around finances, health, or relationships, leaving you exhausted and fearful. Yet God's invitation stands: give those worries to Him, for He cares deeply about your well-being. Today, pick one worry, write it down, pray it to Him, and physically set it aside—symbolically leaving it at His feet. Then fill your mind with a promise from Scripture, anchoring your heart in His faithful care.\\n\\nMatthew 6:31–33 • Philippians 4:6–7 • Psalm 55:22"
  },
  "7-22": {
    "verse": "“Now may the God of peace himself sanctify you completely…” (1 Thessalonians 5:23)",
    "text": "Sanctification in recovery is a lifelong journey, not a one-time event. God, the Author of peace, invites you into His refining work—shaping your character and habits to reflect Christ. Today, ask Him to reveal one area that needs change—old patterns, attitudes, or fears—and entrust it to His sanctifying hand. His peace will guide you through the process, making each step a moment of grace and growth.\\n\\nPhilippians 1:6 • Romans 8:28 • Hebrews 13:20–21"
  },
  "7-23": {
    "verse": "“The LORD is my rock and my fortress and my deliverer.” (Psalm 18:2)",
    "text": "When life's pressures mount, you need more than a quick escape—you need a solid refuge that stands firm through every storm. God is that unmovable rock, offering safety and rescue when nothing else holds. Today, face whatever feels unstable—job worries, relationship strains, or inner battles—by anchoring your trust in Him. In His unshakeable presence, you'll find the security and perspective you need to stand strong.\\n\\nPsalm 62:6 • Nahum 1:7 • 2 Samuel 22:3"
  },
  "7-24": {
    "verse": "“Create in me a clean heart, O God, and renew a right spirit within me.” (Psalm 51:10)",
    "text": "Genuine transformation in recovery starts with a humble request for renewal—God's work in the depths of your heart rather than just surface behavior change. Today, identify one destructive thought or attitude—shame, bitterness, or self-condemnation—and ask Him to cleanse and replace it with His truth. As He purifies your inner being, you'll live out His righteousness from the heart outward.\\n\\nEzekiel 36:26–27 • Titus 3:5 • 2 Corinthians 5:17"
  },
  "7-25": {
    "verse": "“You keep him in perfect peace whose mind is stayed on you, because he trusts in you.” (Isaiah 26:3)",
    "text": "Your mental focus shapes your emotional climate—when you dwell on fear or doubt, peace feels out of reach. Yet God offers perfect peace to those who fix their thoughts on Him. Today, practice a mental reset: whenever anxiety surfaces, pause and recite a short verse or truth about God's character. As you retrain your mind toward trust, His peace will become your constant companion.\\n\\nPhilippians 4:7 • 2 Corinthians 10:5 • John 16:33"
  },
  "7-26": {
    "verse": "“Let us then with confidence draw near to the throne of grace, that we may receive mercy…” (Hebrews 4:16)",
    "text": "Shame can keep you at arm's length from God's throne, but His invitation is to approach with boldness and humility. When you enter His presence, you'll find mercy to cover failures and grace to empower every need. Today, go before Him with open hands—no pretense, no mask—knowing that in His presence, you'll receive exactly what you need for this moment.\\n\\nRomans 5:2 • Ephesians 3:12 • Micah 7:18"
  },
  "7-27": {
    "verse": "“The LORD your God is in your midst…he will rejoice over you with gladness.” (Zephaniah 3:17)",
    "text": "You may fear that past mistakes make you unworthy of celebration, but God rejoices over you—not in spite of your struggles, but because of the courage you show in walking a new path. Today, let His joy over you silence inner critics. Remember that your steps toward recovery spark delight in His heart, and allow that celebration to lift your spirit.\\n\\nIsaiah 62:5 • Luke 15:7 • Psalm 149:4"
  },
  "7-28": {
    "verse": "“Restore to me the joy of your salvation, and uphold me with a willing spirit.” (Psalm 51:12)",
    "text": "Recovery is more than sobriety; it's about rediscovering the deep joy that comes from being rescued and restored by God. If your heart feels heavy, ask Him to rekindle that initial delight you experienced in His love. Today in worship, praise, or gratitude journaling, invite His joy to flood your soul. His willingness to uphold you carries you through every dry season.\\n\\nNehemiah 8:10 • Isaiah 61:10 • Romans 15:13"
  },
  "7-29": {
    "verse": "“And he said to me, ‘My grace is sufficient for you, for my power is made perfect in weakness.'” (2 Corinthians 12:9)",
    "text": "You might bristle at weakness, seeing it as failure—but God's grace meets you where you are, transforming weakness into a stage for His power. When you admit your limitations and rely on Him, His strength shines through most brightly. Today, embrace one area of weakness—fear, weariness, or self-doubt—and ask for His grace. Then watch how His power carries you beyond your own capacity.\\n\\nIsaiah 40:29 • Psalm 73:26 • 2 Corinthians 4:7"
  },
  "7-30": {
    "verse": "“Be kind to one another, tenderhearted, forgiving one another, as God in Christ forgave you.” (Ephesians 4:32)",
    "text": "Recovery often surfaces old wounds that can harden your heart toward yourself and others. Yet God's example of tender forgiveness invites you into mercy, not judgment. Today, extend kindness—an apologetic word, a listening ear, or a simple act of care—to someone who has hurt you or whom you've hurt. As you offer grace, you mirror Christ's forgiveness and experience the freedom it brings.\\n\\nColossians 3:13 • Luke 6:36 • Matthew 5:7"
  },
  "7-31": {
    "verse": "“Jesus Christ is the same yesterday and today and forever.” (Hebrews 13:8)",
    "text": "As July ends and a new month begins, your circumstances may shift, but Christ's character remains constant—He is unchanging in love, mercy, and power. Cling to this truth today, especially if you face uncertainty about what comes next in recovery. His faithfulness yesterday assures you of His presence tomorrow. Rest in the rock-solid reality that your Savior never varies.\\n\\nPsalm 102:27 • James 1:17 • Malachi 3:6"
  },
  "8-1": {
    "verse": "“The steps of a man are established by the LORD, when he delights in his way.” (Psalm 37:23)",
    "text": "Recovery can feel like wandering when you're not sure which step to take next. Yet God promises to steady every footfall when you seek to please Him in spirit and truth. Even in moments of doubt, He is at work behind the scenes, preparing the ground and guiding your heart. Today, invite Him to order your decisions—big and small—and trust that He delights in directing your path. As you align your desires with His, you'll find confidence in each new step.\\n\\nPsalm 37:24 * Proverbs 16:9 * Isaiah 30:21"
  },
  "8-2": {
    "verse": "“Trust in the LORD with all your heart, and do not lean on your own understanding.” (Proverbs 3:5)",
    "text": "Addiction and trauma often skew our perspective, making it hard to discern right from wrong or truth from lies. God calls you to a higher wisdom—complete trust in Him rather than your own reasoning. When you surrender your need to control outcomes, you open yourself to His perfect guidance. Today, identify one area where you've been overthinking or doubting, and intentionally hand it over to Him in prayer. Watch how His peace replaces anxiety as you lean fully into His understanding.\\n\\nProverbs 3:6 * Isaiah 26:4 * Jeremiah 17:7"
  },
  "8-3": {
    "verse": "“Remember not the former things, nor consider the things of old.” (Isaiah 43:18)",
    "text": "Recovery can feel like an endless replay of past mistakes and regrets. But God doesn't want you stuck in yesterday's failures—He's doing a new thing in you right now. When you fixate on what's behind, you miss the fresh mercies unfolding each day. Today, consciously turn your gaze away from former hurts and toward the life He's crafting in you. Embrace His invitation to step into a future defined by hope, not by history.\\n\\nIsaiah 43:19 * Philippians 3:13–14 * 2 Corinthians 5:17"
  },
  "8-4": {
    "verse": "“Come to me, all who labor and are heavy laden, and I will give you rest.” (Matthew 11:28)",
    "text": "Recovery often carries the weight of shame, anxiety, and exhaustion. Jesus doesn't demand you bear that burden alone—He offers genuine rest for your soul. This rest isn't avoidance of work, but the strength to face each day without the crushing weight of guilt and fear. Today, take a deliberate moment to pause, pray, and lay your cares at His feet. Allow His gentle peace to refresh your spirit and renew your courage for the journey ahead.\\n\\nPsalm 55:22 * Hebrews 4:16 * Isaiah 40:29–31"
  },
  "8-5": {
    "verse": "“My grace is sufficient for you, for my power is made perfect in weakness.” (2 Corinthians 12:9)",
    "text": "In recovery, you may feel your weakness keenly—shame, defeat, or helplessness. Yet it is in those exact places that God's grace shines brightest. He doesn't expect you to have it all together; He offers His strength in your frailty. Today, bring a specific area of weakness before Him in honest prayer, and ask for His sufficient grace to meet you there. You'll find that His empowering presence turns your greatest vulnerabilities into avenues for His glory.\\n\\n2 Corinthians 4:7 * Isaiah 40:29 * Ephesians 6:10"
  },
  "8-6": {
    "verse": "“Taste and see that the LORD is good; blessed is the man who takes refuge in him.” (Psalm 34:8)",
    "text": "Words can describe God's goodness, but tasting and seeing require personal experience. Recovery invites you into a deeper encounter with His kindness—far beyond an intellectual belief. When you seek refuge in Him during your struggles, you'll discover how good He truly is. Today, try a simple exercise: pause each time you feel stress or temptation, and offer a quick prayer of trust. Notice how His presence infuses your spirit with reassurance and blessing.\\n\\nPsalm 107:9 * Nahum 1:7 * John 6:35"
  },
  "8-7": {
    "verse": "“Do not be anxious about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God.” (Philippians 4:6)",
    "text": "Anxiety often convinces you that taking control yourself is the only option. Yet God calls you to replace worry with prayer—turning every need, fear, and hope into a conversation with Him. When you add thanksgiving to your petitions, you acknowledge His past faithfulness and invite His present peace. Today, list three specific worries, pray them to Him one by one, and thank Him for His care. Let His peace guard your heart as you learn to trust rather than fret.\\n\\nPhilippians 4:7 * Matthew 6:25–27 * 1 Peter 5:7"
  },
  "8-8": {
    "verse": "“Above all else, guard your heart, for everything you do flows from it.” (Proverbs 4:23)",
    "text": "Recovery isn't just about changing actions—it's about protecting the spring of your motives and emotions. If your heart harbors bitterness, fear, or shame, those roots will shape your choices. God calls you to vigilance—actively watching what you allow into your mind and spirit. Today, identify one negative thought pattern or toxic influence, and replace it with Scripture or a positive affirmation. As you guard your heart, you'll notice healthier decisions naturally flow from within.\\n\\nPsalm 51:10 * Jeremiah 17:9–10 * Philippians 4:8"
  },
  "8-9": {
    "verse": "“But they who wait for the LORD shall renew their strength; they shall mount up with wings like eagles.” (Isaiah 40:31)",
    "text": "Impatience in recovery can lead to frustration, discouragement, or rash decisions. Yet God's timing is perfect, and waiting on Him is an active choice of faith. In the stillness of trust, He replenishes your spirit, so you can rise above life's pressures. Today, if you feel worn out, pause and declare this promise aloud. Ask God to renew your strength, then watch how His gentle power lifts you to new heights of hope and endurance.\\n\\nPsalm 27:14 * Lamentations 3:25–26 * 2 Corinthians 4:16–18"
  },
  "8-10": {
    "verse": "“Let us then with confidence draw near to the throne of grace, that we may receive mercy and find grace to help in time of need.” (Hebrews 4:16)",
    "text": "Guilt or shame often keeps you at arm's length from God's mercy—afraid He'll reject you. But Scripture invites you to approach His throne boldly, knowing He welcomes you with open arms. When you come weary or broken, you'll find mercy that forgives and grace that empowers you to persevere. Today, in a moment of quiet, imagine yourself before His throne and pour out your heart. Then receive His compassion and strength as your daily provision.\\n\\nRomans 5:2 * Ephesians 2:18 * Psalm 145:18"
  },
  "8-11": {
    "verse": "“God is our refuge and strength, a very present help in trouble.” (Psalm 46:1)",
    "text": "Unexpected crisis or temptation can strike without warning, leaving you feeling unprepared. Yet God isn't distant—He's a ready refuge, offering immediate strength and help. When you sense trouble closing in, turn to Him in prayer, visualizing His shelter around you. Today, memorize this promise and speak it when anxiety flares. His nearness will steady your heart and equip you to face whatever comes.\\n\\nPsalm 91:2 * Nahum 1:7 * Hebrews 13:5"
  },
  "8-12": {
    "verse": "“Do not be conformed to this world, but be transformed by the renewal of your mind.” (Romans 12:2)",
    "text": "Temptations in recovery often mirror the world's fleeting values—instant gratification, self-reliance, or comparison. Yet God offers a better way: a mind transformed by His truth. When you fill your thoughts with Scripture and God-honoring reflection, you reshape your attitudes and actions. Today, set aside ten minutes to read a chapter of God's Word slowly, pausing to reflect on one truth that stands out. Let it sink deep, guiding your responses throughout the day.\\n\\nColossians 3:16 * Philippians 4:8 * Ephesians 4:23–24"
  },
  "8-13": {
    "verse": "“Count it all joy, my brothers, when you meet trials of various kinds.” (James 1:2)",
    "text": "Trials in recovery can feel discouraging, but God calls you to an unexpected response: joy. This isn't superficial optimism but a deep confidence that God uses hardship to produce perseverance, character, and hope. When you embrace challenges as refining fire, you shift from victim to victor. Today, pick one difficulty you're facing and ask, “What is God teaching me through this?” Then thank Him for the growth He's working in you.\\n\\nRomans 5:3–4 * 1 Peter 1:6–7 * Hebrews 12:11"
  },
  "8-14": {
    "verse": "“Peace I leave with you; my peace I give to you. Not as the world gives do I give to you.” (John 14:27)",
    "text": "Worldly peace is fragile—dependent on circumstances and often short-lived. Jesus offers a deeper peace that roots your soul in His presence, regardless of outer chaos. When anxiety or stress tries to claim you, invite His peace to guard your heart and mind. Today, practice a short breathing prayer: inhale His promise of peace, exhale your tension in trust. Let His enduring calm rule over every storm within.\\n\\nPhilippians 4:6–7 * Colossians 3:15 * Isaiah 26:3"
  },
  "8-15": {
    "verse": "“For we are his workmanship, created in Christ Jesus for good works, which God prepared beforehand.” (Ephesians 2:10)",
    "text": "It's easy to feel unworthy or purposeless after addiction's damage, but God sees you differently. You are His masterpiece, crafted with intention for a life of meaningful service. Every past trial equips you to bless others in unique ways. Today, reflect on one gift or skill God has given you, then use it to help someone in need. As you partner in God's good works, you'll discover fresh purpose and joy.\\n\\nJeremiah 29:11 * 2 Timothy 1:9 * Philippians 2:13"
  },
  "8-16": {
    "verse": "“I have stored up your word in my heart, that I might not sin against you.” (Psalm 119:11)",
    "text": "Recovery isn't merely a battle of actions but a war in the mind. By hiding Scripture in your heart, you build a strong defense against temptation and discouragement. When an old habit or negative thought resurfaces, a well-placed verse springs to mind and redirects your steps. Today, choose one verse to memorize or journal, then recite it whenever you face a challenge. Over time, God's truth will become your automatic response.\\n\\nPsalm 19:8 * Proverbs 6:23 * 2 Timothy 3:16–17"
  },
  "8-17": {
    "verse": "“For I know the plans I have for you, declares the LORD, plans for welfare and not for evil, to give you a future and a hope.” (Jeremiah 29:11)",
    "text": "Recovery can cloud your vision of tomorrow, making the future seem uncertain or scary. Yet God's plans for you are rooted in blessing, not harm—designed to bring hope and growth. When doubt creeps in, remind yourself that He is the faithful Author of your story. Today, in prayer, ask Him to reveal one step of His plan for this week. Step out in faith, trusting His good purposes to unfold in your life.\\n\\nRomans 8:28 * Proverbs 16:9 * Isaiah 55:8–9"
  },
  "8-18": {
    "verse": "“ Set your minds on things that are above, not on things that are on earth.” (Colossians 3:2)",
    "text": "Worldly distractions and regrets can pull your thoughts downward, breeding anxiety or self-pity. God calls you to lift your mind toward His eternal perspective—where your identity, hope, and purpose are secure in Christ. As you focus on His promises and character, earthly pressures lose their grip. Today, whenever a negative thought arises, counter it with a truth from Scripture about your position in Christ. Let your renewed mind transform your heart and actions.\\n\\nRomans 12:2 * Philippians 4:8 * Ephesians 4:23–24"
  },
  "8-19": {
    "verse": "“He has told you, O man, what is good; and what does the LORD require of you but to do justice, and to love kindness, and to walk humbly with your God?” (Micah 6:8)",
    "text": "Recovery reshapes not only your habits but your character. God's requirements are simple yet profound: act with justice, love mercy, and walk humbly with Him. Today, evaluate one area of your life—work, relationships, or personal ambition—and ask, “How can I reflect these qualities here?” Then take one concrete step: speak up for fairness, offer unexpected kindness, or practice humility in speech. Your obedience glorifies God and transforms your world.\\n\\nMatthew 5:7 * James 2:8–9 * Philippians 2:3"
  },
  "8-20": {
    "verse": "“Therefore do not be anxious about tomorrow, for tomorrow will be anxious for itself. Sufficient for the day is its own trouble.” (Matthew 6:34)",
    "text": "It's tempting in recovery to fixate on what might go wrong next—fueling endless worry and preventing you from living fully today. Yet Jesus redirects your focus to the present, where His grace meets your current needs. Today, when “what if” questions arise, gently remind yourself that tomorrow's challenges are not your responsibility now. Center your heart on the gifts, opportunities, and growth available in this moment, trusting that He will equip you tomorrow, too.\\n\\nPhilippians 4:6–7 * Psalm 118:24 * Lamentations 3:23"
  },
  "8-21": {
    "verse": "“I will never leave you nor forsake you.” (Hebrews 13:5)",
    "text": "Loneliness can accompany recovery, especially when old friendships fade and new ones take time to build. Yet God's promise is unbreakable: He is with you at every step—even in the quiet hours. When you feel abandoned, claim this truth and invite His presence to fill that void. Today, speak this promise in prayer and meditate on times He proved faithful. Let the reality of His constancy banish fear and produce confidence in your journey.\\n\\nDeuteronomy 31:6 * Joshua 1:9 * Psalm 139:7–10"
  },
  "8-22": {
    "verse": "“Cast all your anxieties on him, because he cares for you.” (1 Peter 5:7)",
    "text": "Burdening yourself with worries—about health, finances, or relapse—only deepens stress and fatigue. God invites you to unload each concern onto Him, because He truly cares for every detail of your life. Today, write down three anxieties, then one by one present them to Him in prayer. As you transfer each worry into His hands, replace it with a promise from His Word and rest in His care.\\n\\nPsalm 55:22 * Philippians 4:6–7 * Matthew 11:28–30"
  },
  "8-23": {
    "verse": "“Even though I walk through the valley of the shadow of death, I will fear no evil, for you are with me.” (Psalm 23:4)",
    "text": "Recovery valleys—dark seasons of temptation, shame, or grief—can feel like walking through death itself. Yet in those shadows, the Shepherd's presence transforms fear into comfort. He guides your steps, provides courage, and prepares you for the next green pastures. Today, if you face a difficult valley, affirm His nearness with each breath: “You are with me.” Let His rod and staff lead you toward healing and hope.\\n\\nJohn 10:28–29 * Isaiah 43:2 * Romans 8:38–39"
  },
  "8-24": {
    "verse": "“Do not be deceived: God is not mocked, for whatever one sows, that will he also reap.” (Galatians 6:7)",
    "text": "In recovery, you may wish past wrongs could be erased without consequences—or that good habits yield immediate reward. Yet God's law of sowing and reaping reminds you that every choice matters. Today, evaluate one habit or attitude you've been tolerating, and decide to sow kindness, truth, or self-discipline in its place. As you invest in godly seeds, trust that His timing will bring a harvest of righteousness and peace.\\n\\nHosea 10:12 * 2 Corinthians 9:6 * Proverbs 11:18"
  },
  "8-25": {
    "verse": "“The LORD is good to all, and his mercy is over all that he has made.” (Psalm 145:9)",
    "text": "You might feel unworthy of God's kindness after seasons of failure, but His mercy extends to every corner of creation—including your broken heart. His goodness isn't earned; it's freely given to all who turn to Him. Today, receive His mercy by simply saying, “Thank You,” and then look for ways to reflect that same kindness to someone around you. In both receiving and giving, you'll experience the vastness of His loving care.\\n\\nLamentations 3:22–23 * Ephesians 2:4–5 * Titus 3:5"
  },
  "8-26": {
    "verse": "“A new heart I will give you, and a new spirit I will put within you.” (Ezekiel 36:26)",
    "text": "Recovery isn't just about stopping old behaviors—it's about embracing the new identity God offers. He doesn't simply patch up your old heart; He gives you a fresh, vibrant spirit empowered by His presence. Today, invite Him to replace any hardness, cynicism, or fear in your heart with His compassion, optimism, and courage. As you walk in that newness of life, you'll reflect His transforming work in every word and action.\\n\\n2 Corinthians 5:17 * Romans 6:4 * Revelation 21:5"
  },
  "8-27": {
    "verse": "“You keep him in perfect peace whose mind is stayed on you, because he trusts in you.” (Isaiah 26:3)",
    "text": "Your inner peace hinges on where you fix your thoughts. When worries multiply, turn your mental gaze to God's character—His faithfulness, power, and love. As your trust anchors in Him, perfect peace fills the spaces anxiety once claimed. Today, practice a mental reset: whenever fear arises, recite a short phrase about God's goodness. Let that truth dwell richly in you and calm your heart.\\n\\nPhilippians 4:7 * John 14:27 * Psalm 119:165"
  },
  "8-28": {
    "verse": "“Therefore encourage one another and build one another up, just as you are doing.” (1 Thessalonians 5:11)",
    "text": "Recovery shines brightest in community, where shared stories and honest hearts lift each other forward. Your testimony of God's faithfulness can be the light someone else desperately needs. Today, reach out to a friend in recovery—offer a call, a text, or a coffee—and speak words of affirmation and hope. As you build them up, you'll find your own faith strengthened by the joy of mutual encouragement.\\n\\nHebrews 10:24 * Ephesians 4:29 * Galatians 6:2"
  },
  "8-29": {
    "verse": "“Fear not, for I have redeemed you; I have called you by name, you are mine.” (Isaiah 43:1)",
    "text": "Fear of rejection or failure often stalks those rebuilding their lives. Yet God's words are a powerful antidote: you are redeemed, personally known, and fiercely loved. When doubt whispers that you're unworthy, speak this promise aloud and feel His protective embrace. Today, let your identity rest in His ownership rather than in your past, confident that you belong to Him forever.\\n\\nRomans 8:1 * 1 John 3:1 * Ephesians 1:7"
  },
  "8-30": {
    "verse": "“He who began a good work in you will bring it to completion at the day of Jesus Christ.” (Philippians 1:6)",
    "text": "Recovery can feel like an uphill climb with no finish line in sight, but God assures you that His work in your life isn't unfinished. He started a beautiful transformation when you first turned to Him, and He will faithfully complete it. Today, reflect on how far you've come—small victories, shifting attitudes, renewed hope—and thank Him for His ongoing work. Let that assurance carry you confidently into tomorrow.\\n\\nHebrews 10:23 * 1 Thessalonians 5:24 * Psalm 138:8"
  },
  "8-31": {
    "verse": "“Behold, I make all things new.” (Revelation 21:5)",
    "text": "As August closes, celebrate the fresh starts God has given you each day—moments of healing, breakthroughs, and grace. His promise to make all things new isn't limited to the future; it's active in your life now. Today, look back over this month and notice the areas where His renewal shone brightest. Then step into September expecting more of His transformative work, sure that with Him, every ending is a fresh beginning.\\n\\n2 Corinthians 5:17 * Ezekiel 36:26 * Lamentations 3:22–23"
  },
  "9-1": {
    "verse": "“Teach me your way, O LORD, that I may walk in your truth.” (Psalm 86:11)",
    "text": "Recovery can leave you wondering which path to take next, but God's Word lights each step when you ask Him to guide you. Today, invite Him to teach you through Scripture and prayer, trusting that His truth will shape your choices. As you walk in His ways, you'll find alignment between your heart and His plan. Even when old habits call you back, Scripture will remind you of the life He's leading you into. Lean in, and let His wisdom transform your steps.\\n\\nPsalm 119:105 * Proverbs 3:5–6 * John 8:31–32"
  },
  "9-2": {
    "verse": "“Cast your burden on the LORD, and he will sustain you.” (Psalm 55:22)",
    "text": "Worries from yesterday can weigh heavily, tempting you to self-reliance. Yet God invites you to hand every care over to Him, confident He will uphold you. Today, list two anxieties on paper, then pray them to Him one by one, watching His sustaining love replace your concerns with peace. As you practice this, you train your heart to depend on His strength rather than your own. In time, His faithfulness will transform anxious patterns into habits of trust.\\n\\n1 Peter 5:7 * Matthew 11:28–30 * Psalm 68:19"
  },
  "9-3": {
    "verse": "“My flesh and my heart may fail, but God is the strength of my heart.” (Psalm 73:26)",
    "text": "Physical exhaustion or emotional fatigue can make recovery feel impossible. Yet when your own reserves run dry, God steps in as your unfailing strength. Today, pause in honest prayer and ask Him to renew your heart and spirit. Notice how His gentle power fills every weakness, equipping you to persevere one moment at a time. His strength isn't just for grand victories—it's for each breath and each choice you face.\\n\\nIsaiah 40:29–31 * 2 Corinthians 12:9–10 * Ephesians 6:10"
  },
  "9-4": {
    "verse": "“Be still before the LORD and wait patiently for him.” (Psalm 37:7)",
    "text": "It's tempting in recovery to rush, to force results. Yet God works most deeply when we slow down and wait on Him. Today, carve out five minutes of true stillness—no tasks, no distractions—just you and your Savior. In that quiet, let Him speak, restore your soul, and cultivate patience. You'll discover that waiting isn't wasted time but the soil where faith and character grow.\\n\\nExodus 14:14 * Lamentations 3:25–26 * Isaiah 30:18"
  },
  "9-5": {
    "verse": "“Search me, O God, and know my heart!” (Psalm 139:23)",
    "text": "Honest self-examination can be painful, but it's essential for lasting change. Invite God to shine His light on hidden motives or stubborn wounds, trusting in His loving correction rather than condemnation. Today, journal one area where you need His refining touch. Then ask for His insight and grace to heal it. As you partner with the Holy Spirit in this process, you'll experience freedom that only truth can bring.\\n\\nPsalm 51:10 * Hebrews 4:12 * John 16:8–9"
  },
  "9-6": {
    "verse": "“ Therefore encourage one another and build one another up.” (1 Thessalonians 5:11)",
    "text": "Recovery flourishes in community, where shared burdens become lighter through mutual support. Seek out a brother or sister in the journey today and offer words of hope or a simple act of kindness. Your encouragement reflects Christ's love and can spark courage in someone's heart. In turn, you'll be built up by their presence and testimony. Together, you'll weave a tapestry of grace that sustains each one.\\n\\nHebrews 10:24–25 * Ephesians 4:29 * Galatians 6:2"
  },
  "9-7": {
    "verse": "“ The steadfast love of the LORD never ceases; his mercies never come to an end.” (Lamentations 3:22)",
    "text": "If you've stumbled repeatedly, you might feel like mercy has run dry. Yet Scripture declares God's compassion is renewed every morning. Today, reflect on one fresh mercy you experienced this week—a moment of clarity, a kind word, a quiet rest—and thank Him for it. Let that remembrance fuel your hope, reminding you that His loyalty outlasts every failure. You are held by a love that never quits.\\n\\nPsalm 136:26 * Hebrews 4:16 * Ephesians 2:4–5"
  },
  "9-8": {
    "verse": "“Trust in the LORD with all your heart.” (Proverbs 3:5)",
    "text": "Recovery often challenges your trust—can you really lean on God when fear whispers otherwise? He calls you to release control of every situation into His capable hands. Today, choose one worry—big or small—and consciously hand it to Him with a prayer of trust. Notice how even that single act unburdens your soul and opens space for His peace. Over time, those small steps build a habit of wholehearted reliance on His faithfulness.\\n\\nJeremiah 17:7 * Psalm 37:5 * Isaiah 26:4"
  },
  "9-9": {
    "verse": "“ Delight yourself in the LORD, and he will give you the desires of your heart.” (Psalm 37:4)",
    "text": "You might be tempted to chase fleeting pleasures or quick solutions in recovery, but God offers deeper satisfaction. As you prioritize delighting in His presence through worship, prayer, or Scripture, He reshapes your desires to match His good purposes. Today, spend intentional time celebrating His character—sing, journal, or reflect on His attributes. Watch as your heart's longings realign with His will, bringing true contentment.\\n\\nPsalm 16:11 * John 15:9–11 * Romans 12:2"
  },
  "9-10": {
    "verse": "“Commit your work to the LORD, and your plans will be established.” (Proverbs 16:3)",
    "text": "Building new routines and goals in recovery can feel daunting. Instead of relying on your own strategy, dedicate every plan to God first in prayer. When He is at the helm, your efforts gain divine blessing and direction. Today, before you tackle a key task—work, study, or self-care—pause and ask for His guidance. Then move forward confidently, knowing He's invested in the success of your steps.\\n\\nPsalm 37:5 * James 4:13–15 * Isaiah 58:11"
  },
  "9-11": {
    "verse": "“Cast all your anxieties on him, because he cares for you.” (1 Peter 5:7)",
    "text": "It's easy to internalize worries about health, finances, or relationships, letting them weigh heavily on your mind. But God not only hears your concerns—He cares deeply about each one. Today, pick one persistent anxiety, name it in prayer, and imagine handing it to Him like a tangible gift. As you do, consciously rest in His promise to carry you through. His heart beats with compassion for every detail of your life.\\n\\nMatthew 6:25–27 * Philippians 4:6–7 * Psalm 55:22"
  },
  "9-12": {
    "verse": "“ The LORD is my rock and my fortress.” (Psalm 18:2)",
    "text": "In storms of temptation or discouragement, you need more than shifting sand—you need a solid foundation. God stands as your unshakeable rock and strong fortress, offering safety and security. Today, when fear or doubt knocks, mentally retreat into His protective presence. Remind yourself that no attack can topple the One who stands firm for you. His steadfast character endures every storm.\\n\\nPsalm 62:6 * Nahum 1:7 * 2 Samuel 22:3"
  },
  "9-13": {
    "verse": "“Create in me a clean heart, O God.” (Psalm 51:10)",
    "text": "Guilt from past mistakes can cling like stubborn stains, hindering forward progress. God invites you into His cleansing presence—He wants to renew your heart from the inside out. Today, identify one recurring guilty thought and confess it in prayer, asking for His purifying grace. As you cooperate with His work in you, you'll experience a freshness of spirit that empowers new growth.\\n\\nEzekiel 36:25–27 * 1 John 1:9 * Psalm 86:11"
  },
  "9-14": {
    "verse": "“Be still, and know that I am God.” (Psalm 46:10)",
    "text": "When life's demands pull you in every direction, God calls you to the counterintuitive practice of stillness. In those quiet moments—free of tasks and noise—you acknowledge His sovereignty and find rest for your soul. Today, pause mid-day for even two minutes of silence: breathe deeply, fix your thoughts on Him, and let His peace settle in. You'll discover that in stillness, true strength and clarity emerge.\\n\\nExodus 14:14 * Psalm 62:5–6 * Mark 6:31"
  },
  "9-15": {
    "verse": "“My grace is sufficient for you, for my power is made perfect in weakness.” (2 Corinthians 12:9)",
    "text": "You may recoil at weakness, equating it with failure, but God's perspective is different. He delights in displaying His power where you feel least capable. Today, bring an area of struggle—fear, temptation, or weariness—before Him in honest prayer. Then rest in His promise to meet you there with sufficient grace. His strength will carry you, turning vulnerability into a canvas for His glory.\\n\\n2 Corinthians 4:7 * Isaiah 40:29 * Ephesians 6:10"
  },
  "9-16": {
    "verse": "“Seek first the kingdom of God and his righteousness.” (Matthew 6:33)",
    "text": "It's tempting to prioritize recovery goals, work, or personal comfort above all else. Yet Jesus calls you to reorder your priorities—place His kingdom and righteousness first, trusting Him to supply your needs. Today, begin with worship, prayer, or Scripture before your morning routine. As you seek Him first, notice how your daily tasks gain new meaning and His provision emerges in unexpected ways.\\n\\nPsalm 37:4 * Proverbs 8:17 * Philippians 4:19"
  },
  "9-17": {
    "verse": "“The LORD is good to all, and his mercy is over all that he has made.” (Psalm 145:9)",
    "text": "On days you feel unworthy of kindness, remember God's mercy extends to every living being without partiality. His goodness isn't based on your performance but on His gracious character. Today, receive His mercy by offering yourself forgiveness and a fresh start. Then, look for someone else who needs compassion and extend it freely, mirroring the boundless kindness you've received.\\n\\nLamentations 3:22–23 * Ephesians 2:4–5 * Titus 3:5"
  },
  "9-18": {
    "verse": "“Do not be anxious about tomorrow.” (Matthew 6:34)",
    "text": "Anxiety about the future can steal today's peace, making recovery feel like a perilous unknown. Jesus assures you that each day has enough to deal with—His grace is tailored to today's needs. When worry tugs at your mind, gently redirect your thoughts to what you can do right now and trust Him with tomorrow. Practicing this daily resets your heart to His rhythm, releasing you from unproductive fear.\\n\\nPhilippians 4:6–7 * Psalm 118:24 * Lamentations 3:26"
  },
  "9-19": {
    "verse": "“The LORD will fight for you, and you have only to be silent.” (Exodus 14:14)",
    "text": "When you feel besieged by circumstances or old habits, it's tempting to wrestle control back yourself. Yet God's invitation is to step back and let Him work on your behalf. Today, when conflict arises—internally or externally—pause, pray, and declare this promise. Then rest in His ability to champion your cause, freeing you to trust rather than strive.\\n\\n2 Chronicles 20:17 * Isaiah 45:24 * Romans 8:31"
  },
  "9-20": {
    "verse": "“ Draw near to God, and he will draw near to you.” (James 4:8)",
    "text": "Recovery can foster a sense of distance from God, but He's always reaching out to you. When you take steps toward Him—through honest prayer, worship music, or Scripture—He meets you with an embrace of grace. Today, spend 5 minutes in a focused prayer of intimacy, sharing your heart's cry and listening for His gentle whisper. As you draw near, His presence becomes a wellspring of strength and comfort.\\n\\nPsalm 145:18–19 * Hebrews 10:22 * Jeremiah 29:13"
  },
  "9-21": {
    "verse": "“The righteous cry out, and the LORD hears them.” (Psalm 34:17)",
    "text": "In moments of isolation or despair, you might wonder if God is listening. He's attentive to the honest prayers of those seeking Him. When you cry out—whether in joy, pain, or need—He moves toward you with deliverance. Today, offer a raw, unfiltered prayer about what weighs on your heart. Trust that He not only hears but will act in His perfect timing.\\n\\nPsalm 50:15 * 2 Samuel 22:7 * Isaiah 65:24"
  },
  "9-22": {
    "verse": "“In your presence there is fullness of joy.” (Psalm 16:11)",
    "text": "Temporary pleasures can fade quickly, but true joy overflows when you dwell in God's presence. Recovery invites you beyond relief into the richness of His nearness. Today, choose an activity—worship, journaling, or a nature walk—where you intentionally focus on God rather than on outcomes. As you bask in His presence, allow joy to refill every corner of your soul.\\n\\nNehemiah 8:10 * John 15:11 * Philippians 4:4"
  },
  "9-23": {
    "verse": "“How precious is your steadfast love, O God!” (Psalm 36:7)",
    "text": "When you've experienced rejection or failure, it can be hard to believe in unconditional love. Yet God's steadfast affection remains unwavering, even on your darkest days. Today, pause and reflect on a time He showed you kindness when you least expected it. Let that memory remind you that His love is your constant foundation—unshakable and life-giving.\\n\\nRomans 5:8 * Ephesians 2:4–5 * Lamentations 3:22–23"
  },
  "9-24": {
    "verse": "“Commit your way to the LORD; trust in him, and he will act.” (Psalm 37:5)",
    "text": "It's tempting to micromanage your recovery—planning every detail in your own strength. Yet God invites you to surrender your plans to Him, trusting He will move on your behalf. Today, identify one specific goal or worry, speak it to Him in prayer, and then step back in faith. Watch how He orchestrates circumstances, often in ways more creative than you could imagine.\\n\\nProverbs 16:3 * Romans 8:28 * Isaiah 46:10"
  },
  "9-25": {
    "verse": "“Let the peace of Christ rule in your hearts.” (Colossians 3:15)",
    "text": "Stress and second-guessing can create inner turmoil, but Christ's peace doesn't depend on outward calm. When you invite His reign over your emotions, it settles every unresting thought. Today, when you notice tension rising, pause and whisper His promise, “Peace, be still.” Allow His quiet confidence to dismantle worry and guide your reactions.\\n\\nPhilippians 4:7 * John 14:27 * Isaiah 26:3"
  },
  "9-26": {
    "verse": "“Give thanks in all circumstances.” (1 Thessalonians 5:18)",
    "text": "Gratitude isn't just for the good times—it's a powerful act of faith in any season. When you thank God amid trials, you acknowledge His sovereignty and open your heart to His presence. Today, write down three things you're thankful for right now—no matter how small. As you praise Him, you'll find your perspective shifting from lack to abundance.\\n\\nPsalm 107:1 * Colossians 3:15 * Philippians 4:6"
  },
  "9-27": {
    "verse": "“For nothing will be impossible with God.” (Luke 1:37)",
    "text": "Recovery goals can feel daunting, and past failures may whisper lies of defeat. Yet God delights in turning impossibilities into testaments of His grace. Today, identify one “impossible” challenge you face and bring it before His throne in prayer. Then act on one step of faith, trusting His power to accomplish what you cannot. You'll witness His mighty hand at work.\\n\\nMark 10:27 * Jeremiah 32:17 * Ephesians 3:20"
  },
  "9-28": {
    "verse": "“Feed my sheep.” (John 21:17)",
    "text": "Part of your growth in recovery is caring for others—sharing your journey's lessons and building community. When you speak encouragement or practical help into someone's life, you reflect Jesus' heart for restoration. Today, reach out to a peer or friend—offer a listening ear, a word of hope, or a simple act of service. In feeding others, your own faith and compassion will deepen.\\n\\nGalatians 6:2 * 1 Peter 4:10 * Hebrews 13:16"
  },
  "9-29": {
    "verse": "“ The LORD is near to the brokenhearted.” (Psalm 34:18)",
    "text": "Brokenness can isolate you in recovery, making you feel unworthy of love. Yet God draws especially close to those whose hearts are crushed. Today, bring your sorrow into prayer—let Him hold every tear—and listen for His comforting whisper. His nearness heals what no one else can touch, restoring hope where despair once ruled.\\n\\nIsaiah 57:15 * Matthew 5:4 * 2 Corinthians 1:3–4"
  },
  "9-30": {
    "verse": "“Jesus Christ is the same yesterday and today and forever.” (Hebrews 13:8)",
    "text": "As September closes, celebrate the unchanging character of Christ—His love, mercy, and faithfulness endure through every season of your journey. When facing uncertainty, anchor your soul in the constancy of His nature. Today, reflect on how He carried you through each day this month and thank Him for His unwavering presence. Step into October confident in His eternal grace.\\n\\nPsalm 102:27 * James 1:17 * Malachi 3:6"
  },
  "10-1": {
    "verse": "“Teach me, O LORD, the way of your statutes; and I will keep it to the end.” (Psalm 119:33)",
    "text": "Recovery isn't just breaking old habits—it's learning God's ways and living them day by day. When confusion or temptation arises, His statutes become your roadmap, showing you the next right step. Today, ask Him to teach you through Scripture and prayer, then trust His direction even when the path seems unclear. As you commit to obeying His guidance, you'll find strength to persevere where you once stumbled. His faithful instruction will sustain you through every challenge.\\n\\nPsalm 119:11 • Proverbs 3:5–6 • John 14:26"
  },
  "10-2": {
    "verse": "“The LORD is good to those who wait for him, to the soul that seeks him.” (Lamentations 3:25)",
    "text": "Waiting in recovery can feel like lost time—but God uses every moment to deepen your trust and maturity. As you seek Him earnestly—through worship, silence, or meditating on His promises—you align your heart with His, discovering His goodness firsthand. Today, embrace waiting as sacred space, confident that God's timing is perfect. Your seeking pleases Him and cultivates patience that will carry you through future storms. In His goodness, every delay becomes an invitation to deeper faith.\\n\\nPsalm 27:14 • Isaiah 40:31 • Hebrews 10:36"
  },
  "10-3": {
    "verse": "“Blessed are the pure in heart, for they shall see God.” (Matthew 5:8)",
    "text": "Recovering from addiction often means confronting hidden impurities—old resentments, secret fears, or self-condemnation. Jesus calls you to purity of heart, which begins as you confess and relinquish every impure thought. Today, ask Him to refine your motives and cleanse your inner life. As He purifies your heart, you'll experience new clarity and closeness with Him. The reward for true purity is not perfection, but the sweet privilege of seeing God's presence in every circumstance.\\n\\nPsalm 51:10 • James 4:8 • 1 John 3:3"
  },
  "10-4": {
    "verse": "“He leads me beside still waters; he restores my soul.” (Psalm 23:2–3)",
    "text": "Recovery can feel like trudging through turbulent currents, but Jesus offers restful streams where your spirit can recover. When anxiety or exhaustion threaten, pause and picture Him guiding you to those quiet waters. In His presence, He soothes your fears and renews your strength. Today, carve out a moment of true rest—no distractions—simply abiding under His care. As He restores your soul, you'll discover renewed hope for every step ahead.\\n\\nPsalm 62:1 • Isaiah 30:15 • Matthew 11:28–29"
  },
  "10-5": {
    "verse": "“Give thanks in all circumstances; for this is the will of God in Christ Jesus for you.” (1 Thessalonians 5:18)",
    "text": "Gratitude is more powerful than we often realize—it rewires your perspective from lack to abundance. In recovery, you may face hardship, but choosing thankfulness—even for small mercies—invites God's presence into every situation. Today, list three things you're grateful for that you'd normally overlook: a kind word, a moment of clarity, or simply waking up. Thank Him sincerely and watch how your heart shifts from complaint to joy. Gratitude becomes a spiritual anchor, grounding you in His goodness.\\n\\nPsalm 107:1 • Colossians 3:15 • Philippians 4:6–7"
  },
  "10-6": {
    "verse": "“Draw near to God, and he will draw near to you.” (James 4:8)",
    "text": "Loneliness or discouragement can tempt you to isolate, but God's promise is clear—He meets you when you take steps toward Him. Whether through prayer, worship, or Scripture, every act of reaching out pulls His heart closer to yours. Today, carve out a few intentional minutes to speak honestly with Him and then listen in silence. In that mutual drawing near, you'll find the companionship and encouragement that recovery so desperately needs. His presence dispels isolation and fills you with strength.\\n\\nPsalm 145:18 • Hebrews 10:22 • Jeremiah 29:13"
  },
  "10-7": {
    "verse": "“Cast all your anxiety on him, because he cares for you.” (1 Peter 5:7)",
    "text": "Anxiety often tells you that you're alone in carrying your fears, but God invites you to hand every worry to Him—He truly cares about every detail. Today, write down two anxieties that have been weighing on you, then pray them to Him, imagining each one placed into His capable hands. As you release control, replace each worry with a truth from Scripture. You'll discover that surrendering your concerns frees your heart to rest in His faithful care. His love proves stronger than every anxious thought.\\n\\nMatthew 6:25–27 • Philippians 4:6–7 • Psalm 55:22"
  },
  "10-8": {
    "verse": "“Be still, and know that I am God.” (Psalm 46:10)",
    "text": "Our instinct is often to fix problems ourselves, but God calls you into the discipline of stillness—where He does His deepest work. In the midst of recovery's demands, find a quiet space, shut out distractions, and simply acknowledge His sovereignty. Today, pause for two minutes, breathe prayerfully, and focus wholly on His presence. In that silence, He will speak peace into your chaos and guide your next steps. Stillness is not inactivity but a powerful act of faith.\\n\\nExodus 14:14 • Psalm 62:5–6 • Mark 6:31"
  },
  "10-9": {
    "verse": "“Commit your work to the LORD, and your plans will be established.” (Proverbs 16:3)",
    "text": "Recovery involves rebuilding routines and goals—healthy habits that can feel daunting when faced alone. Instead of relying on your own strength, dedicate every effort to God first. Today, choose one project or habit you're trying to establish—sober living, career steps, or personal growth—and commit it to Him in prayer. Trust that as you align your plans with His will, He will bless and secure your efforts. His partnership makes your work fruitful and enduring.\\n\\nPsalm 37:5 • James 4:13–15 • Isaiah 58:11"
  },
  "10-10": {
    "verse": "“Whoever sows sparingly will also reap sparingly, and whoever sows bountifully will also reap bountifully.” (2 Corinthians 9:6)",
    "text": "Recovery teaches that what you invest—time, honesty, prayer—shapes what you harvest in life. If you withhold your vulnerability or generosity, you'll find your growth limited. Today, choose to sow bountifully: share your story with someone, serve in your community, or invest extra time in spiritual disciplines. As you sow seeds of grace and truth, you'll reap a harvest of strength, peace, and deeper relationships. God multiplies even the smallest act of faithfulness.\\n\\nGalatians 6:7–9 • Luke 6:38 • Proverbs 11:24"
  },
  "10-11": {
    "verse": "“The Lord is my rock and my fortress and my deliverer.” (Psalm 18:2)",
    "text": "In moments of intense temptation or crisis, you need more than quick fixes—you need an unshakeable refuge. God offers Himself as that solid foundation, protecting and delivering you from every assault. Today, when you feel vulnerable, recite this truth and picture yourself safe in His fortress. Let that imagery strengthen your resolve and guide your next choice. His steadfast presence endures every storm.\\n\\nPsalm 62:6 • Nahum 1:7 • 2 Samuel 22:3"
  },
  "10-12": {
    "verse": "“The LORD is gracious and merciful, slow to anger and abounding in steadfast love.” (Psalm 145:8)",
    "text": "You may fear God's judgment for past failures, but Scripture reveals His heart overflowing with grace and patience. He doesn't respond to your mistakes with anger but with steadfast love that pursues restoration. Today, approach Him in prayer, not as a condemning judge, but as a compassionate Father. Receive His mercy for your past and His encouragement for your future. His loving kindness never runs dry.\\n\\nLamentations 3:22–23 • Exodus 34:6 • Micah 7:18"
  },
  "10-13": {
    "verse": "“Create in me a clean heart, O God, and renew a right spirit within me.” (Psalm 51:10)",
    "text": "Genuine change in recovery begins at the level of the heart—God desires to cleanse and renew you from the inside out. When you confess hidden sins and unhealthy attitudes, He responds with forgiveness and transformation. Today, identify one area needing renewal—anger, envy, or self-condemnation—and bring it to Him in honest prayer. Trust His promise to create in you a pure heart and to restore your joy. His refining work brings lasting freedom.\\n\\nEzekiel 36:25–27 • 1 John 1:9 • Psalm 86:11"
  },
  "10-14": {
    "verse": "“Peace I leave with you; my peace I give to you.” (John 14:27)",
    "text": "The peace Jesus offers transcends circumstances and surpasses human understanding. While the world's calm is fragile, His is deep and enduring. Today, exchange your anxieties for His peace by speaking this promise aloud in moments of stress. Let His tranquility guard your heart against fear and doubt. In His serenity, you'll find the courage to face each day's challenges.\\n\\nPhilippians 4:6–7 • Colossians 3:15 • Isaiah 26:3"
  },
  "10-15": {
    "verse": "“Do not be anxious about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God.” (Philippians 4:6)",
    "text": "Worry tempts you to fix things yourself, but God invites you to a better way: prayer paired with gratitude. When you present every concern to Him, you acknowledge His sovereignty and His loving care. Today, list two specific worries, pray them to God, and thank Him for past answered prayers. Notice how thanksgiving shifts your focus from fear to faith, opening space for His sustaining peace.\\n\\nMatthew 6:25–27 • 1 Peter 5:7 • Psalm 107:1"
  },
  "10-16": {
    "verse": "“Train up a child in the way he should go; even when he is old he will not depart from it.” (Proverbs 22:6)",
    "text": "Recovery often involves breaking generational patterns of dysfunction. As you learn healthy ways to live, you become a model of transformation for those who follow. Today, consider someone you influence—your child, a friend, or a peer—and intentionally demonstrate kindness, honesty, and integrity. Your example, rooted in God's truth, plants seeds of lasting change in their lives. God uses your journey to bless future generations.\\n\\nPsalm 78:5–7 • Deuteronomy 6:6–7 • Ephesians 6:4"
  },
  "10-17": {
    "verse": "“Therefore encourage one another and build one another up.” (1 Thessalonians 5:11)",
    "text": "Recovery can feel lonely, but God designed us for mutual support. Your words of affirmation and shared experiences lighten burdens and fuel perseverance. Today, reach out to someone on this journey—call, text, or meet for coffee—and offer genuine encouragement. In lifting them up, your own hope will be strengthened, and together you'll reflect Christ's love in community.\\n\\nHebrews 10:24–25 • Ephesians 4:29 • Galatians 6:2"
  },
  "10-18": {
    "verse": "“For nothing will be impossible with God.” (Luke 1:37)",
    "text": "When goals in recovery feel beyond reach—habit change, relationship repair, or emotional healing—remember that God's power knows no limits. He specializes in turning impossibility into testimony. Today, identify one challenge you've deemed too big and bring it to Him in prayer. Then take one bold step of faith, trusting His strength, not your own. You'll find His power at work in every victory, large or small.\\n\\nMark 10:27 • Jeremiah 32:17 • Ephesians 3:20"
  },
  "10-19": {
    "verse": "“Even in the valley of the shadow of death I will fear no evil.” (Psalm 23:4)",
    "text": "Recovery valleys—times of doubt, relapse, or deep grief—can feel like walking through dark shadows. Yet God walks with you even there, guiding your steps and comforting your heart. Today, repeat this verse as you face any emotional low, picturing His rod and staff protecting you. His presence transforms the valley from a place of fear into a path of supernatural peace and strength.\\n\\nIsaiah 43:2 • John 10:28–29 • Romans 8:38–39"
  },
  "10-20": {
    "verse": "“But they who wait for the LORD shall renew their strength.” (Isaiah 40:31)",
    "text": "It's tempting in recovery to grow impatient and force outcomes, but God's renewal comes in waiting on Him. As you rest in His timing—through prayer, worship, or Scripture—He replenishes your spirit. Today, when frustration rises, pause and declare this promise, asking for renewed strength. You'll find that waiting on Him isn't passive—it's active trust that empowers you to rise above every obstacle.\\n\\nPsalm 27:14 • Lamentations 3:25–26 • Hebrews 10:36"
  },
  "10-21": {
    "verse": "“Let your light shine before others, so that they may see your good works and give glory to your Father.” (Matthew 5:16)",
    "text": "Recovery transforms your story into a beacon of hope for those still in darkness. As you live with integrity, compassion, and grace, others glimpse Christ's work within you. Today, consider one area where you can reflect that light—through kindness, honesty, or service—and act on it. Your life, illuminated by God's love, points others to the only true Source of freedom.\\n\\nPhilippians 2:15 • Ephesians 5:8 • 1 Peter 2:12"
  },
  "10-22": {
    "verse": "“Create in me a clean heart, O God, and renew a right spirit within me.” (Psalm 51:10)",
    "text": "True change begins at the heart level, where God's cleansing grace transforms your innermost being. As you confess and surrender hidden sin or bitterness, He pours out forgiveness and renewal. Today, bring one lingering attitude—anger, envy, or shame—before Him in prayer, asking for a fresh start. In His restorative love, you'll discover a right spirit empowered to live in freedom.\\n\\nEzekiel 36:25–27 • 1 John 1:9 • Psalm 86:11"
  },
  "10-23": {
    "verse": "“God is our refuge and strength, a very present help in trouble.” (Psalm 46:1)",
    "text": "Unexpected trials—temptations, crises, or emotional storms—can leave you feeling unprepared. Yet God stands ready as your immediate refuge, offering strength and aid in the moment of need. Today, commit this promise to memory and call upon Him at the first sign of trouble. His nearness will steady your heart and provide exactly what you need to endure.\\n\\nPsalm 91:2 • Nahum 1:7 • Hebrews 13:5"
  },
  "10-24": {
    "verse": "“Taste and see that the LORD is good.” (Psalm 34:8)",
    "text": "Experiencing God's goodness personally transforms mere belief into vibrant trust. Recovery invites you to taste His kindness in everyday moments—answered prayer, a loving word, or unexpected provision. Today, be attentive to one fresh taste of His goodness and savor it with gratitude. Let that experience deepen your faith and sustain you through future challenges.\\n\\nPsalm 107:9 • Nahum 1:7 • John 6:35"
  },
  "10-25": {
    "verse": "“Cast all your anxieties on him, because he cares for you.” (1 Peter 5:7)",
    "text": "Anxiety can become a heavy weight that drags you back into old patterns of fear. Yet God's invitation is clear: hand over every worry—big or small—and trust His loving care. Today, write down two specific concerns, pray them to Him, and visualize placing them in His capable hands. As you release each one, feel His peace fill the space worry once occupied.\\n\\nMatthew 6:25–27 • Philippians 4:6–7 • Psalm 55:22"
  },
  "10-26": {
    "verse": "“Let everything that has breath praise the LORD!” (Psalm 150:6)",
    "text": "Worship isn't reserved for mountaintop moments—it's a daily practice that reorients your heart toward God's greatness. In recovery's valleys and peaks alike, praise shifts your focus from problems to the Provider. Today, choose a worship song or create a simple list of attributes you adore about God, and lift a heartfelt “Thank You.” As praise fills your soul, you'll find renewed strength to face every trial.\\n\\nHebrews 13:15 • Psalm 34:1 • Habakkuk 3:17–19"
  },
  "10-27": {
    "verse": "“Be strong and courageous. Do not be frightened, and do not be dismayed, for the LORD your God is with you wherever you go.” (Joshua 1:9)",
    "text": "Recovery often leads you into uncharted territory where fear lurks at every turn. Yet God's command is clear: be brave, because He walks with you every step of the way. Today, identify one fear you're facing—an upcoming conversation, a relapse trigger, or a new responsibility—and declare this promise over it. In His presence, courage becomes your natural response.\\n\\nDeuteronomy 31:6 • Isaiah 41:10 • Psalm 23:4"
  },
  "10-28": {
    "verse": "“For nothing will be impossible with God.” (Luke 1:37)",
    "text": "When recovery goals feel daunting—overhauling routines, mending relationships, or healing deep wounds—it's easy to despair. Yet God delights in doing the impossible through your surrendered faith. Today, write down one “impossible” dream you're holding onto, then pray for His power to bring it to life. Step forward in obedience on one small action, trusting He will multiply your effort beyond what you can imagine.\\n\\nMark 10:27 • Jeremiah 32:17 • Ephesians 3:20"
  },
  "10-29": {
    "verse": "“The righteous cry out, and the LORD hears them; he delivers them from all their troubles.” (Psalm 34:17)",
    "text": "In moments of deepest need—when you feel voiceless or powerless—God's ears are tuned to your cry. He doesn't wait for a perfect prayer; he responds to honest hearts seeking Him. Today, pour out your troubles in raw, unfiltered prayer, then listen for His gentle assurance. You'll discover that deliverance often begins the moment you voice your need and trust Him to act.\\n\\nPsalm 50:15 • 2 Samuel 22:7 • Isaiah 65:24"
  },
  "10-30": {
    "verse": "“Jesus Christ is the same yesterday and today and forever.” (Hebrews 13:8)",
    "text": "As you near the end of recovery's journey each day and each month, cling to the unchanging nature of Christ. While your feelings, circumstances, and challenges shift, His character remains constant—His love, power, and mercy never waver. Today, reflect on how He's been faithful throughout your recovery so far and thank Him for His steadfastness. Your trust in His constancy will anchor your soul amid every change.\\n\\nPsalm 102:27 • James 1:17 • Malachi 3:6"
  },
  "10-31": {
    "verse": "“Behold, I make all things new.” (Revelation 21:5)",
    "text": "As October closes, celebrate how God's renewing work has shaped each day—turning brokenness into beauty and despair into hope. His promise to make all things new extends to every aspect of your recovery journey. Today, look back over the month and note three specific ways He has brought renewal—maybe in your thoughts, relationships, or daily habits. Then step into November expecting more of His transformative power, confident that with Him, every ending is a fresh beginning.\\n\\n2 Corinthians 5:17 • Ezekiel 36:26 • Lamentations 3:22–23"
  },
  "11-1": {
    "verse": "“Your word is a lamp to my feet and a light to my path.” (Psalm 119:105)",
    "text": "In recovery, the next right step isn't always obvious—old patterns and fears can cloud your vision. Yet God's Word illuminates each choice, offering clarity when confusion threatens. Today, open Scripture and pause on a verse that speaks to your current struggle. Let its truth guide your thoughts and actions throughout the day. As you lean into His light, you'll discover that even small steps become sure and steady progress toward healing.\\n\\nPsalm 19:8 * Proverbs 6:23 * 2 Timothy 3:16"
  },
  "11-2": {
    "verse": "“When you pass through the waters, I will be with you; and through the rivers, they shall not overwhelm you.” (Isaiah 43:2)",
    "text": "Recovery often feels like being caught in a relentless current—overwhelming and unending. Yet God's promise is not to keep you dry, but to walk beside you through every flood. Today, in moments of pressure or fear, remind yourself that He is present and preventing you from being swept away. His companionship transforms drowning into safe passage. Trust Him to carry you through each trial with strength you don't possess on your own.\\n\\nPsalm 46:1–2 * 2 Timothy 4:18 * Romans 8:38–39"
  },
  "11-3": {
    "verse": "“The LORD is near to the brokenhearted and saves the crushed in spirit.” (Psalm 34:18)",
    "text": "Shame and regret can leave you feeling isolated and crushed under their weight. Yet God specializes in drawing close to those whose spirits are shattered. Today, bring your most painful memories before Him in prayer, and sense His nearness in the silence. His healing presence binds wounds the world cannot see, restoring courage to your soul. Even when you feel least worthy, His compassion reaches you.\\n\\nIsaiah 57:15 * 2 Corinthians 1:3–4 * Matthew 5:4"
  },
  "11-4": {
    "verse": "“God is our refuge and strength, a very present help in trouble.” (Psalm 46:1)",
    "text": "Unexpected challenges and old temptations can strike at any time, leaving you unprepared. Yet God isn't distant—He stands ready as your immediate shelter. Today, when trouble arises, turn to Him in a quick prayer of trust. Picture His strong arms as your fortress, keeping you safe and steady. His ever-present help empowers you to face each trial without fear.\\n\\nNahum 1:7 * Psalm 91:2 * Hebrews 13:5"
  },
  "11-5": {
    "verse": "“If any of you lacks wisdom, let him ask God, who gives generously to all without reproach.” (James 1:5)",
    "text": "Recovery is full of decisions—what to do next, how to respond in a difficult moment, which support to seek. You don't have to navigate these uncertainties alone. God delights in giving wisdom freely when you ask without doubting. Today, identify one choice weighing on you and pray specifically for discernment. Then watch for His gentle guidance in the whispers of your heart.\\n\\nProverbs 3:5–6 * Colossians 1:9 * John 16:13"
  },
  "11-6": {
    "verse": "“For I know the plans I have for you, declares the LORD, plans for welfare and not for evil, to give you a future and a hope.” (Jeremiah 29:11)",
    "text": "Recovery can cloud your vision of tomorrow, making the future seem uncertain or fearful. Yet God already holds the blueprint of your life, filled with hope rather than despair. Today, rest in His sovereignty—believe that every step you take, even the painful ones, fits into His redemptive plan. Trust that He is weaving your story into something beautiful and purposeful. Your hope in Him anchors you when fear threatens to overwhelm.\\n\\nRomans 8:28 * Proverbs 16:9 * Isaiah 55:8–9"
  },
  "11-7": {
    "verse": "“Do not be anxious about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God.” (Philippians 4:6)",
    "text": "Anxiety can hijack your mind, replaying regrets and projecting worst-case scenarios. Yet God calls you into a posture of prayer, exchanging worry for His peace. Today, take two minutes to list your anxieties, pray them to Him, and intentionally thank Him for past faithfulness. As you practice this exchange, His peace will guard your heart and mind. You'll find that worry loses its grip when prayer and gratitude take its place.\\n\\nPhilippians 4:7 * Matthew 6:25–27 * 1 Peter 5:7"
  },
  "11-8": {
    "verse": "“Humility is the fear of the LORD; its wages are riches and honor and life.” (Proverbs 22:4)",
    "text": "Recovery thrives on honest humility—acknowledging your need for God's help rather than leaning on your own strength. When you walk in reverent humility, He rewards you with blessings that enrich your soul. Today, practice humility by admitting one area where you need God's intervention, and invite a trusted friend or mentor to pray with you. As you lower yourself before God, He uplifts you, bringing honor and life in His perfect timing.\\n\\nPsalm 25:9 * James 4:10 * Micah 6:8"
  },
  "11-9": {
    "verse": "“The heart of man plans his way, but the LORD establishes his steps.” (Proverbs 16:9)",
    "text": "You may craft careful plans for recovery—schedules, goals, and routines—but ultimately only God can secure your progress. His wisdom refines your intentions and guides your steps into places you couldn't foresee. Today, review one plan you're anxious about and hand it over to Him in prayer, asking Him to establish your steps. Trust that as you yield your roadmap, His providence will lead you along paths of peace and purpose.\\n\\nPsalm 37:23 * Isaiah 30:21 * James 1:5"
  },
  "11-10": {
    "verse": "“Let all that you do be done in love.” (1 Corinthians 16:14)",
    "text": "Recovery can sharpen your focus on self—survival, stability, success. Yet love transforms every act into worship when it shapes your motive. Today, choose one routine task—work, chores, conversation—and perform it with intentional kindness. As you infuse love into the ordinary, you reflect Christ's heart and find joy in service. Love not only changes your actions but renews your own spirit.\\n\\nRomans 12:9–10 * Galatians 5:22–23 * Colossians 3:23"
  },
  "11-11": {
    "verse": "“Be strong and courageous. Do not be frightened, and do not be dismayed, for the LORD your God is with you wherever you go.” (Joshua 1:9)",
    "text": "Recovery often leads you into uncharted territory where fear can grip your heart. But God's presence goes before you, transforming every unknown into an opportunity for courage. Today, identify one fear—relapse, judgment, failure—and declare this promise over it. As you step forward in faith, His companionship will replace your dread with confidence in His unfailing care.\\n\\nDeuteronomy 31:6 * Isaiah 41:10 * Psalm 23:4"
  },
  "11-12": {
    "verse": "“Create in me a clean heart, O God, and renew a right spirit within me.” (Psalm 51:10)",
    "text": "True healing begins deep in the heart, not just in outward behavior. God invites you to a radical cleansing—He wants to renew your inner life with His purity. Today, confess one hidden attitude or resentment and ask Him to transform it. As He creates a clean heart and right spirit within you, your thoughts and actions will naturally follow His lead. His renewal brings lasting freedom.\\n\\nEzekiel 36:26–27 * 1 John 1:9 * Psalm 86:11"
  },
  "11-13": {
    "verse": "“Be still before the LORD and wait patiently for him.” (Psalm 37:7)",
    "text": "In the urgency of recovery, waiting can feel counterproductive—like lost time. Yet God's work often unfolds in the pause, where trust is strengthened and character is refined. Today, practice being still: turn off distractions, breathe deeply, and rest in His presence for five minutes. Let His voice speak peace to your anxious heart, and discover that waiting on Him is an act of faith that yields spiritual growth.\\n\\nExodus 14:14 * Lamentations 3:25–26 * Isaiah 30:18"
  },
  "11-14": {
    "verse": "“The LORD is near to all who call on him, to all who call on him in truth.” (Psalm 145:18)",
    "text": "Authentic communication with God isn't about polished words—it's about honest cries from the heart. When you call on Him in truth—beyond the masks you wear—He draws near to comfort and guide you. Today, speak candidly to Him about whatever burdens your soul, even if your words are raw. In that vulnerable exchange, His nearness becomes your greatest strength and solace.\\n\\nJeremiah 29:12–13 * Matthew 7:7–8 * Hebrews 4:16"
  },
  "11-15": {
    "verse": "“Commit your work to the LORD, and your plans will be established.” (Proverbs 16:3)",
    "text": "Recovery requires you to rebuild life—new habits, relationships, and purpose. Instead of relying on sheer will, surrender every goal to God, trusting He will direct your efforts. Today, choose one project—physical health, job search, or spiritual discipline—and pray over it, asking for His blessing. As you partner with Him, your plans gain divine direction and endurance far beyond what you could achieve alone.\\n\\nPsalm 37:5 * James 4:13–15 * Isaiah 58:11"
  },
  "11-16": {
    "verse": "“Cast all your anxieties on him, because he cares for you.” (1 Peter 5:7)",
    "text": "Worry over finances, health, or relationships can sap your energy and hope. Yet God's invitation is simple: hand every concern over to Him, trusting His loving care. Today, write down two persistent anxieties, pray them to Him, and visualize placing them in His hands. Notice how His peace replaces the weight of worry as you entrust Him with what feels beyond your control.\\n\\nMatthew 6:25–27 * Philippians 4:6–7 * Psalm 55:22"
  },
  "11-17": {
    "verse": "“Let your light shine before others, so that they may see your good works and give glory to your Father.” (Matthew 5:16)",
    "text": "Recovery isn't just personal victory—it's a testimony that points others to God's transforming power. As you live with integrity and compassion, your daily choices become a beacon of hope. Today, look for one opportunity to act in kindness or honesty where it's unexpected. Your “good works” shine any darkness away, inviting those around you to glorify God.\\n\\nPhilippians 2:15 * Ephesians 5:8 * 1 Peter 2:12"
  },
  "11-18": {
    "verse": "“Rejoice always, pray without ceasing, give thanks in all circumstances.” (1 Thessalonians 5:16–18)",
    "text": "Joy, prayer, and gratitude form a powerful triad that sustains you in recovery's ups and downs. When you cultivate constant rejoicing, continual prayer, and consistent thankfulness, your heart stays anchored in God's goodness. Today, practice each: find a reason to rejoice, offer a quick prayer of dependence, and thank Him for a specific blessing. These small rhythms build a resilient spirit that weathers every trial.\\n\\nPhilippians 4:4 * Colossians 4:2 * Psalm 107:1"
  },
  "11-19": {
    "verse": "“But they who wait for the LORD shall renew their strength; they shall mount up with wings like eagles.” (Isaiah 40:31)",
    "text": "When you feel the drag of fatigue or frustration, waiting can seem impossible. Yet waiting on God is an active trust that invites His renewal. Today, pause in prayer, declare this promise, and ask for fresh strength. As you rest in His timing, His power will lift you above challenges, empowering you to soar beyond what you thought possible.\\n\\nPsalm 27:14 * Lamentations 3:25–26 * Hebrews 10:23"
  },
  "11-20": {
    "verse": "“Peace I leave with you; my peace I give you.” (John 14:27)",
    "text": "The world's peace is fragile and conditional, but Jesus offers an enduring calm that anchors your soul. When anxiety or conflict arises, invite His peace to rule your thoughts and emotions. Today, practice a short breath prayer: inhale His promise of peace, exhale your tension in trust. As you do, His tranquility will guard your heart, guiding every response.\\n\\nPhilippians 4:6–7 * Colossians 3:15 * Isaiah 26:3"
  },
  "11-21": {
    "verse": "“Be strong, and let your heart take courage, all you who wait for the LORD!” (Psalm 31:24)",
    "text": "Waiting on God can test your resolve, but He calls you to rise in strength and courage. Even when answers tarry, trust that He is at work behind the scenes. Today, declare this promise over your situation and choose courage in your spirit. As you anchor your heart in His faithfulness, you'll discover He empowers you to endure and thrive—no matter the wait.\\n\\nIsaiah 40:31 * Hebrews 12:1 * Ephesians 6:10"
  },
  "11-22": {
    "verse": "“Create in me a clean heart, O God, and renew a right spirit within me.” (Psalm 51:10)",
    "text": "Surface change isn't enough—you need a heart transformation that only God can provide. When you confess and surrender hidden sins or attitudes, He responds with cleansing and renewal. Today, bring one inner struggle—pride, envy, or bitterness—before Him in prayer. Trust His promise to create a pure heart and to restore a willing spirit that reflects His character.\\n\\nEzekiel 36:25–27 * 1 John 1:9 * Psalm 86:11"
  },
  "11-23": {
    "verse": "“The Lord is gracious and merciful, slow to anger and abounding in steadfast love.” (Psalm 145:8)",
    "text": "You may fear God's anger over past failures, but Scripture reveals a heart overflowing with grace and patience. His response to your mistakes is not wrath but lovingkindness. Today, approach Him in prayer as a compassionate Father, not a condemning judge. Receive His steadfast love and let it reshape how you view yourself and others.\\n\\nLamentations 3:22–23 * Exodus 34:6 * Micah 7:18"
  },
  "11-24": {
    "verse": "“Commit your way to the LORD; trust in him, and he will act.” (Psalm 37:5)",
    "text": "You might try to take control of every detail in recovery, but God invites you to entrust Him with your path. When you commit your plans and worries to Him, He acts on your behalf. Today, identify one pressing concern or goal, pray over it, and then release it in faith. Watch how He moves circumstances in ways that exceed your expectations.\\n\\nProverbs 16:3 * Romans 8:28 * Isaiah 46:10"
  },
  "11-25": {
    "verse": "“Let all that you do be done in love.” (1 Corinthians 16:14)",
    "text": "Recovery success isn't measured by productivity alone but by the love that motivates every action. When love guides your choices—whether work, relationships, or self-care—you reflect Christ's heart. Today, choose love as the filter for a routine interaction or task. Let compassion and patience shape your words and deeds, transforming ordinary moments into acts of worship.\\n\\nRomans 12:9–10 * Galatians 5:22–23 * Colossians 3:23"
  },
  "11-26": {
    "verse": "“But they who wait for the LORD shall renew their strength; they shall mount up with wings like eagles.” (Isaiah 40:31)",
    "text": "A second reminder on this promise underscores God's heart for your perseverance. When recovery feels like an endless climb, waiting on Him isn't passive—it's an act of faith that rejuvenates your soul. Today, intentionally pause mid-day, declare this verse, and ask anew for His strength. You'll find His power lifting you to face every challenge with fresh hope.\\n\\nPsalm 27:14 * Lamentations 3:25–26 * 2 Corinthians 4:16–18"
  },
  "11-27": {
    "verse": "“Be still before the LORD and wait patiently for him; fret not yourself over the one who prospers in his way.” (Psalm 37:7)",
    "text": "Comparison can steal both peace and progress—especially when you see others succeeding where you once failed. Yet God calls you to stillness and trust in His unique timing and plan for your life. Today, when envy or frustration arises, pause and refocus on your own path under His guidance. Let patience replace comparison, knowing that His purposes for you are good and perfectly timed.\\n\\nPsalm 37:23 * Proverbs 14:30 * James 1:9–10"
  },
  "11-28": {
    "verse": "“Cast all your anxieties on him, because he cares for you.” (1 Peter 5:7)",
    "text": "Repeated to reinforce God's invitation—He truly cares about every worry you carry. When life's pressures mount, handing them over to Him is a powerful act of trust. Today, choose one overwhelming concern, give it to Him in prayer, and then work on a practical next step rather than stewing in fear. His care transforms your approach from frantic effort to steady faith.\\n\\nMatthew 6:25–27 * Philippians 4:6–7 * Psalm 55:22"
  },
  "11-29": {
    "verse": "“Faithful is he who calls you, and he also will bring it to pass.” (1 Thessalonians 5:24)",
    "text": "Recovery journeys can falter when you doubt whether God can complete what He began in you. Yet His faithfulness guarantees that He who called you into freedom will sustain you until the end. Today, reflect on how far you've come and affirm His commitment to finish the good work. Let that assurance embolden you to press on, even when the road feels long.\\n\\nPhilippians 1:6 * Hebrews 10:23 * Romans 8:30"
  },
  "11-30": {
    "verse": "“Jesus Christ is the same yesterday and today and forever.” (Hebrews 13:8)",
    "text": "As November ends, celebrate the unchanging nature of Christ—His love, mercy, and power remain constant through every season of life. Regardless of your feelings or circumstances, His character provides a stable foundation. Today, thank Him for His steadfastness and trust that His faithful presence will carry you into the next month and every one after.\\n\\nPsalm 102:27 * James 1:17 * Malachi 3:6"
  },
  "12-1": {
    "verse": "“Thus says the LORD, ‘In repentance and rest you shall be saved; in quietness and in trust shall be your strength.'” (Isaiah 30:15)",
    "text": "Recovery often tempts you to push harder, believing change comes through sheer willpower. Yet God calls you first to repentance and rest—an honest turning of the heart and a peaceful reliance on Him. Today, carve out a moment of quiet prayer: confess where you've depended on your own strength, then lean into His. As you trust rather than strive, His gentle power becomes your sustaining strength. Rest in His invitation, and let His grace rewrite your story.\\n\\nLamentations 3:22-23 * Matthew 11:28-29 * Psalm 94:19"
  },
  "12-2": {
    "verse": "“Your word is a lamp to my feet and a light to my path.” (Psalm 119:105)",
    "text": "In the darkness of uncertainty, Scripture shines with clarity—showing you the next right step instead of leaving you to stumble. When old habits whisper lies, God's Word speaks truth that silences fear. Today, read a verse slowly and meditate on how it applies to your current challenge. Let its light guide every choice, illuminating what you cannot see on your own. Over time, His Word becomes the steady compass of your recovery journey.\\n\\nPsalm 19:8 * Proverbs 6:23 * 2 Timothy 3:16-17"
  },
  "12-3": {
    "verse": "“The LORD is near to the brokenhearted and saves the crushed in spirit.” (Psalm 34:18)",
    "text": "Heartache and regret can leave you feeling crushed under their weight, but God draws especially close in those moments. He doesn't wait for you to clean yourself up before He heals—you're held and restored in your brokenness. Today, bring your deepest wounds before Him in prayer, trusting He will bind them with His compassion. As His presence surrounds your pain, you'll find courage to take another step forward. His nearness transforms sorrow into hope.\\n\\nIsaiah 61:1 * 2 Corinthians 1:3-4 * Matthew 5:4"
  },
  "12-4": {
    "verse": "“Come to me, all who labor and are heavy laden, and I will give you rest.” (Matthew 11:28)",
    "text": "Recovery can feel like an endless uphill climb, leaving you exhausted in body and spirit. Jesus extends a simple invitation: bring your burdens to Him and receive His rest. Today, pause long enough to place every worry, fear, and failure into His hands. As you abide in His rest, you'll discover renewal for your weary soul and fresh perspective for your path. His rest doesn't remove the work, but it fills you with strength to do it.\\n\\nPsalm 23:2-3 * Hebrews 4:16 * Isaiah 40:29"
  },
  "12-5": {
    "verse": "“My grace is sufficient for you, for my power is made perfect in weakness.” (2 Corinthians 12:9)",
    "text": "When you feel your limitations most acutely—emotionally, physically, or spiritually—God's grace shines brightest. He doesnpyt require perfection; He offers His power amid your imperfections. Today, identify one area of weakness—fear, temptation, self-doubt—and bring it before Him in honest prayer. Then rest in His promise to meet you with enough grace. In your vulnerability, His strength becomes undeniably present.\\n\\nIsaiah 40:29 * Ephesians 6:10 * 2 Corinthians 4:7"
  },
  "12-6": {
    "verse": "“Cast all your anxieties on him, because he cares for you.” (1 Peter 5:7)",
    "text": "Anxiety trickles into every corner of recovery—worry over relapse, relationships, or tomorrow's challenges. God doesn't want you to carry those burdens alone; He invites you to lay them at His feet. Today, write down three specific anxieties, then pray them to Him one by one, imagining His loving hands taking each. As you release your cares, let His peace fill the spaces worry once occupied. His care for you is personal and deep.\\n\\nMatthew 6:25-27 * Philippians 4:6-7 * Psalm 55:22"
  },
  "12-7": {
    "verse": "“In all your ways acknowledge him, and he will make straight your paths.” (Proverbs 3:6)",
    "text": "Recovery decisions—big and small—can feel overwhelming when you face them alone. God promises that as you acknowledge Him in every plan, He will guide you on clear, straight paths. Today, before you make any choice, ask, “God, are You leading me here?” Then listen for His prompt and follow it, even if it contradicts your instincts. Over time, trusting His guidance becomes your greatest compass.\\n\\nPsalm 37:23 * Isaiah 30:21 * James 1:5"
  },
  "12-8": {
    "verse": "“Be still, and know that I am God.” (Psalm 46:10)",
    "text": "Your natural response to stress is to act, to fix, to control—but God calls you to stillness, where true peace and clarity arise. In the midst of your recovery tasks, pause and remind yourself that He is sovereign over every circumstance. Today, take two uninterrupted minutes for silent reflection—no phone, no agenda—just you and your Creator. In that quiet, let His presence wash over your anxiety, anchoring your heart in His power.\\n\\nExodus 14:14 * Lamentations 3:25-26 * Mark 6:31"
  },
  "12-9": {
    "verse": "“Trust in the LORD with all your heart, and do not lean on your own understanding.” (Proverbs 3:5)",
    "text": "Your mind will offer reasons to doubt or to rely on your own solutions, but God invites wholehearted trust in Him instead. When you feel confusion or fear creep in, choose to lean on His understanding rather than your own. Today, name one situation where you've been overthinking—then pray, “Lord, I trust You here.” Notice how releasing control frees you to follow wherever He leads.\\n\\nJeremiah 17:7 * Isaiah 26:4 * Psalm 37:5"
  },
  "12-10": {
    "verse": "“The LORD is my light and my salvation; whom shall I fear?” (Psalm 27:1)",
    "text": "Darkness—past mistakes, shame, or fear—can feel daunting in recovery. Yet when God is your light, He dispels every shadow, and when He is your salvation, He rescues you from every threat. Today, speak this verse aloud over whatever intimidates you and picture His light illuminating the path ahead. His presence transforms fear into boldness. Whom then will you dread?\\n\\nIsaiah 41:10 * John 8:12 * Romans 8:31"
  },
  "12-11": {
    "verse": "“Create in me a clean heart, O God, and renew a right spirit within me.” (Psalm 51:10)",
    "text": "Authentic transformation begins at the heart level, beyond outward behavior change. God invites you to a deep cleansing—He wants to renew your motives and affections from within. Today, admit one inner struggle—pride, resentment, or self-condemnation—and ask for His purifying work. As He renews your spirit, your choices and reactions will naturally reflect His holiness.\\n\\nEzekiel 36:26-27 * 1 John 1:9 * Psalm 86:11"
  },
  "12-12": {
    "verse": "“Commit your work to the LORD, and your plans will be established.” (Proverbs 16:3)",
    "text": "Recovery involves daily tasks—meetings, therapy, healthy routines—but each step gains divine backing when you entrust it to God. Instead of pushing forward alone, open each day with a simple prayer: “Lord, I commit this to You.” Today, before any task, lift it to Him. He will bless your efforts and set your steps on firm ground.\\n\\nPsalm 37:5 * James 4:13-15 * Isaiah 58:11"
  },
  "12-13": {
    "verse": "“Cast your burden on the LORD, and he will sustain you.” (Psalm 55:22)",
    "text": "The weight of past regrets and future worries can drag you down, tempting you toward despair or relapse. Yet God's invitation is to hand over every burden and trust His sustaining care. Today, choose one heavy thought—guilt, fear, doubt—and literally “place” it on Him in prayer. As you surrender your load, feel His strength undergird your spirit. He carries what you cannot.\\n\\n1 Peter 5:7 * Matthew 11:28-30 * Psalm 68:19"
  },
  "12-14": {
    "verse": "“Be strong and courageous. Do not be frightened, and do not be dismayed, for the LORD your God is with you wherever you go.” (Joshua 1:9)",
    "text": "Recovery often leads you into new territories—fresh challenges where doubt can steal your courage. Yet God's command is clear: be brave, because He is with you every step. Today, name one situation that you find intimidating, declare this promise over it, and take one small act of obedience. With His presence beside you, courage becomes natural.\\n\\nDeuteronomy 31:6 * Isaiah 41:10 * Psalm 23:4"
  },
  "12-15": {
    "verse": "“Draw near to God, and he will draw near to you.” (James 4:8)",
    "text": "When you feel distant—overwhelmed by tasks or tempted to isolate—God invites you into intimacy. Every honest prayer, every moment in His Word, draws His heart closer to yours. Today, spend five focused minutes in simple conversation with Him—no agenda, just honest sharing. You'll find His nearness a source of comfort and strength throughout your day.\\n\\nPsalm 145:18-19 * Hebrews 10:22 * Jeremiah 29:13"
  },
  "12-16": {
    "verse": "“Let everything that has breath praise the LORD!” (Psalm 150:6)",
    "text": "Praise isn't reserved for mountaintop experiences—it's a daily discipline that shifts your focus from circumstances to the Creator. In recovery, lifting your voice in gratitude—even amid struggle—invites God's joy into your soul. Today, breathe deeply and offer five short praises: for life, for mercy, for strength, for community, for hope. As you praise, notice your perspective lift and your spirit strengthen.\\n\\nHebrews 13:15 * Psalm 34:1 * Habakkuk 3:17-19"
  },
  "12-17": {
    "verse": "“Trust in the LORD forever, for the LORD GOD is an everlasting rock.” (Isaiah 26:4)",
    "text": "Uncertainty in recovery can shake your confidence, but when you anchor your trust in God—your unchanging Rock—you stand firm. His character never shifts, even when feelings and situations do. Today, when doubt arises, rehearse this truth aloud: He is my Everlasting Rock. Let that unmovable foundation steady your steps and give you courage to face every change.\\n\\nPsalm 31:6 * Proverbs 3:5-6 * Deuteronomy 32:4"
  },
  "12-18": {
    "verse": "“Count it all joy, my brothers, when you meet trials of various kinds.” (James 1:2)",
    "text": "Trials in recovery can feel cruel—but God uses them to refine your faith, build perseverance, and cultivate maturity. Rather than resent hardship, embrace it as a teacher shaping your character. Today, choose one difficulty you face and ask, “What is God teaching me here?” Thank Him for the lesson, and watch how joy and growth emerge from your trials.\\n\\nRomans 5:3-4 * 1 Peter 1:6-7 * Hebrews 12:11"
  },
  "12-19": {
    "verse": "“My help comes from the LORD, who made heaven and earth.” (Psalm 121:2)",
    "text": "When problems loom large, remember the same God who set galaxies in motion is also your personal helper. He delights in rescuing you and providing what you lack. Today, look upward in faith—remind yourself of His creative power and caring heart. As you trust Him with your needs, you'll find courage to face every challenge, knowing He sustains you with infinite strength.\\n\\nPsalm 46:1 * Isaiah 41:13 * Hebrews 13:5"
  },
  "12-20": {
    "verse": "“Humility comes before honor.” (Proverbs 15:33)",
    "text": "Recovery demands honest humility—admitting you cannot heal alone and need God's grace at every turn. When you lower yourself before Him and others, He lifts you in unexpected ways. Today, practice humility by seeking feedback or help in one area of your recovery. As you receive correction and support, you'll grow stronger and find the honor of walking in God's purposes.\\n\\nJames 4:6 * Philippians 2:3-4 * Micah 6:8"
  },
  "12-21": {
    "verse": "“Create in me a clean heart, O God, and renew a right spirit within me.” (Psalm 51:10)",
    "text": "Renewal in recovery isn't just about stopping old behaviors—it's about inviting God to reshape your innermost being. He longs to cleanse your motives and fill you with a fresh, willing spirit. Today, admit one hidden struggle—bitterness, pride, or shame—and ask for His transforming touch. As He renews your heart, your outward life will follow in freedom and joy.\\n\\nEzekiel 36:26-27 * 1 John 1:9 * Psalm 86:11"
  },
  "12-22": {
    "verse": "“Be still before the LORD and wait patiently for him.” (Psalm 37:7)",
    "text": "In the rush to progress, waiting can feel like lost time, but God's most vital work often unfolds in the pause. He uses stillness to shape character, deepen faith, and cultivate dependence. Today, step away from your to-do list for five minutes—breathe prayerfully, focus on His presence, and listen. In that sacred space, His timing becomes your strength and His purposes become clear.\\n\\nExodus 14:14 * Lamentations 3:25-26 * Isaiah 30:18"
  },
  "12-23": {
    "verse": "“The LORD is gracious and merciful, slow to anger and abounding in steadfast love.” (Psalm 145:8)",
    "text": "You may fear God's judgment for past mistakes, but His heart overflows with patience and mercy. He delights to extend lovingkindness even when you feel least deserving. Today, approach Him with open hands and receive His abundant grace. Then reflect that mercy to someone else in need of compassion. In both giving and receiving, you experience the fullness of His love.\\n\\nLamentations 3:22-23 * Exodus 34:6 * Micah 7:18"
  },
  "12-24": {
    "verse": "“Glory to God in the highest, and on earth peace among those with whom he is pleased!” (Luke 2:14)",
    "text": "As you celebrate Christmas Eve in recovery, remember the angels' song: true peace comes from God's glory entering our world. Christ's birth ushered in a peace that surpasses understanding and anchors our restless hearts. Today, pause in worship—sing, pray, or meditate on Immanuel: “God with us.” Let His peace reign in your soul and overflow to those around you. His presence brings joy beyond any circumstance.\\n\\nIsaiah 9:6 * John 14:27 * Philippians 4:7"
  },
  "12-25": {
    "verse": "“For to us a child is born, to us a son is given.” (Isaiah 9:6)",
    "text": "On Christmas Day, we celebrate the gift of God's Son—born into our broken world to bring healing, hope, and salvation. Recovery reminds us of our need for a Savior who rescues us from sin and despair. Today, reflect on the wonder of Immanuel—God with us in our struggles. Receive His gift afresh, allowing His love to fill every void. As you embrace Christ's presence, your heart finds true freedom and purpose.\\n\\nLuke 2:10-11 * John 3:16 * Matthew 1:23"
  },
  "12-26": {
    "verse": "“Let the peace of Christ rule in your hearts.” (Colossians 3:15)",
    "text": "After the festivities, it's easy to feel an emotional crash—disappointment, loneliness, or fatigue. Yet Christ's peace doesn't ebb with changing moods or seasons. When you let His peace govern your feelings and decisions, your heart remains steady. Today, practice a simple breath prayer: inhale His peace, exhale your tension. Let His tranquility become your constant companion.\\n\\nPhilippians 4:6-7 * John 14:27 * Isaiah 26:3"
  },
  "12-27": {
    "verse": "“Give thanks to the LORD, for he is good, for his steadfast love endures forever.” (Psalm 107:1)",
    "text": "The holiday season can highlight what's missing, but gratitude shifts your gaze to God's unchanging goodness. His love never wavers, regardless of your circumstances. Today, list three blessings from this year—small or large—and thank Him for each. As you cultivate a heart of gratitude, your perspective transforms from lack to abundance.\\n\\n1 Chronicles 16:34 * Psalm 136:1 * Philippians 4:6"
  },
  "12-28": {
    "verse": "“Draw near to God, and he will draw near to you.” (James 4:8)",
    "text": "Year-end transitions can stir uncertainty about what lies ahead. Yet God's promise stands firm: when you reach out to Him, He reaches back. Whether through prayer, worship, or Scripture, every step toward God invites His presence into your journey. Today, take five focused minutes to share your hopes and fears with Him, then listen in silence. His nearness dispels doubt and ignites hope for the new year.\\n\\nPsalm 145:18-19 * Hebrews 10:22 * Jeremiah 29:13"
  },
  "12-29": {
    "verse": "“Behold, I am making all things new.” (Revelation 21:5)",
    "text": "As the year closes, celebrate God's promise of renewal—He's at work transforming every broken place into something beautiful. Recovery is part of that new creation, a testament to His redemptive power. Today, reflect on how He's made things new in your life this year—habits changed, relationships restored, hope rekindled. Thank Him for the work He's begun and step into tomorrow expecting continued renewal.\\n\\n2 Corinthians 5:17 * Ezekiel 36:26 * Lamentations 3:22-23"
  },
  "12-30": {
    "verse": "“The steadfast love of the LORD never ceases; his mercies never come to an end.” (Lamentations 3:22)",
    "text": "Even as one year ends and another begins, God's faithfulness remains constant. His mercies greet you each morning, ready to sustain you through whatever comes. Today, receive one fresh mercy—grace for a mistake, strength for a task, comfort in a struggle—and let it remind you that His love never wavers. In that assurance, you'll find the courage to face a new year with unwavering hope.\\n\\nPsalm 136:1 * Hebrews 4:16 * Ephesians 2:4-5"
  },
  "12-31": {
    "verse": "“Jesus Christ is the same yesterday and today and forever.” (Hebrews 13:8)",
    "text": "As you bid farewell to this year, anchor your heart in the unchanging nature of Christ—His character, promises, and presence endure through every season. Your circumstances will shift, but His love and power remain constant. Today, thank Him for His faithfulness throughout the year and entrust your future into His hands. With Jesus unchanging by your side, you can step into the new year with confident faith and expectant joy.\\n\\nPsalm 102:27 * James 1:17 * Malachi 3:6"
  }
}